[
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "AI Engineer - Core Education",
    "company": "Stemuli",
    "jobLocation": "Dallas, TX 75201 \n(Downtown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=be1c66f51b5e950b",
    "salary": "$150,000 - $185,000 a year - Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Company Overview Stemuli is a pioneering technology company at the intersection of AI, gaming, and workforce development. Backed by the Gates Foundation, Stride Learning, Heartland Forward, Draper & Associates, Slauson & Co, and Valor Ventures, Stemuli is building the world's first AI-native educational gaming platform. Recognized as the 2024 Global Champion of AI for Good by the United Nations, our mission is to make education and career development personalized, engaging, and accessible to billions of learners worldwide. Position Overview As an AI Engineer – Core Education, you will play a pivotal role in advancing the intelligence of ORB Chat, our personalized AI learning companion. You'll build the core AI systems that power daily motivational dialogues, adaptive tutoring, and real-time guidance that helps students connect their academic progress (e.g., math and AI literacy) with future career opportunities. Your work will be central to scaling ORB to serve hundreds of thousands of students across Stride schools, Heartland Forward's 20-state initiative, and our international partnerships. Responsibilities...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Software Bloc",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98eb1ba8f067f30e",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Work on improvements to methods and algorithms, developing innovative and effective approaches to solve businesses’ analytical problems and communicate these results and methodologies to our teams; Support recommendations of ongoing improvements that lead to findings, including new information, in collaboration with our Lead Data Scientist; Bachelor’s Degree in Mathematics, Statistics, Computer Science or related field",
    "description": "Software Bloc LLC, Plano, TX Technologies –Proficient in Python and R with experience in SQL, GitHub (not a deal breaker), and AWS/Azure and cloud storage related experience. Full Time JOB DESCRIPTION Your role will work to inform the business on strategic recommendations on data collection, integration, and retention requirements incorporating business needs and knowledge of best practices...",
    "preferences": "Skills to communicate well in a global environment",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Cyber Infotech",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fc93d4af354c1d0f",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Build, implement and maintain predictive models through their full lifecycle. Identify patterns & trends in data, and provides insights to enhance business decision making. Identify challenges and opportunities from client strategy discussions and taking ownership of solution. Set up and monitor monthly model recalibration process. Generate complex ad-hoc analyses combining disparate concepts or creating new approaches....",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Data Xpander",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=cdaa9e9635b3200e",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "We expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).; Day-to-day, your responsibilities are to:; Work with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.; Work with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.; Answer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.; Develop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.; Utilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.; Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.; Optimize models for scaled production usage.; Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.; Write clean, efficient, and modular code, with automated tests and appropriate documentation.; Stay up to date with technology, make good technological choices, and be able to explain them to the organization.; Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.; A strong understanding of the math and theory behind machine learning and deep learning.; Software engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).; Machine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).; An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.; Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.; Excellent communication and teamwork skills.; Fluent in written and spoken English.; Would be a plus:; Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.; Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).; Familiarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.; Experience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).; Showcase previous work (e.g. via a website, presentation, open source code).; Additional Information; Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "description": "Company Description When you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education. Turnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines. Turnitin, LLC is an equal opportunity employer- vets/disabled....",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789b20dee7d0ba72",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;",
    "qualifications": "Education; Bachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.; Experience; Advanced experience in data science, machine learning, AI, or optimization projects.; Proficiency in Python and SQL.; Strong understanding of statistical methods, experimental design, and model validation.; Experience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).; Familiarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).",
    "description": "Benefits: HYBRID Competitive salary Opportunity for advancement Training & development...",
    "preferences": "Experience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).; Exposure to specialized analytics areas such as simulation, graph analytics, or video analytics.; Skills & Abilities; Ability to independently manage and deliver on complex projects.; Strong problem-solving and critical thinking skills.; Effective communication skills for both technical and executive audiences.; Ability to adapt quickly to changing priorities and new technologies.; Strong interpersonal and collaboration skills.; .....",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Decision Science Analyst",
    "company": "Kobie Marketing",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=71b38a52461f949c",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Join a National Top Workplace Named a Top Workplace in the USA and Top Remote Workplace, Kobie is where the best minds in loyalty come together, driven by passion and innovation. We’re always looking for talented individuals who are ready to join a collaborative, growth-focused culture. As a partner to some of the world’s most recognized brands, we are leaders in loyalty, helping brands build lasting emotional connections with their consumers. Join Us from Anywhere While our headquarters are nestled in sunny St. Petersburg, Florida, Kobie embraces a flexible work environment, offering teammates the freedom to work remotely. We understand the importance of work-life balance and support our team with: Flexible Time Off to recharge when needed...",
    "preferences": "Who we are As a trusted partner, Kobie delivers market-leading, end-to-end loyalty solutions designed to enable customer experiences for the world's most successful brands. We do this with a strategy-led technology approach that uncovers the truth behind what drives consumers on an emotional level. We believe that our team's passion and expertise are the driving forces behind our success and are proud to be named a Top Workplaces in the USA, where the best and brightest in loyalty drive our mission of growing enterprise value through loyalty.; A place for all We celebrate and embrace diversity at Kobie!",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Science Subject Matter Experts",
    "company": "Zion Zest LLC",
    "jobLocation": "Dallas, TX 75244",
    "jobUrl": "https://www.indeed.com/viewjob?jk=34f39dba2736a427",
    "salary": "$180,000 - $250,000 a year - Full-time, Contract",
    "benefits": "Benefits\nPulled from the full job description\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "Train junior Data Science Engineers and help them with programming.; Proficiency in programming languages such as C and VBA for data manipulation and analysis.; Strong knowledge of SQL for database querying and management.; Experience with linked data concepts and analytics tools.; Familiarity with machine learning frameworks (e.g., TensorFlow, PyTorch) is a plus.; Demonstrated ability in data mining techniques for extracting insights from large datasets.; Excellent problem-solving skills with a keen analytical mindset.; Strong communication skills, both written and verbal, for effective collaboration across teams.",
    "description": "Overview We are seeking a skilled and motivated Data Scientist to join our dynamic team. In this role, you will leverage your expertise in data analytics, machine learning, and statistical modeling to extract valuable insights from complex datasets. You will work collaboratively with cross-functional teams to drive data-driven decision-making and contribute to innovative projects that enhance our business strategies. Responsibilities SME Expertise: Seek out an SME with in-depth knowledge of data science concepts (e.g., machine learning, statistical modeling, programming languages like Python or R) and practical experience in applying these within a business context. Passion for Teaching: The SME should be passionate about teaching and able to simplify complex concepts for different learning levels within the organization....",
    "preferences": "Join us in harnessing the power of data to drive innovation and success!; Job Types: Full-time, Contract; Pay: $180,000.00 - $250,000.00 per year",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Machine Learning Engineer",
    "company": "Tiger Analytics",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=e8b61f5ad64f8bbf",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Google Cloud Platform (GCP) Experience: Strong proficiency in GCP services, including data engineering and machine learning tools.; Google Vertex AI Expertise: Hands-on experience with model training, deployment, and optimization using Vertex AI.; Model Development & Deployment: Proven ability to design, build, and productionize machine learning models.; API Development: Skilled in developing robust APIs for seamless integrations.; Python Programming with CI/CD: Experience in Python-based applications and implementing CI/CD pipelines.; Why Join Us?; Work remotely while contributing to cutting-edge projects.; Collaborate with a dynamic team passionate about AI/ML innovation.; Opportunity to work with the latest Google Cloud technologies.; Ready to take the next step? Apply now and be part of a team that’s shaping the future of AI!",
    "description": "Tiger Analytics is an advanced analytics consulting firm. We are the trusted analytics partner for several Fortune 100 companies, enabling them to generate business value from data. Our consultants bring deep expertise in Data Science, Machine Learning, and AI. Our business value and leadership have been recognized by various market research firms, including Forrester and Gartner. Are you a Machine Learning Engineer with expertise in Google Cloud Platform (GCP) and Vertex AI? We are looking for two talented professionals to join our team in a fully remote, onshore capacity. If you thrive in building and deploying scalable AI solutions, this role is for you! What You'll Do: Collaborate with cross-functional teams to design and deploy ML models. Develop reusable, scalable code for AI/ML applications....",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "AI GTM Analyst",
    "company": "Karbon",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4434e4117c77b9c6",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Sr. Data Analyst",
    "company": "Group O",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=61bf97539391f49b",
    "salary": "$70,000 - $90,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\nFlexible spending account\nLife insurance\nShow more\n&nbsp;",
    "qualifications": "Education/Certifications:; Bachelor’s degree in Statistics, Mathematics, Computer Science, Economics, or a related field.; Experience:; Proven experience as a Data Analyst or in a similar role.; Expert knowledge of complex databases: i.e., Azure Synapse and Snowflake accessing customers, products, orders, etc.; Expert knowledge of Excel Graphs, Charts, Pivot Tables, Power Point, etc.; Ability to write SQL queries in a large database environment. Must be a strong SQL Coder with Data Mining Skills (Understands complex coding processes, i.e., Joins, Aggregating Data, Building Temp Tables, Formatting Data, and Import & Export Processes).; Proficiency with ETL (Extract, Transfer & Load) processing.; Strong knowledge of data visualization tools (e.g., Tableau, Power BI).; Excellent analytical and critical thinking skills.; Ability to interpret and present complex data in a clear and concise manner.; Strong mindfulness and accuracy.; Effective communication and collaboration skills.; Ability to work independently and manage multiple tasks simultaneously.; Exceptional problem-solving skills, critical thinking, and a strong understanding of how to leverage AI tools like Copilot and ChatGPT to enhance productivity and drive innovation.; With a background in Statistics, Mathematics, Computer Science, or Economics, they stay updated with industry trends and demonstrate high ethical standards in handling data.; They are initiative-taking, adaptable, and capable of aligning data insights with business goals to drive informed decision-making.",
    "description": "Description The Sr. Data Analyst will be responsible for collecting, processing, and analyzing large sets of data to provide actionable insights that drive business decisions and strategies. This role requires an initiative-taking individual who can effectively communicate complex data findings to non-technical stakeholders. The ideal candidate for the Senior Data Analyst position is a meticulous and analytical professional proficient in SQL, Python, R, and data visualization tools like Tableau or Power BI. They possess strong critical thinking skills, excellent communication abilities, and can effectively collaborate with cross-functional teams. Location is Dallas, TX. Key Responsibilities Essential Functions:...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. KEY EXPECTATIONS Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions. Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies. Assess the effectiveness and accuracy of new data sources and data gathering techniques....",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0f1e2d3c4b5a6978",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Science Engineer",
    "company": "Goodnight Midstream",
    "jobLocation": "Hybrid work in Dallas, TX 75206",
    "jobUrl": "https://www.indeed.com/viewjob?jk=a9de40a688b5e9f7",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Manage data science projects from conception to completion, ensuring timely and successful delivery using professional project management tools.; Train end users on optimizing their use of the Data Science data platform.; Utilize a variety of AI tools to automate processes, enhance data analysis and improve overall operational intelligence.; Manage and maintain the company’s schema and data map; Education, Experience, and Technical Skills:",
    "description": "We're seeking an outgoing and collaborative Data Science Engineer to join our team. You'll play a key role in building and integrating data tools and solutions that will directly impact our business operations. Goodnight Midstream is predominantly a MS Power Platform, Palantir Foundry and Ignition/SCADA shop. This is an exempt-level position based out of our Dallas office, working a hybrid schedule. Applicants must be currently authorized to work in the United States on a full-time basis- Goodnight Midstream is not able to sponsor applicants for work visa. This position requires someone who's not only technically skilled but also a great communicator, capable of working effectively across multiple teams to understand their needs and deliver innovative solutions. You'll be instrumental in developing and maintaining our data infrastructure, with a particular focus on integrating with industrial SCADA systems and SQL databases to drive insights and improve efficiency. Responsibilities: Serve as an engineering resource for the development of Data Science projects....",
    "preferences": "Experience and proficiency with the following technologies is required:; Python; Microsoft Power Platform; MS SQL Server; MS Excel; Proficiency in programmatically interacting with APIs for data exchange and system integration.; Palantir Foundry, and specifically Quiver; Splunk; AI Tools; You should be able to demonstrate your skills without references.; The candidate should be highly skilled in the following areas: problem solving, prioritization, attention to detail, verbal and written communication. This position requires a self-starter/self-learner that demonstrates clear accountability and can adapt easily whether working independently or with a team. The candidate must have a strong sense of urgency and sound judgment. This candidate must be able to work independently, as well as in a group setting. Ability to plan out, manage, document and delegate multiple concurrent projects.",
    "mission_statement": "Not specified"
  }
]