[
  {
    "jobTitle": "Data Scientist",
    "company": "Cyber Infotech",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fc93d4af354c1d0f",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Build, implement and maintain predictive models through their full lifecycle. Identify patterns & trends in data, and provides insights to enhance business decision making. Identify challenges and opportunities from client strategy discussions and taking ownership of solution. Set up and monitor monthly model recalibration process. Generate complex ad-hoc analyses combining disparate concepts or creating new approaches....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Data Xpander",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=cdaa9e9635b3200e",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Email at hr@dataxpander.com They need to have statistical, mathematical, predictive modelling as well as business strategy skills to build the algorithms necessary to ask the right questions and find the right answers. They also need to be able to communicate their findings, orally and visually. They need to understand how the products are developed and even more important, as big data touches the privacy of consumers, they need to have a set of ethical responsibilities.",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Data Xpander",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fedcba9876543210",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "GenAI Data Scientist",
    "company": "Qode",
    "jobLocation": "Dallas, TX 75201",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b9871fd999f920b1",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Strong knowledge of SQL for querying and data manipulation.; Solid understanding of statistics and data analysis techniques.; Ability to work with large datasets and troubleshoot data quality issues.; Education & Experience: · Bachelor’s degree or Master’s Degree in Computer Science, Data Science, or related field.· 0–5 years of experience (academic projects or internships in AI/ML are a plus).",
    "description": "Job Title: GenAI Data Scientist Location: Dallas, TX or New Jersey or Tampa, FLJob Summary: We are looking for a Data Scientist with a passion for Generative AI to support AI/ML model development and data-driven innovation. The role focuses on applying Python and SQL skills to prepare data, build prototypes, and contribute to AI-powered solutions.Must-Have Skills: • Proficiency in Python (Pandas, NumPy, Scikit-learn, etc.). Strong knowledge of SQL for querying and data manipulation. Solid understanding of statistics and data analysis techniques. Ability to work with large datasets and troubleshoot data quality issues. Education & Experience: · Bachelor’s degree or Master’s Degree in Computer Science, Data Science, or related field.· 0–5 years of experience (academic projects or internships in AI/ML are a plus).",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "LTIMindtree",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b5b7bfd8c050ec3f",
    "salary": "$79,851 - $107,720 a year",
    "benefits": "Benefits\nPulled from the full job description\nPaid parental leave\nParental leave\nHealth insurance\n401(k) matching\nVision insurance\nDental insurance\nLife insurance\nShow more\n&nbsp;",
    "qualifications": "Not specified",
    "description": "Role description Job Title: AI/ML Consultant Work Location: Irving, TX Job Description:...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Intone Networks",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=3d7ca18a42c5d14c",
    "salary": "Contract",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Data Scientist Required Skills Qualifications: • Bachelor's or Master's degree in Data Science, Computer Science, Statistics, Mathematics, or a related quantitative field. • Proven experience as a Data Scientist or Data Analyst with a strong focus on Power BI development. • Expert-level proficiency in Microsoft Power BI, including dashboard creation, data modeling, DAX, and Power Query. • Strong understanding of data warehousing concepts and relational databases. • Proficiency in SQL for data extraction and manipulation. • Experience with other data analysis tools and programming languages (e.g., Python, R) is a plus. • Excellent analytical and problem-solving skills with the ability to interpret complex data sets. • Strong communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams.",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Science Engineer",
    "company": "Goodnight Midstream",
    "jobLocation": "Hybrid work in Dallas, TX 75206",
    "jobUrl": "https://www.indeed.com/viewjob?jk=a9de40a688b5e9f7",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Manage data science projects from conception to completion, ensuring timely and successful delivery using professional project management tools.; Train end users on optimizing their use of the Data Science data platform.; Utilize a variety of AI tools to automate processes, enhance data analysis and improve overall operational intelligence.; Manage and maintain the company’s schema and data map; Education, Experience, and Technical Skills:",
    "description": "We're seeking an outgoing and collaborative Data Science Engineer to join our team. You'll play a key role in building and integrating data tools and solutions that will directly impact our business operations. Goodnight Midstream is predominantly a MS Power Platform, Palantir Foundry and Ignition/SCADA shop. This is an exempt-level position based out of our Dallas office, working a hybrid schedule. Applicants must be currently authorized to work in the United States on a full-time basis- Goodnight Midstream is not able to sponsor applicants for work visa. This position requires someone who's not only technically skilled but also a great communicator, capable of working effectively across multiple teams to understand their needs and deliver innovative solutions. You'll be instrumental in developing and maintaining our data infrastructure, with a particular focus on integrating with industrial SCADA systems and SQL databases to drive insights and improve efficiency. Responsibilities: Serve as an engineering resource for the development of Data Science projects....",
    "preferences": "Experience and proficiency with the following technologies is required:; Python; Microsoft Power Platform; MS SQL Server; MS Excel; Proficiency in programmatically interacting with APIs for data exchange and system integration.; Palantir Foundry, and specifically Quiver; Splunk; AI Tools; You should be able to demonstrate your skills without references.; The candidate should be highly skilled in the following areas: problem solving, prioritization, attention to detail, verbal and written communication. This position requires a self-starter/self-learner that demonstrates clear accountability and can adapt easily whether working independently or with a team. The candidate must have a strong sense of urgency and sound judgment. This candidate must be able to work independently, as well as in a group setting. Ability to plan out, manage, document and delegate multiple concurrent projects."
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Must Haves:; Strong quantitative skills",
    "description": "Job Description Job Description: Important Note: Candidates should have the following experience POSITION SUMMARY – Reason for contingent headcount?...",
    "preferences": "Additional Information; All your information will be kept confidential according to EEO guidelines."
  },
  {
    "jobTitle": "Principal, Data Scientist",
    "company": "Cotality",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=7fb5abad68b0ce9a",
    "salary": "$112,700 - $155,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nReferral program\nTuition reimbursement\nPaid parental leave\nParental leave\nHealth insurance\n401(k) matching\nPaid time off\nShow more\n&nbsp;",
    "qualifications": "Job Duties; Create data derivation and linkage through algorithm and/or data rules.; Create and select predictive features from raw data.; Create model reports for stakeholder review and model documentation.; Perform pattern recognition model creation and training using various types of algorithms and machine learning modeling techniques for unknown or less well-defined – an unknown problem, solve new problems (e.g., clustering, logistic regression, deep learning, support vector machines, boosting trees, supervised and unsupervised models).; Develop analytics using Python, PySpark and other big data tools such as AutoML, BigQuery(BQ), BQML, DataPrep and Jupyter Notebook.; Develop analytics solutions using traditional database technology such as SQL and big data technology such as Hadoop, MongoDB, Cassandra, Redis, PostgreSQL and Neo4j, NoSQL databases.; Perform complex data analysis on large volumes of property and consumer data and present model performance to stakeholders.; Provide data science and analytic support for the Enterprise Data Solutions Group (EDSG) and interact with other EDSG teams as well as other business units.; QA and analyze large amounts of data to create appropriate data sets for model building.; Prepare and maintain programs and documentation for analytic models.; Conduct defined quantitative and qualitative research projects independently and communicates research results to internal and external stakeholders.; Act as a consultant to EDSG’s data management and data technology teams.; Lead and provide technical leadership on data science project with other data scientists, data engineers, and data analysts.; Master’s or higher in artificial intelligence, data science, computer science, math, statistics or engineering field, or equivalent work experience.; Ability to thrive in a team environment and adapt to quickly changing priorities.; 10+ years of directly related experience.; Strong problem solving and analytical ability.; Strong communication skills.; Ability to quickly and efficiently adapt to new concepts.; Demonstrated knowledge of statistical techniques.; Data mining/data analysis experience.; Strong working knowledge in multiple analytic development tools, statistical tools, programming languages, and big data tools.; Working knowledge in cloud platform (e.g. AWS, GCP), cloud-based sandbox environment and analytics sandbox and libraries.; Ability to work collaborative with cross-function teams and business units.; Demonstrated general business acumen; experience working in a real estate and mortgage related data industry a plus.; Ability to lead small team in technical projects.; Patents and publications in data science field a plus; Annual Pay Range:; 112,700 - 155,000 USD; Application Window:; This opportunity is expected to remain posted through the date identified below, subject to business needs.; Thrive with Cotality",
    "description": "At Cotality, we are driven by a single mission—to make the property industry faster, smarter, and more people-centric. Cotality is the trusted source for property intelligence, with unmatched precision, depth, breadth, and insights across the entire ecosystem. Our talented team of 5,000 employees globally uses our network, scale, connectivity and technology to drive the largest asset class in the world. Join us as we work toward our vision of fueling a thriving global property ecosystem and a more resilient society. Cotality is committed to cultivating a diverse and inclusive work culture that inspires innovation and bold thinking; it's a place where you can collaborate, feel valued, develop skills and directly impact the real estate economy. We know our people are our greatest asset. At Cotality, you can be yourself, lift people up and make an impact. By putting clients first and continuously innovating, we're working together to set the pace for unlocking new possibilities that better serve the property industry. Job Description: Design, develop, and deliver solutions that will enhance and add value to new and existing data assets for broad industry application and aligned with business and market requirements. Develop algorithmic and rule-based models and analytic capabilities based on rules engine, machine learning, mathematical modeling, pattern recognition, and data mining techniques. Performs data analysis, feature engineering and model development using a variety of analytic techniques, tools, and programming languages to provide business insights and analytic products. Job Duties...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist, Principal",
    "company": "o9 Solutions",
    "jobLocation": "Dallas, TX 75234",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4f4c6a5b9f0c0544",
    "salary": "$158,141 - $217,444 a year - Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Transforming the Future of Enterprise Planning At o9, our mission is to be the Most Value-Creating Platform for enterprises by transforming decision-making through our AI-first approach. By integrating siloed planning capabilities and capturing millions—even billions—in value leakage, we help businesses plan smarter and faster. This not only enhances operational efficiency but also reduces waste, leading to better outcomes for both businesses and the planet. Global leaders like Google, PepsiCo, Walmart, T-Mobile, AB InBev, and Starbucks trust o9 to optimize their supply chains. Principal Data Science At o9, we invest in people. We seek talented, driven individuals to power our transformative approach. You’ll thrive in a dynamic, supportive environment, growing while making a real impact....",
    "preferences": "Skills:; Experience in hiring, mentoring and leading data scientists; Strong programming skills and experience in using Python and/or R for Data Science; Strong analytical techniques, data mining knowledge and proficiency in handling and processing large amounts of data is needed; Deep knowledge of statistical and machine learning algorithms; Experience in applied analytical methods in the field of supply chain and planning, like demand planning, supply planning, market intelligence, optimal assortments/pricing/inventory etc.; Strong presentation and communications skills with ability to communicate complex analytical or technical concepts to audiences with limited analytical or technical background; Experience with SQL, databases and big data technologies (Hadoop, hive, spark) is preferable; Experience with Deep Learning frameworks such as Keras, Tensorflow or PyTorch is preferable."
  },
  {
    "jobTitle": "Data Scientist, Lead",
    "company": "o9 Solutions",
    "jobLocation": "Dallas, TX 75234",
    "jobUrl": "https://www.indeed.com/viewjob?jk=22b3cf3d942bae5c",
    "salary": "$133,000 - $175,000 a year - Full-time",
    "benefits": "Not specified",
    "qualifications": "Strong presentation and communications skills with ability to communicate complex analytical or technical concepts to audiences with limited analytical or technical background; Experience in time series forecasting in scale using heuristic based hierarchical best-fit models using algorithms like exponential smoothing, ARIMA, prophet and custom parameter tuning; Education: Master’s in Computer Science, Mathematics, Statistics, Economics, Engineering, or related field; Skills: R, Python, Pyspark, Machine Learning, SQL, building models in platforms like Power BI or Tableau; Characteristics: You thrive in a fast paced, challenging environment, where this is much white space and problem solving is at the heart of what drives your analysis; We really value team spirit: Transparency and frequent communication is key. At o9, this is not limited by hierarchy, distance, or function",
    "description": "Transforming the Future of Enterprise Planning At o9, our mission is to be the Most Value-Creating Platform for enterprises by transforming decision-making through our AI-first approach. By integrating siloed planning capabilities and capturing millions—even billions—in value leakage, we help businesses plan smarter and faster. This not only enhances operational efficiency but also reduces waste, leading to better outcomes for both businesses and the planet. Global leaders like Google, PepsiCo, Walmart, T-Mobile, AB InBev, and Starbucks trust o9 to optimize their supply chains. At o9, we invest in people. We seek talented, driven individuals to power our transformative approach. You’ll thrive in a dynamic, supportive environment, growing while making a real impact. About the role:...",
    "preferences": "Exposure to distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, or related Big Data technologies; Experience with Deep Learning frameworks such as Keras, Tensorflow or PyTorch is preferable; Experience in implementing planning applications will be a plus"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "AdroitCo",
    "jobLocation": "Frisco, TX 75034",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0900acea28b992d3",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Date Posted: November 21, 2023 Location: Adroitco HQ – 2801 Network Blvd., Suite 215, Frisco, TX 75034 Engagement Type:...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Cyborgwave",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=6f19577a289a0792",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Stay updated with the latest advancements in data science, machine learning, and big data technologies, applying new methodologies to enhance analysis.; Communicate findings and insights effectively to non-technical stakeholders through reports, presentations, and data visualizations.; Conduct exploratory data analysis to identify patterns, correlations, and anomalies in data, driving data-driven decision-making within the organization.; Apply data mining techniques to discover hidden patterns and relationships in data, uncovering valuable insights for business improvement.; Optimize model performance through iterative experimentation, feature engineering, and hyperparameter tuning, ensuring robustness and scalability.; Collaborate with IT teams to deploy and integrate machine learning models into production systems, monitoring performance and making necessary improvements.; Send your application at hr@cyborgwave.com",
    "description": "Posted: 3 days ago Description: We are hiring a data scientist to analyze complex datasets, develop machine learning models, and derive actionable insights. The ideal candidate should have expertise in statistical analysis, programming languages like R or Python, and experience with machine learning frameworks such as TensorFlow or PyTorch. Analyze large datasets to extract valuable insights and trends, using statistical techniques, machine learning algorithms, and data visualization tools. Develop predictive models and algorithms to solve complex business problems and optimize decision-making processes. Design and implement data pipelines for data acquisition, preprocessing, transformation, and storage, ensuring data quality and integrity....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "SelectMinds",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4a0298aaaa5bdf3e",
    "salary": "Contract",
    "benefits": "Not specified",
    "qualifications": "Minimum 5+ years of professional experience in Data Scientist.",
    "description": "Job Description: We are seeking a data scientist to join our business intelligence team to help us make better business decisions based on our data. The ideal candidate will have a working knowledge of statistics, mathematics, and data science programming languages (e.g., SQL, R, Python). Your primary responsibilities will be performing statistical analyses, running custom SQL queries, and identifying patterns and trends that can improve our products’ and services’ efficiency and usability. You will also be expected to maintain and improve our data infrastructure and tools. Responsibilities: Formulates and leads guided, multifaceted analytic studies against large volumes of data. Interprets and analyzes data using exploratory mathematic and statistical techniques based on the scientific method....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Software Bloc",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98eb1ba8f067f30e",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Work on improvements to methods and algorithms, developing innovative and effective approaches to solve businesses’ analytical problems and communicate these results and methodologies to our teams; Support recommendations of ongoing improvements that lead to findings, including new information, in collaboration with our Lead Data Scientist; Bachelor’s Degree in Mathematics, Statistics, Computer Science or related field",
    "description": "Software Bloc LLC, Plano, TX Technologies –Proficient in Python and R with experience in SQL, GitHub (not a deal breaker), and AWS/Azure and cloud storage related experience. Full Time JOB DESCRIPTION Your role will work to inform the business on strategic recommendations on data collection, integration, and retention requirements incorporating business needs and knowledge of best practices...",
    "preferences": "Skills to communicate well in a global environment"
  },
  {
    "jobTitle": "Senior Data Analyst",
    "company": "Cetera Financial Group",
    "jobLocation": "Hybrid work in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fb6a6ac6ebf53013",
    "salary": "$110,000 - $170,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nPet insurance\nPaid parental leave\nParental leave\nHealth insurance\nPaid time off\nVision insurance\nDental insurance\nShow more\n&nbsp;",
    "qualifications": "This position will have the flexibility to work a hybrid work schedule and you must be located near one our offices: Dallas TX, San Diego, CA, El Segundo, CA Shamburg IL, , Dubuque, IA and ST. Cloud, MN.; What you will do:; Collaborate with the key stakeholders to develop the BI (Business Intelligence) processes, strategy, and analytics roadmap for Cetera Organization.; Provides hands-on support to provision data from a variety of internal/external sources.; Contribute and engage business partners in Master Data Management and Data Governance program.; Outline specific project plans and milestones for BI & Analytics initiatives.; Work with technical and business teams to define appropriate technical solutions.; What you will have:; 7+ years of experience in Business Intelligence, Analytics, Data Visualization, Data Warehousing.; Ability to build and run complex SQL queries.; Experience in data quality and data governance.; Excellent analytical thinking, problem solving, organizational and time management skills.; Strong initiative, proactive and ability to meet deadlines.; Ability to be flexible and to handle multiple projects in an organized and timely manner.; Ability to innovate and to effectively deal with rapid change in a positive manner.; Compensation:",
    "description": "We are at the forefront of transforming the future of technology in the financial industry, and we seek curious, practical individuals to help us pave the way. Our team is not intimidated by taking calculated risks, as they relish a good challenge and are eager to engage in problem-solving. As a member of our team, you will work alongside like-minded experts in a culture that is deeply rooted in innovation and progression. Join us to be part of a transformative journey that can shape the industry's future. The Senior Data Analyst who will be an integral member of the Enterprise Data and Business Intelligence group in the Cetera IT organization. The group is chartered with defining and executing an enterprise data and business intelligence strategy. This includes BI solutions & Data Warehouse implementation, data access and dashboard creation in a partnership with business and IT stakeholders. In this hands-on role you will help us on our journey to become a more data driven company. Grounded in business, you are also fluent in technology, able to assess current technical environments and develop technology requirements and conceptual solutions to meet business objectives. You are a confident professional with broad skills in analyzing and solving complex business problems, writing and presenting, facilitating and influencing. Candidate is comfortable working with all levels of the organization, from the executive suite to the front line, and is equally comfortable working independently. This position will have the flexibility to work a hybrid work schedule and you must be located near one our offices: Dallas TX, San Diego, CA, El Segundo, CA Shamburg IL, , Dubuque, IA and ST. Cloud, MN. What you will do:...",
    "preferences": "Please review our Workforce Privacy Policy for further details on what information we collect and the purposes for collection."
  }
]