[
  {
    "jobTitle": "Data Scientist",
    "company": "Cyber Infotech",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fc93d4af354c1d0f",
    "qualifications": "",
    "salary": "",
    "preferences": "",
    "mission_statement": "",
    "description": "Build, implement and maintain predictive models through their full lifecycle.\nIdentify patterns & trends in data, and provides insights to enhance business decision making.\nIdentify challenges and opportunities from client strategy discussions and taking ownership of solution.\nSet up and monitor monthly model recalibration process.\nGenerate complex ad-hoc analyses combining disparate concepts or creating new approaches.\nDesign and create new analytic procedures & automation.\n\nPlease forward your resume to contact@cyberinfotek.com",
    "benefits": ""
  },
  {
    "jobTitle": "GenAI Data Scientist",
    "company": "Qode",
    "jobLocation": "Dallas, TX 75201",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b9871fd999f920b1",
    "qualifications": "",
    "salary": "Full-time",
    "preferences": "",
    "mission_statement": "",
    "description": "Job Title: GenAI Data Scientist Location: Dallas, TX or New Jersey or Tampa, FLJob Summary: We are looking for a Data Scientist with a passion for Generative AI to support AI/ML model development and data-driven innovation. The role focuses on applying Python and SQL skills to prepare data, build prototypes, and contribute to AI-powered solutions.Must-Have Skills: • Proficiency in Python (Pandas, NumPy, Scikit-learn, etc.).\n\nStrong knowledge of SQL for querying and data manipulation.\nSolid understanding of statistics and data analysis techniques.\nAbility to work with large datasets and troubleshoot data quality issues.\nEducation & Experience: · Bachelor’s degree or Master’s Degree in Computer Science, Data Science, or related field.· 0–5 years of experience (academic projects or internships in AI/ML are a plus).",
    "benefits": ""
  },
  {
    "jobTitle": "Data Scientist",
    "company": "LTIMindtree",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b5b7bfd8c050ec3f",
    "qualifications": "",
    "salary": "$79,851 - $107,720 a year",
    "preferences": "",
    "mission_statement": "",
    "description": "Role description\n\nJob Title: AI/ML Consultant\nWork Location:\nIrving, TX\n\nJob Description:\n\nHaving good experience in using ML models and debugging ML models and work on training of new LLM models for creating end to end automation frameworks.\nShould have experience on Python PySpark and Big data technologies.\nGood to have React JS knowledge for creating websites for using framework.\nGood communication skills.\nAbility to work independently and handle the issues with support teams.\nExposure in creating Agentic AI having hands on testing agentic AI is a plus.\nMandatory Certification in Microsoft Azure Data Scientist Associate or Databricks Certified Associated Developer for Apache Spark.\n\nSkills\n\n\nMandatory Skills : MLOPS,GenAI - LLMOps,Python - Data Science,Machine Learning - AIOPS,Deep Learning - AIOPS\n\n\nOther details\n\n\nBenefits/perks listed below may vary depending on the nature of your employment with LTIMindtree (“LTIM”):\n\nBenefits and Perks:\n\nComprehensive Medical Plan Covering Medical, Dental, Vision\nShort Term and Long-Term Disability Coverage\n401(k) Plan with Company match\nLife Insurance\nVacation Time, Sick Leave, Paid Holidays\nPaid Paternity and Maternity Leave\n\nThe range displayed on each job posting reflects the minimum and maximum salary target for the position across all US locations. Within the range, individual pay is determined by work location and job level and additional factors including job-related skills, experience, and relevant education or training. Depending on the position offered, other forms of compensation may be provided as part of overall compensation like an annual performance-based bonus, sales incentive pay and other forms of bonus or variable compensation.\n\nDisclaimer: The compensation and benefits information provided herein is accurate as of the date of this posting.\n\nLTIMindtree is an equal opportunity employer that is committed to diversity in the workplace. Our employment decisions are made without regard to race, color, creed, religion, sex (including pregnancy, childbirth or related medical conditions), gender identity or expression, national origin, ancestry, age, family-care status, veteran status, marital status, civil union status, domestic partnership status, military service, handicap or disability or history of handicap or disability, genetic information, atypical hereditary cellular or blood trait, union affiliation, affectional or sexual orientation or preference, or any other characteristic protected by applicable federal, state, or local law, except where such considerations are bona fide occupational qualifications permitted by law.\n\n\n\n\nBenefits\nCompensation range: $79,851.00 to $107,720.00 per year\nAbout LTIMindtree\nLTIMindtree is a global technology consulting and digital solutions company that enables enterprises across industries to reimagine business models, accelerate innovation, and maximize growth by harnessing digital technologies. As a digital transformation partner to more than 700 clients, LTIMindtree brings extensive domain and technology expertise to help drive superior competitive differentiation, customer experiences, and business outcomes in a converging world. Powered by 83,000+ talented and entrepreneurial professionals across more than 40 countries, LTIMindtree — a Larsen & Toubro Group company — solves the most complex business challenges and delivers transformation at scale. For more information, please visit https://www.ltimindtree.com/.",
    "benefits": "Benefits\nPulled from the full job description\nPaid parental leave\nParental leave\nHealth insurance\n401(k) matching\nVision insurance\nDental insurance\nLife insurance\nShow more\n&nbsp;"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Beckett Collectibles",
    "jobLocation": "Remote in Plano, TX 75074",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fb3ee106f632130d",
    "qualifications": "",
    "salary": "",
    "preferences": "",
    "mission_statement": "",
    "description": "Location: Remote-US (Preferably Dallas/Fort Worth, Texas)\nOur portfolio at Collectivus Holdings, LLC includes Beckett, Dragon Shield, Southern Hobby, and Merchant Guild—four brands with decades of expertise and dedication to elevating the collecting experience for enthusiasts and businesses alike.\nOur mission is to connect the world of collecting and gaming through brands that deliver quality, integrity, and reliability. Together, Beckett, Dragon Shield, Southern Hobby, and Merchant Guild work to enhance the hobbies and passions that bring people together.\n\nArcane Tinmen – Beckett Collectibles – Southern Hobby Distribution\n\nNashville – Plano – Aarhus – Lisbon – Worldwide\n\nCollectivus is seeking a highly skilled and analytical Data Scientist to join our team. The Data Scientist will play a crucial role in leveraging data to optimize our grading processes, enhance operational efficiency, and provide valuable insights into market trends and customer behavior. This position requires strong analytical skills, proficiency in data science tools and techniques, and the ability to work collaboratively across various departments.\n\n\nKey Responsibilities\nData Analysis and Modeling:\nCollect, clean, and analyze large datasets related to card grading operations, market trends, and customer behavior.\nDevelop and implement predictive models and algorithms to improve grading accuracy and operational efficiency.\nApply machine learning techniques to identify patterns, trends, and anomalies in data.\nProcess Optimization:\nAnalyze grading processes and workflows to identify inefficiencies and opportunities for improvement.\nCollaborate with the grading team to design and implement data-driven process enhancements and standard operating procedures (SOPs).\nConduct regular audits to ensure adherence to established procedures and quality standards.\nMarket and Customer Insights:\nAnalyze market trends and customer behavior to provide actionable insights on demand for different types of cards and collectibles.\nDevelop data-driven strategies to enhance customer satisfaction and retention.\nPartner with the marketing team to create targeted campaigns and promotions.\nData Visualization and Reporting:\nCreate and maintain dashboards and reports to monitor key performance indicators (KPIs) and operational metrics.\nPresent findings and recommendations to stakeholders clearly and effectively.\nDevelop compelling data visualizations to communicate complex insights effectively.\nCollaboration and Support:\nWork closely with IT and cross-functional teams to ensure data systems and tools are maintained and optimized.\nProvide support in organizing and managing data related to inventory, grading operations, and customer interactions.\nAssist in the development and delivery of training programs for staff on data-related topics.\nQualifications\nBachelor’s or Master’s degree in Data Science, Statistics, Computer Science, or a related field.\nProven experience as a Data Scientist or in a similar role, ideally within a grading, quality assurance, or operations environment.\nStrong analytical skills with proficiency in data analysis tools and software (e.g., Python, R, SQL, Power BI, Tableau).\nHands-on experience with machine learning techniques and predictive modeling.\nExcellent problem-solving skills and keen attention to detail.\nStrong communication and interpersonal skills, with the ability to collaborate effectively in a team environment.\nFamiliarity with trading cards, sports cards, or collectibles is a plus.\nAbility to manage multiple tasks and projects simultaneously in a fast-paced setting.\n\n\n\n#LI-Remote",
    "benefits": ""
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Toyota",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=162807d1f8394621",
    "qualifications": "",
    "salary": "$70 - $81 an hour",
    "preferences": "",
    "mission_statement": "",
    "description": "Who we are\nCollaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to Dream. Do. Grow. with us.\n\n\nWhat we’re looking for\nSkilled in forecasting and leading data science projects to leverage data to make better business decisions by delivering customer-centric insights. You will lead AI/ML efforts using an analytical mindset with critical thinking data skills\n\n\n\nWhat you’ll be doing\nExpertise in Machine learning and Data Science\nExperience working with large datasets, finding insights, and telling stories using data.\nUnderstanding of advance ML topics viz. Deep learning (ENN, CNN, RNN, etc.), GAN, Transformers, NLP, LLM's is a plus.\nExperience with ELT, ETL processes using glue, glue brew transformations.\nExperience working with automotive data sets is preferred.\nDeep expertise in Data Science viz. data segmentation, churn analysis, repeat purchase, market basket, A/B testing, etc.\n\n\nQualifications/ What you bring (Must Haves) – Highlight Top 3-5 skills\nWork on ad-hoc data science projects\nStrong technical skills in SQL, Python, R , or other programming languages commonly used in data analysis.\nWorking knowledge of CI/CD and MLOps\nGood knowledge in working with distributed datastores (e.g., SQL, NoSQL ), and Big Data and Cloud technologies like GCP BQ Firebase snowflake redshift\nSuccessful completion of one or more assessments in Python, Spark, Scala, or R, Using open source frameworks (for example, scikit learn, TensorFlow, torch)\n\n\nAdded bonus if you have (Preferred):\nUnderstanding of model management framework and at least 3 models as in Claude, LLAMA, Haiku, Gemma\n\n\n\nQUALIFICATION/LICENSURE\nWork Authorization : Green Card, US Citizen\nPreferred years of experience : 0 years\nTravel required : No travel required\nShift timings : 9 AM to 5 PM",
    "benefits": ""
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "qualifications": "",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "preferences": "",
    "mission_statement": "",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.\n\nTurnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.\n\nTurnitin, LLC is an equal opportunity employer- vets/disabled.\n\n\nJob Description\n\n\nMachine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products.\n\nWe are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.\n\nResponsibilities and Requirements:\n\nWe expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).\n\nDay-to-day, your responsibilities are to:\n\nWork with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.\nWork with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.\nAnswer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.\nDevelop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.\nUtilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.\nStay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.\nOptimize models for scaled production usage.\nCommunicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.\nWrite clean, efficient, and modular code, with automated tests and appropriate documentation.\nStay up to date with technology, make good technological choices, and be able to explain them to the organization.\n\nQualifications\n\n\nRequired Qualifications:\n\nExperience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.\nA strong understanding of the math and theory behind machine learning and deep learning.\nSoftware engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).\nMachine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).\nAn understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.\nMaster's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.\nExcellent communication and teamwork skills.\nFluent in written and spoken English.\n\nWould be a plus:\n\nFamiliarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.\nEssential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).\nFamiliarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.\nExperience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).\nShowcase previous work (e.g. via a website, presentation, open source code).\n\nAdditional Information\n\n\nThe expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.\n\nAs a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.\n\nTotal Rewards @ Turnitin\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.\n\nOur Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.\n\nOur Values underpin everything we do.\n\nCustomer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.\nPassion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.\nIntegrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.\nAction & Ownership - We have a bias toward action and empower teammates to make decisions.\nOne Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.\nGlobal Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.\n\nGlobal Benefits\n\nRemote First Culture\nHealth Care Coverage*\nEducation Reimbursement*\nCompetitive Paid Time Off\n4 Self-Care Days per year\nNational Holidays*\n2 Founder Days + Juneteenth Observed\nPaid Volunteer Time*\nCharitable contribution match*\nMonthly Wellness or Home Office Reimbursement*\nAccess to Modern Health (mental health platform)\nParental Leave*\nRetirement Plan with match/contribution*\nvaries by country\n\nSeeing Beyond the Job Ad\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!\n\nTurnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist - Applied Research (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fa7309553094efc6",
    "qualifications": "",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "preferences": "",
    "mission_statement": "",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.\n\nTurnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.\n\nTurnitin, LLC is an equal opportunity employer- vets/disabled.\n\n\nJob Description\n\n\nMachine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products.\n\nWe are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.\n\nResponsibilities and Requirements\n\nWe’re an applied science group leaning towards modern Deep Learning. We expect our Senior Machine Learning Scientists to have a well-balanced set of skills, both in the Science as well as Software Engineering aspects of (Deep) Machine Learning. You will focus on developing novel and deployable ML models and solutions where no ready-made solution may be available. Therefore you need to be conversant enough with the mathematics of machine learning and deep neural networks such that you can construct novel model architectures, loss functions, training methods, training loops etc. You are also expected to keep abreast of the latest research advancements in AI and Deep Learning across modalities and apply those to your work. While we leverage ready-made training platforms, we also write our own training loops. Additionally, the models need to be directly deployable in our products, therefore, production level coding and software engineering proficiency is required. You may train large models (up to 100s of billions of parameters) therefore, ability to train on multiple GPUs and nodes and knowledge of the latest model training and inferencing advancements is necessary. Next, the models must perform well in production not only in terms of accuracy but also compute-cost. Delivering such software requires a sufficiently deep Computer Science background. Dataset exploration, generation (synthetic), design, construction and analysis, are a routine part of the job and may occupy a significant fraction of your time. Also, datasets can be large (billions of samples), therefore the ability to write parallel and efficient pipelines is a necessary skill. You will also be involved in code & model maintenance, code hardening (preparing the model and code for production pipelines), developing and staging demos and presenting your work within the company as well as via publications in peer reviewed venues (preferably A/A+ rated).\n\nDay-to-day, your responsibilities are to:\n\nResearch and develop production grade Machine Learning models as described above. Optimize models for scaled production usage.\nWork with colleagues in the AI team, other Engineering teams, subject matter experts, Product Management, Marketing, Sales and Customer support to explore ongoing product issues, challenges and opportunities and then recommend innovative ML/AI based solutions.\nHelp out with ad-hoc one-off tasks as a team player within the AI team.\nWork with subject matter experts to curate and generate optimal datasets following responsible data collection and model maintenance practices. Explore and access SQL, no-SQL and web data and write efficient parallel pipelines. Review and design datasets to ensure data quality.\nInvestigate weaknesses of models in production and work on pragmatic solutions.\nUtilize, adopt, and fine-tune off the shelf models, including LLMs exposed via API (through prompt engineering and agents) and locally hosting LMs and other foundation models.\nStay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.\nWrite clean, efficient, and modular code with automated tests and appropriate documentation.\nStay up to date with technology and platforms, make good technological choices, and be able to explain them to the organization.\nWork with downstream teams to productionize your work and ensure that it makes into a product release.\nCommunicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.\nPresent and publish your work.\n\nQualifications\n\n\nRequired Qualifications:\n\nMaster's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field or outstanding previous achievements demonstrating excellence in Deep Machine Learning, Computer Science and Software Engineering.\nAt least 5 years of industry experience in Machine / Deep Learning (we use the python ecosystem for ML), Computer Science and Software Engineering.\nA strong understanding of the math and theory behind machine learning and deep learning is a prerequisite.\nAcademic publications in peer reviewed conferences or journals related to Machine Learning - preferably A/A+ rated such as NeurIPS, ICML, ICLR, AAAI, TMLR, JMLR, IJCAI, ICANN, KDD, ACL, EMNLP, NAACL, COLING, CVPR, ICCV, ECCV, IEEE etc.\nMachine / Deep Learning development skills, including popular platforms (we use AWS SageMaker, Hugging Face, Transformers, PyTorch, PyTorch Lightning, Ray, scikit-learn, Jupyter, Weights & Biases etc.).\nAn understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.\nExcellent communication and teamwork skills.\nFluent in written and spoken English.\n\nWould be a plus:\n\nWe’re an applied science group, therefore Software development proficiency is a requirement. Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.\nA Computer Science educational background is preferred as opposed to statistics or pure mathematics.\nFamiliarity in building front-ends (Gradio, Streamlit, Dash or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.\nExperience with advanced prompting / agentic-systems and fine-tuning or training an LLM, using industry accepted platforms.\nShowcase previous work (e.g. via a website, presentation, open source code).\nFamiliarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.\nEssential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).\n\nAdditional Information\n\n\nThe expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.\n\nAs a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.\n\nTotal Rewards @ Turnitin\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.\n\nOur Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.\n\nOur Values underpin everything we do.\n\nCustomer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.\nPassion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.\nIntegrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.\nAction & Ownership - We have a bias toward action and empower teammates to make decisions.\nOne Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.\nGlobal Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.\n\nGlobal Benefits\n\nRemote First Culture\nHealth Care Coverage*\nEducation Reimbursement*\nCompetitive Paid Time Off\n4 Self-Care Days per year\nNational Holidays*\n2 Founder Days + Juneteenth Observed\nPaid Volunteer Time*\nCharitable contribution match*\nMonthly Wellness or Home Office Reimbursement*\nAccess to Modern Health (mental health platform)\nParental Leave*\nRetirement Plan with match/contribution*\nvaries by country\n\nSeeing Beyond the Job Ad\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!\n\nTurnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789b20dee7d0ba72",
    "qualifications": "",
    "salary": "$56.02 - $67.47 an hour - Contract",
    "preferences": "",
    "mission_statement": "",
    "description": "POSITION SUMMARY\n\n· We’re looking for a Data Scientist who can be responsible for designing, building and maintaining document capture applications. The ideal candidate will have a solid background in software engineering with experience in building Machine Learning NLP Models and good familiarity with Gen AI Models.\n\nEDUCATION\n\n· Provide Bachelor's degree information\n\n· Education should always have at the least: Degree, Major, University Name, Date of Graduation\n\nPrimary Skill\n\n· Data Scientist\n\nSecondary Skill\n\n· Artificial Intelligence/Machine Learning\n\nREQUIREMENT SKILLS / EXPERIENCE\n\n· 7+ years of experience as Data Scientist or related roles\n\n· Bachelor’s degree in Computer Science, or a related technical field\n\n· Deep understanding and some exposure to new Gen AI Open-source Models\n\n· At least 5 years programming experience in software development and Agile process\n\n· At least 5 years Python (or equivalent) programming experience to work with ML/NLP models.\n\n· Experience in setting up supervised unsupervised learning ML/NLP models including data cleaning, data analytics, feature creation, model selection ensemble methods, performance metrics visualization\n\n· Experience in ML/NLP development pipelines of large data sets, both structured unstructured\n\n· At least 2 years’ experience in designing and developing enterprise-scale ML/NLP solutions in one or more of: Named Entity Recognition, Document Classification, Document Summarization, Topic Modelling, Dialog Systems, Sentiment Analysis, OCR text processing\n\n· Knowledge and hands-on experience working with OCR products\n\nDESIRED SKILLS / EXPERIENCE\n\n· Master’s degree in Computer Science/Data Science, or a related technical field\n\n· Collaborating with a diverse set of partners and stakeholders from various Line of Business.\n\n· Highly motivated, proactive and a self-starter; strong sense of ownership ability to create and execute plans without daily oversight\n\n· Critical thinker; ability to analyze problems and identify issues and provide solutions\n\n· Ability to navigate the enterprise data assets across multiple functions.\n\n· Highly organized. Effectively prioritizes and balances multiple efforts in a fast-paced environment\n\n· Excellent communication and Presentation skills\n\n· Analytical abilities great problem solving\n\n· Client focused\n\nJob Type: Contract\n\nPay: $56.02 - $67.47 per hour\n\nWork Location: In person",
    "benefits": ""
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "qualifications": "",
    "salary": "$65 - $75 an hour - Full-time",
    "preferences": "",
    "mission_statement": "",
    "description": "Benefits:\n\nHYBRID\nCompetitive salary\nOpportunity for advancement\nTraining & development\n\nJob Title: Data Scientist – Integrated Operations\nLocation: Dallas, TX (Hybrid Remote)\nIn-Person Interview\nMust be authorized to work in the U.S\n\nWork Arrangement\n\nHybrid work model: primarily remote within the Dallas–Fort Worth area.\nOccasional on-site presence required for meetings, training, or business needs.\nLimited business travel may be required.\n\nRoles & Responsibilities\n. 6+ years of experience in Machine Learning and Data Science.\n\nStrong understanding of Generative AI, Retrieval Augmented Generation, Agentic Workflow, Statistical methods, data structures, and algorithms.\nStrong programming skills in Python; experience with Machine Learning libraries and Generative AI frameworks (e.g., Pandas, NumPy, Matplotlib, Seaborn, TensorFlow, PyTorch, scikit-learn, LangChain) and LLMs.\nExperience developing and deploying AI solutions on cloud platforms (e.g., AWS, Azure, or GCP).\nExperience in building Asynchronous Python APIs.\nExperience with data visualization tools such as Matplotlib, Seaborn, or Tableau.\nFamiliarity with cloud platforms such as AWS, Azure, or Google Cloud for deploying AI solutions.\nProven experience in developing and deploying machine learning models in a production environment.\nExperience working with large datasets and performing data analysis\n\nRequired Qualifications\n\nEducation\n\nBachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.\n\nExperience\n\nAdvanced experience in data science, machine learning, AI, or optimization projects.\nProficiency in Python and SQL.\nStrong understanding of statistical methods, experimental design, and model validation.\nExperience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).\nFamiliarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).\n\nPreferred Experience\n\nExperience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).\nExposure to specialized analytics areas such as simulation, graph analytics, or video analytics.\n\nSkills & Abilities\n\nAbility to independently manage and deliver on complex projects.\nStrong problem-solving and critical thinking skills.\nEffective communication skills for both technical and executive audiences.\nAbility to adapt quickly to changing priorities and new technologies.\nStrong interpersonal and collaboration skills.\n\n.....",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;"
  },
  {
    "jobTitle": "Data Science Subject Matter Experts",
    "company": "Zion Zest LLC",
    "jobLocation": "Dallas, TX 75244",
    "jobUrl": "https://www.indeed.com/viewjob?jk=34f39dba2736a427",
    "qualifications": "",
    "salary": "$180,000 - $250,000 a year - Full-time, Contract",
    "preferences": "",
    "mission_statement": "",
    "description": "Overview\nWe are seeking a skilled and motivated Data Scientist to join our dynamic team. In this role, you will leverage your expertise in data analytics, machine learning, and statistical modeling to extract valuable insights from complex datasets. You will work collaboratively with cross-functional teams to drive data-driven decision-making and contribute to innovative projects that enhance our business strategies.\n\nResponsibilities\n\nSME Expertise: Seek out an SME with in-depth knowledge of data science concepts (e.g., machine learning, statistical modeling, programming languages like Python or R) and practical experience in applying these within a business context.\nPassion for Teaching: The SME should be passionate about teaching and able to simplify complex concepts for different learning levels within the organization.\nCustomized Content: Develop a customized curriculum that addresses identified skill gaps, and includes relevant tools and platforms used within your company.\nTo effectively train employees in data science, especially within a corporate context, consider using a data science subject matter expert (SME) to guide the training program.\nAnalyze large datasets to identify trends, patterns, and anomalies that can inform business decisions.\nDevelop and implement machine learning models and algorithms to solve complex problems.\nUtilize advanced analytics techniques including data mining and predictive modeling to enhance operational efficiency.\nCollaborate with stakeholders to understand their data needs and provide actionable insights.\nCreate visualizations and reports that effectively communicate findings to both technical and non-technical audiences.\nMaintain and optimize existing data pipelines and workflows using tools such as SQL, Hadoop, or SAS.\nStay current with industry trends in AI and machine learning frameworks to continuously improve methodologies.\n\nQualifications\n\nTrain junior Data Science Engineers and help them with programming.\nProficiency in programming languages such as C and VBA for data manipulation and analysis.\nStrong knowledge of SQL for database querying and management.\nExperience with linked data concepts and analytics tools.\nFamiliarity with machine learning frameworks (e.g., TensorFlow, PyTorch) is a plus.\nDemonstrated ability in data mining techniques for extracting insights from large datasets.\nExcellent problem-solving skills with a keen analytical mindset.\nStrong communication skills, both written and verbal, for effective collaboration across teams.\nA degree in Data Science, Computer Science, Statistics, or a related field is preferred.\n\nJoin us in harnessing the power of data to drive innovation and success!\n\nJob Types: Full-time, Contract\n\nPay: $180,000.00 - $250,000.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nWork Location: In person",
    "benefits": "Benefits\nPulled from the full job description\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\n&nbsp;"
  },
  {
    "jobTitle": "Data Engineer",
    "company": "Rapideagle",
    "jobLocation": "Plano, TX 75023",
    "jobUrl": "https://www.indeed.com/viewjob?jk=632b61b982c7cb54",
    "qualifications": "",
    "salary": "$57.52 - $69.27 an hour - Full-time, Contract",
    "preferences": "",
    "mission_statement": "",
    "description": "Job Overview\nWe are seeking a skilled and motivated Data Engineer to join our dynamic team. The ideal candidate will be responsible for designing, developing, and maintaining robust data pipelines and architectures that support our data-driven decision-making processes. This role requires a strong understanding of big data technologies and cloud-based solutions, particularly within the Azure ecosystem.\n\nDuties\n\nDevelop and maintain scalable data pipelines using Azure Data Lake and Hadoop to support large-scale data processing.\nCollaborate with data scientists and analysts to facilitate model training and ensure data availability for analysis.\nDesign and implement ETL processes using Informatica to integrate various data sources into a centralized data warehouse.\nMonitor and optimize database performance, ensuring high availability and reliability of server environments.\nParticipate in Agile development practices, contributing to sprint planning, reviews, and retrospectives.\nVaticinate potential issues in the data architecture and proactively implement solutions to mitigate risks.\nDocument data processes, architectures, and workflows for clarity and compliance.\n\nExperience\n\nProven experience working with big data technologies such as Hadoop and cloud services like Azure Data Lake.\nStrong understanding of data warehousing concepts and experience with ETL tools like Informatica.\nFamiliarity with Agile methodologies and practices in a collaborative team environment.\nExperience in model training processes is a plus, demonstrating the ability to work closely with machine learning teams.\nExcellent problem-solving skills with the ability to analyze complex datasets effectively.\n\nIf you are passionate about leveraging technology to drive business insights through effective data management, we encourage you to apply for this exciting opportunity as a Data Engineer.\n\nJob Types: Full-time, Contract\n\nPay: $57.52 - $69.27 per hour\n\nExpected hours: 40 per week\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\n\nWork Location: In person",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\nPaid time off\nDental insurance\n&nbsp;"
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "qualifications": "",
    "salary": "",
    "preferences": "",
    "mission_statement": "",
    "description": "Job Description\n\n\nJob Description:\n\nImportant Note: Candidates should have the following experience\n\nPOSITION SUMMARY –\n\nReason for contingent headcount?\n\nWorkload\n\nWhat is the project(s) name?\n\nWhat specific departments will they interact with?\n\nWhat phase is the project currently in?\n\nOngoing Support\n\nRequirements:\n\nMust Haves:\n\nStrong quantitative skills\n\nPreferred/ Nice-to-haves: (The below is not necessary for this position. These are the responsibilities of the new big data architect position we are hiring for)\n\n\nAdditional Information\n\n\nAll your information will be kept confidential according to EEO guidelines.",
    "benefits": ""
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "qualifications": "",
    "salary": "Full-time",
    "preferences": "",
    "mission_statement": "",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights.\n\n\n\n\n\n\n\nKEY EXPECTATIONS\n\n\n\n\nWork with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\nMine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.\nAssess the effectiveness and accuracy of new data sources and data gathering techniques.\nDevelop custom data models and algorithms to apply to data sets.\nUse predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.\nDevelop company A/B testing framework and test model quality.\nCoordinate with different functional teams to implement models and monitor outcomes.\nDevelop processes and tools to monitor and analyze model performance and data accuracy.\n\n\nDESIRED SKILLS AND EXPERIENCE\n\n\n\n\nStrong problem-solving skills with an emphasis on product development.\nExperience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\nExperience working with and creating data architectures.\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\nKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\nExcellent written and verbal communication skills for coordinating across teams.\nA drive to learn and master new technologies and techniques.\n5-7 years of experience manipulating data sets and building statistical models.\nMaster’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools:\n\n\nCoding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.\nKnowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.\nExperience querying databases and using statistical computer languages: R, Python, SLQ, etc.\nExperience using web services: Redshift, S3, Spark, DigitalOcean, etc.\nExperience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.\nExperience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.\nExperience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.\nExperience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.\n\n\nEmployer’s Rights:\n\n\nPeoplevisor, LLC. has the right to revise this job description at any time. This job description is not a contract for employment. This job description does not list all the duties of the job. You may be asked by your supervisors or managers to perform other duties. You will be evaluated in part based upon your performance of the tasks listed in this job description.\n\n\nEqual Opportunity Statement:\n\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or status as a Vietnam or disabled veteran.\n\n\nApplications for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Peoplevisor, LLC.",
    "benefits": ""
  },
  {
    "jobTitle": "Data Engineer (Hybrid)",
    "company": "Trace3",
    "jobLocation": "Hybrid work in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4ebc9228840270ab",
    "qualifications": "",
    "salary": "$65 - $70 an hour - Full-time, Contract",
    "preferences": "",
    "mission_statement": "",
    "description": "Who is Trace3?\n\nTrace3 is a leading Transformative IT Authority, providing unique technology solutions and consulting services to our clients. Equipped with elite engineering and dynamic innovation, we empower IT executives and their organizations to achieve competitive advantage through a process of Integrate, Automate, Innovate.\n\nOur culture at Trace3 embodies the spirit of a startup with the advantage of a scalable business. Employees can grow their career and have fun while doing it!\n\nTrace3 is headquartered in Irvine, California. We employ more than 1,200 people all over the United States. Our major field office locations include Denver, Indianapolis, Grand Rapids, Lexington, Los Angeles, Louisville, Texas, San Francisco.\n\nReady to discover the possibilities that live in technology?\n\n\n\n\nCome Join Us!\n\nStreet-Smart - Thriving in Dynamic Times\n\nWe are flexible and resilient in a fast-changing environment. We continuously innovate and drive constructive change while keeping a focus on the \"big picture.\" We exercise sound business judgment in making high-quality decisions in a timely and cost-effective manner. We are highly creative and can dig deep within ourselves to find positive solutions to different problems.\n\nJuice - The \"Stuff\" it takes to be a Needle Mover\n\nWe get things done and drive results. We lead without a title, empowering others through a can-do attitude. We look forward to the goal, mentally mapping out every checkpoint on the pathway to success, and visualizing what the final destination looks and feels like.\n\nTeamwork - Humble, Hungry and Smart\n\nWe are humble individuals who understand how our job impacts the company's mission. We treat others with respect, admit mistakes, give credit where it's due and demonstrate transparency. We \"bring the weather\" by exhibiting positive leadership and solution-focused thinking. We hug people in their trials, struggles, and failures – not just their success. We appreciate the individuality of the people around us.\n\n\nU.S. Citizenship is required for this position due to client-specific government/federal requirements. Candidates with dual citizenship are not eligible for this position.\n\nPosition Overview\n\nAs a Data Engineer, you will be responsible for the development, optimization, and management of data ingestion, transformation, and storage processes using modern frameworks. The successful candidate will implement infrastructure-as-code and automation solutions to streamline and build resiliency into data processing workflows. You will work closely with our data science and analytics teams to create and optimize data and machine learning models that support stakeholder needs. This is a 6 month contract with the hopes to convert to a full-time employee.\n\nThe selected candidate will need to be located within 30-50 minutes of one of the following locations due to a potential hybrid schedule:\n\nDallas, TX\nCentral Florida\nKing of Prussia, PA\nStratford, CT\nDenver, CO\nMarietta, GA\n\n*Please note, this is a contract position through Trace3*\n\nKey Responsibilities\n\nDesign, build, and maintain large-scale data systems, including data warehouses, data lakes, and data pipelines\nDevelop and implement data architectures that meet the needs of our business stakeholders\nCollaborate with data scientists and analysts to develop and deploy machine learning models and data products\nEnsure data quality, security, and compliance with standards\nDevelop and maintain technical documentation of data systems and architectures\nTroubleshoot and resolve data-related issues and optimize system performance\nDevelop and implement automated testing and deployment scripts to ensure smooth and efficient delivery of data solutions\nCollaborate with cross-functional teams to identify and prioritize data requirements and develop solutions to meet business needs\n\nRequired Qualifications\n\n*** US Citizenship is required for this role ***\nBachelor's degree in Computer Science, Information Technology, or related field (or equivalent combination of education and experience)\n7+ years of experience in data engineering, software development, or a related field\nStrong programming skills in languages such as Python and Terraform\nStrong understanding of data architecture, data modeling, and data warehousing concepts\nExperience with data pipeline tools such as Apache Spark, Apache Kafka, AWS Kinesis\nExperience with Artificial Intelligence and Machine Learning technologies\nStrong understanding of data security and compliance principles and practices\nExcellent problem-solving skills, with the ability to analyze complex data systems and identify areas for improvement\nStrong communication and collaboration skills, with the ability to work effectively with cross-functional teams\n\nDesired Skills:\n\nExperience with cloud-based data platforms such as AWS and Azure\nExperience with agile development methodologies and version control systems such as Git\nExperience with data visualization tools such as Tableau and Cognos Analytics\nFamiliarity with complex data regulatory requirements such as NIST 800-171 and SOX\nFamiliarity with OpenTelemetry standards\nOptimization for observability data and real time anomaly detections\n\nThe Perks\n\nComprehensive medical, dental and vision plans for you and your dependents\n401(k) Retirement Plan with Employer Match, 529 College Savings Plan, Health Savings Account, Life Insurance, and Long-Term Disability\nCompetitive Compensation\nTraining and development programs\nStocked kitchen with snacks and beverages\nCollaborative and cool culture\nWork-life balance and generous paid time off\n\n\n\nOur Commitment\n\nAt the core of Trace3's DNA is our people. We are a diverse group of talented individuals who understand the importance of teamwork and demonstrating leadership, character, and passion in all that we do.\n\nWe're committed to fostering an inclusive workplace where everyone feels respected, valued, and empowered to grow. We recognize that embracing diversity drives innovation, improves outcomes, fosters collaboration, boosts teammate satisfaction, and builds a more inclusive culture.\n\nAs an equal opportunity employer, Trace3 bases all employment decisions based on individual qualifications, merit, and business requirements. We do not engage in discrimination on the basis of race, color, religion, sex (including gender identity, sexual orientation, and pregnancy), national origin, age (40 or older), disability, genetic information, or any other characteristic protected by federal, state, or local law.\n\nAny demographic information provided is strictly voluntary, kept confidential in accordance with Equal Employment Opportunity (EEO) regulations, and will not be used in employment decisions, including hiring, promotions, or mentorship programs. We are committed to providing equal employment opportunities for all.\n\nIf you require a reasonable accommodation to complete the application process or participate in an interview, please email recruiting@trace3.com.\n\n\n\n\n***To all recruitment agencies: Trace3 does not accept unsolicited agency resumes/CVs. Please do not forward resumes/CVs to our careers email addresses, Trace3 employees or any other company location. Trace3 is not responsible for any fees related to unsolicited resumes/CVs.",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nHealth savings account\nDental insurance\nLife insurance\nShow more\n&nbsp;"
  },
  {
    "jobTitle": "Data Engineer (Hybrid)",
    "company": "Trace3",
    "jobLocation": "Hybrid work in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=890abcdef0123456",
    "qualifications": "",
    "salary": "",
    "preferences": "",
    "mission_statement": "",
    "description": "n/a",
    "benefits": ""
  },
  {
    "jobTitle": "Sr Data Scientist GenAI",
    "company": "Select Minds LLC",
    "jobLocation": "Dallas, TX 75235 \n(Dallas Love Field area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0adc95909d448a8e",
    "qualifications": "",
    "salary": "$150,000 - $210,000 a year - Full-time",
    "preferences": "",
    "mission_statement": "",
    "description": "Benefits:\n\nCompetitive salary\nFlexible schedule\nOpportunity for advancement\n\nSr Data Scientist (NLP / LLM / Generative AI)\nLocation: Dallas, TX\n\nRoles & Responsibilities :\n\nDesign, build, fine-tune, and deploy LLMs, transformer-based NLP models, and GenAI solutions for both batch and real-time/streaming contexts.\nOwn all major components of ML pipelines: data ingestion, cleaning, pre-processing (structured & unstructured), embedding, search & retrieval, prompt engineering, RAG (Retrieval-Augmented Generation).\nCollaborate closely with ML Engineers, MLOps, software engineering, product, compliance, legal etc., to move models from prototype to production—ensuring reliability, scalability, monitoring, and maintainability.\nDefine and implement evaluation frameworks: accuracy, bias, fairness, hallucination, consistency, latency; run UAT, stress-tests, drift detection.\nOptimize models and pipelines for performance, cost, and efficiency.\nEnsure best practices in model development: version control, repeatability, documentation, governance, and ethical AI use.\nMentor more junior data scientists; help build team skills in NLP, GenAI practices, prompt engineering, fine-tuning.\nIdentify new use cases; prototype innovations in GenAI/NLP; keep up with latest research and open source developments, decide what to adopt.\n\nMust-Have Qualifications:\n\n10+ years of experience in data science / ML, with substantial work in NLP, LLMs, or Generative AI.\nDeep hands-on experience in Python, using frameworks like PyTorch, TensorFlow, HuggingFace etc.\nProven track record building transformer/NLP / LLM models; experience with fine-tuning, prompt engineering.\nSolid experience with information retrieval / search: keyword + semantic search, embeddings, vector databases.\nExperience working in production / deploying models (batch and streaming), working with MLOps practices.\nStrong algorithmic / statistical / mathematical fundamentals. Ability to reason about model behaviour, bias, uncertainty.\nGood communicator: able to translate complex technical detail to business / non-technical stakeholders.\n\nNice to Have:\n\nMaster's in Computer Science, Computational Linguistics, Statistics, Machine Learning or related field.\nExperience with multimodal models (vision + text) or emerging LLMs and agent-based systems.\nExperience with open source LLMs & toolkits; familiarity with LangChain or similar frameworks.\nPrior experience in regulated environments (finance, risk, legal, compliance) with strong governance, privacy requirements.\n\n\n\nWork remote temporarily due to COVID-19.",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\nFlexible schedule\n&nbsp;"
  }
]