[
  {
    "jobTitle": "Data Scientist",
    "company": "Cyber Infotech",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fc93d4af354c1d0f",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Build, implement and maintain predictive models through their full lifecycle.\nIdentify patterns & trends in data, and provides insights to enhance business decision making.\nIdentify challenges and opportunities from client strategy discussions and taking ownership of solution.\nSet up and monitor monthly model recalibration process.\nGenerate complex ad-hoc analyses combining disparate concepts or creating new approaches.\nDesign and create new analytic procedures & automation.\n\nPlease forward your resume to contact@cyberinfotek.com",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Data Xpander",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=cdaa9e9635b3200e",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Email at hr@dataxpander.com\n\nThey need to have statistical, mathematical, predictive modelling as well as business strategy skills to build the algorithms necessary to ask the right questions and find the right answers. They also need to be able to communicate their findings, orally and visually. They need to understand how the products are developed and even more important, as big data touches the privacy of consumers, they need to have a set of ethical responsibilities.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Machine Learning Engineer I - Realm-X",
    "company": "AppFolio",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=dce6ca123694dc9f",
    "salary": "$114,400 - $143,000 a year - Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Hi, We’re AppFolio.\n\nWe’re innovators, changemakers, and collaborators. We’re more than just a software company — we’re building the cloud and AI-based Platform where the Real Estate industry comes to do business. We’re revolutionizing the way Property Managers do business, while improving how people live, and we want your ideas, your enthusiasm, and your passion to help us keep on innovating.\n\nWe love where we work, and you can, too.\n\n\nWho we are looking for:\n\nWe’re seeking a mid-level Full Stack Software Engineer II to join our AI Engineering Group (Realm-X) and help drive the evolution of our Workflows Platform. This platform delivers a robust framework for automating key business processes—such as leasing, maintenance, move-ins, and move-outs—while equipping teams with powerful tools to build Agentic Workflows that push automation even further, streamlining both operations and communications.\n\nWe work collaboratively to set the technical direction for our SaaS and AI products, developing easy-to-use solutions for our customers. Our engineers find deep satisfaction in building things that customers need. We focus on delivering value to customers and understand that this often means delivering code that isn't perfect but meets customer needs.\n\nThis is an ideal opportunity for someone who has a passion for building leading-edge software in the intersection of workflows, AI Agents, and automation. We foster an environment that empowers small teams to set the technical direction of our solutions collaboratively.\n\n\nResponsibilities:\n\nDevelop front-end and back-end scalable features for AppFolio’s robust and web-based workflow builder for Property Manager businesses.\n\nDevelop and improve AppFolio’s DSL (Domain-Specific Language), which enables our customers and internal teams to quickly create customizable business processes.\n\nFormulate, implement, and evaluate algorithms and database queries to support SaaS scalability and stability.\n\nImplement new features and optimize existing ones to drive maximum performance.\n\nUse test-driven development, code reviews, and continuous integration to deliver high-quality software and rapidly fix bugs as they come up.\n\nWork closely with, and incorporate feedback from other engineering team members, QA, product owners, and our APM customers.\n\nLeveraging agile practices, encourage collaboration, prioritization, and urgency to develop at a rapid pace\n\nResearch, share, and recommend new technologies and trends.\n\n\nYou know you’re the right fit if…\n\nYou’ve heard of Ruby and Rails and have experience working with a language like Ruby, Go, Python, and JavaScript.\n\nYou love learning about new technologies but understand the value of using something old if it still does everything you need it to do.\n\nYou care about the long-term maintainability of the codebase and will learn to advocate for refactoring and clean-ups where appropriate.\n\nYou care about work-life balance and want your company to care about it, too; you'll put in the extra hour when needed but won't let it become a habit.\n\n\nAdditional Skills and Knowledge:\n\nBachelor's, Master's, or Ph.D. in Computer Science or related technical discipline\n\nHands-on work experience developing web-based applications, preferably in a SaaS environment using cloud technologies like AWS.\n\nCreativity, the ability to solve complex problems without a roadmap\n\n\nNice to Have:\n\nKnowledge or experience with some areas of our tech, like Ruby on Rails, React, Go, Python, and AWS.\n\nWorkflow technologies knowledge or experience (Temporal)\n\nAI/ML knowledge or experience (evaluating and deploying models in production)\n\nAI Agents knowledge (LangChain, LangGraph, OpenAI API, LLMs, and prompting)\n\nExperience working across all levels of the development stack\n\nFamiliarity with Agile software development processes: Scrum or Kanban\n\nFamiliarity with Test-Driven-Development\n\n\nCompensation & Benefits\n\nThe base salary that we reasonably expect to pay for this role is 114,400.00 - 143,000.00 USD annually. The actual base salary for this role will be determined by a variety of factors, including but not limited to the candidate’s skills, education, experience, etc.\n\nPlease note that base pay is one important aspect of a compelling Total Rewards package. The base pay range indicated here does not include any additional benefits or bonuses that you may be eligible for based on your role and/or employment type.\n\nRegular full-time employees are eligible for benefits - see here.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "GenAI Data Scientist",
    "company": "Qode",
    "jobLocation": "Dallas, TX 75201",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b9871fd999f920b1",
    "salary": "Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Job Title: GenAI Data Scientist Location: Dallas, TX or New Jersey or Tampa, FLJob Summary: We are looking for a Data Scientist with a passion for Generative AI to support AI/ML model development and data-driven innovation. The role focuses on applying Python and SQL skills to prepare data, build prototypes, and contribute to AI-powered solutions.Must-Have Skills: • Proficiency in Python (Pandas, NumPy, Scikit-learn, etc.).\n\nStrong knowledge of SQL for querying and data manipulation.\nSolid understanding of statistics and data analysis techniques.\nAbility to work with large datasets and troubleshoot data quality issues.\nEducation & Experience: · Bachelor’s degree or Master’s Degree in Computer Science, Data Science, or related field.· 0–5 years of experience (academic projects or internships in AI/ML are a plus).",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "LTIMindtree",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b5b7bfd8c050ec3f",
    "salary": "$79,851 - $107,720 a year",
    "benefits": "Benefits\nPulled from the full job description\nPaid parental leave\nParental leave\nHealth insurance\n401(k) matching\nVision insurance\nDental insurance\nLife insurance\nShow more\n&nbsp;",
    "qualifications": "n/a",
    "description": "Role description\n\nJob Title: AI/ML Consultant\nWork Location:\nIrving, TX\n\nJob Description:\n\nHaving good experience in using ML models and debugging ML models and work on training of new LLM models for creating end to end automation frameworks.\nShould have experience on Python PySpark and Big data technologies.\nGood to have React JS knowledge for creating websites for using framework.\nGood communication skills.\nAbility to work independently and handle the issues with support teams.\nExposure in creating Agentic AI having hands on testing agentic AI is a plus.\nMandatory Certification in Microsoft Azure Data Scientist Associate or Databricks Certified Associated Developer for Apache Spark.\n\nSkills\n\n\nMandatory Skills : MLOPS,GenAI - LLMOps,Python - Data Science,Machine Learning - AIOPS,Deep Learning - AIOPS\n\n\nOther details\n\n\nBenefits/perks listed below may vary depending on the nature of your employment with LTIMindtree (“LTIM”):\n\nBenefits and Perks:\n\nComprehensive Medical Plan Covering Medical, Dental, Vision\nShort Term and Long-Term Disability Coverage\n401(k) Plan with Company match\nLife Insurance\nVacation Time, Sick Leave, Paid Holidays\nPaid Paternity and Maternity Leave\n\nThe range displayed on each job posting reflects the minimum and maximum salary target for the position across all US locations. Within the range, individual pay is determined by work location and job level and additional factors including job-related skills, experience, and relevant education or training. Depending on the position offered, other forms of compensation may be provided as part of overall compensation like an annual performance-based bonus, sales incentive pay and other forms of bonus or variable compensation.\n\nDisclaimer: The compensation and benefits information provided herein is accurate as of the date of this posting.\n\nLTIMindtree is an equal opportunity employer that is committed to diversity in the workplace. Our employment decisions are made without regard to race, color, creed, religion, sex (including pregnancy, childbirth or related medical conditions), gender identity or expression, national origin, ancestry, age, family-care status, veteran status, marital status, civil union status, domestic partnership status, military service, handicap or disability or history of handicap or disability, genetic information, atypical hereditary cellular or blood trait, union affiliation, affectional or sexual orientation or preference, or any other characteristic protected by applicable federal, state, or local law, except where such considerations are bona fide occupational qualifications permitted by law.\n\n\n\n\nBenefits\nCompensation range: $79,851.00 to $107,720.00 per year\nAbout LTIMindtree\nLTIMindtree is a global technology consulting and digital solutions company that enables enterprises across industries to reimagine business models, accelerate innovation, and maximize growth by harnessing digital technologies. As a digital transformation partner to more than 700 clients, LTIMindtree brings extensive domain and technology expertise to help drive superior competitive differentiation, customer experiences, and business outcomes in a converging world. Powered by 83,000+ talented and entrepreneurial professionals across more than 40 countries, LTIMindtree — a Larsen & Toubro Group company — solves the most complex business challenges and delivers transformation at scale. For more information, please visit https://www.ltimindtree.com/.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "n/a",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.\n\nTurnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.\n\nTurnitin, LLC is an equal opportunity employer- vets/disabled.\n\n\nJob Description\n\n\nMachine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products.\n\nWe are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.\n\nResponsibilities and Requirements:\n\nWe expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).\n\nDay-to-day, your responsibilities are to:\n\nWork with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.\nWork with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.\nAnswer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.\nDevelop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.\nUtilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.\nStay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.\nOptimize models for scaled production usage.\nCommunicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.\nWrite clean, efficient, and modular code, with automated tests and appropriate documentation.\nStay up to date with technology, make good technological choices, and be able to explain them to the organization.\n\nQualifications\n\n\nRequired Qualifications:\n\nExperience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.\nA strong understanding of the math and theory behind machine learning and deep learning.\nSoftware engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).\nMachine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).\nAn understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.\nMaster's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.\nExcellent communication and teamwork skills.\nFluent in written and spoken English.\n\nWould be a plus:\n\nFamiliarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.\nEssential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).\nFamiliarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.\nExperience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).\nShowcase previous work (e.g. via a website, presentation, open source code).\n\nAdditional Information\n\n\nThe expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.\n\nAs a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.\n\nTotal Rewards @ Turnitin\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.\n\nOur Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.\n\nOur Values underpin everything we do.\n\nCustomer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.\nPassion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.\nIntegrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.\nAction & Ownership - We have a bias toward action and empower teammates to make decisions.\nOne Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.\nGlobal Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.\n\nGlobal Benefits\n\nRemote First Culture\nHealth Care Coverage*\nEducation Reimbursement*\nCompetitive Paid Time Off\n4 Self-Care Days per year\nNational Holidays*\n2 Founder Days + Juneteenth Observed\nPaid Volunteer Time*\nCharitable contribution match*\nMonthly Wellness or Home Office Reimbursement*\nAccess to Modern Health (mental health platform)\nParental Leave*\nRetirement Plan with match/contribution*\nvaries by country\n\nSeeing Beyond the Job Ad\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!\n\nTurnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist - Applied Research (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fa7309553094efc6",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "n/a",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.\n\nTurnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.\n\nTurnitin, LLC is an equal opportunity employer- vets/disabled.\n\n\nJob Description\n\n\nMachine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products.\n\nWe are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.\n\nResponsibilities and Requirements\n\nWe’re an applied science group leaning towards modern Deep Learning. We expect our Senior Machine Learning Scientists to have a well-balanced set of skills, both in the Science as well as Software Engineering aspects of (Deep) Machine Learning. You will focus on developing novel and deployable ML models and solutions where no ready-made solution may be available. Therefore you need to be conversant enough with the mathematics of machine learning and deep neural networks such that you can construct novel model architectures, loss functions, training methods, training loops etc. You are also expected to keep abreast of the latest research advancements in AI and Deep Learning across modalities and apply those to your work. While we leverage ready-made training platforms, we also write our own training loops. Additionally, the models need to be directly deployable in our products, therefore, production level coding and software engineering proficiency is required. You may train large models (up to 100s of billions of parameters) therefore, ability to train on multiple GPUs and nodes and knowledge of the latest model training and inferencing advancements is necessary. Next, the models must perform well in production not only in terms of accuracy but also compute-cost. Delivering such software requires a sufficiently deep Computer Science background. Dataset exploration, generation (synthetic), design, construction and analysis, are a routine part of the job and may occupy a significant fraction of your time. Also, datasets can be large (billions of samples), therefore the ability to write parallel and efficient pipelines is a necessary skill. You will also be involved in code & model maintenance, code hardening (preparing the model and code for production pipelines), developing and staging demos and presenting your work within the company as well as via publications in peer reviewed venues (preferably A/A+ rated).\n\nDay-to-day, your responsibilities are to:\n\nResearch and develop production grade Machine Learning models as described above. Optimize models for scaled production usage.\nWork with colleagues in the AI team, other Engineering teams, subject matter experts, Product Management, Marketing, Sales and Customer support to explore ongoing product issues, challenges and opportunities and then recommend innovative ML/AI based solutions.\nHelp out with ad-hoc one-off tasks as a team player within the AI team.\nWork with subject matter experts to curate and generate optimal datasets following responsible data collection and model maintenance practices. Explore and access SQL, no-SQL and web data and write efficient parallel pipelines. Review and design datasets to ensure data quality.\nInvestigate weaknesses of models in production and work on pragmatic solutions.\nUtilize, adopt, and fine-tune off the shelf models, including LLMs exposed via API (through prompt engineering and agents) and locally hosting LMs and other foundation models.\nStay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.\nWrite clean, efficient, and modular code with automated tests and appropriate documentation.\nStay up to date with technology and platforms, make good technological choices, and be able to explain them to the organization.\nWork with downstream teams to productionize your work and ensure that it makes into a product release.\nCommunicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.\nPresent and publish your work.\n\nQualifications\n\n\nRequired Qualifications:\n\nMaster's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field or outstanding previous achievements demonstrating excellence in Deep Machine Learning, Computer Science and Software Engineering.\nAt least 5 years of industry experience in Machine / Deep Learning (we use the python ecosystem for ML), Computer Science and Software Engineering.\nA strong understanding of the math and theory behind machine learning and deep learning is a prerequisite.\nAcademic publications in peer reviewed conferences or journals related to Machine Learning - preferably A/A+ rated such as NeurIPS, ICML, ICLR, AAAI, TMLR, JMLR, IJCAI, ICANN, KDD, ACL, EMNLP, NAACL, COLING, CVPR, ICCV, ECCV, IEEE etc.\nMachine / Deep Learning development skills, including popular platforms (we use AWS SageMaker, Hugging Face, Transformers, PyTorch, PyTorch Lightning, Ray, scikit-learn, Jupyter, Weights & Biases etc.).\nAn understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.\nExcellent communication and teamwork skills.\nFluent in written and spoken English.\n\nWould be a plus:\n\nWe’re an applied science group, therefore Software development proficiency is a requirement. Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.\nA Computer Science educational background is preferred as opposed to statistics or pure mathematics.\nFamiliarity in building front-ends (Gradio, Streamlit, Dash or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.\nExperience with advanced prompting / agentic-systems and fine-tuning or training an LLM, using industry accepted platforms.\nShowcase previous work (e.g. via a website, presentation, open source code).\nFamiliarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.\nEssential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).\n\nAdditional Information\n\n\nThe expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.\n\nAs a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.\n\nTotal Rewards @ Turnitin\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.\n\nOur Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.\n\nOur Values underpin everything we do.\n\nCustomer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.\nPassion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.\nIntegrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.\nAction & Ownership - We have a bias toward action and empower teammates to make decisions.\nOne Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.\nGlobal Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.\n\nGlobal Benefits\n\nRemote First Culture\nHealth Care Coverage*\nEducation Reimbursement*\nCompetitive Paid Time Off\n4 Self-Care Days per year\nNational Holidays*\n2 Founder Days + Juneteenth Observed\nPaid Volunteer Time*\nCharitable contribution match*\nMonthly Wellness or Home Office Reimbursement*\nAccess to Modern Health (mental health platform)\nParental Leave*\nRetirement Plan with match/contribution*\nvaries by country\n\nSeeing Beyond the Job Ad\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!\n\nTurnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789b20dee7d0ba72",
    "salary": "$56.02 - $67.47 an hour - Contract",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "POSITION SUMMARY\n\n· We’re looking for a Data Scientist who can be responsible for designing, building and maintaining document capture applications. The ideal candidate will have a solid background in software engineering with experience in building Machine Learning NLP Models and good familiarity with Gen AI Models.\n\nEDUCATION\n\n· Provide Bachelor's degree information\n\n· Education should always have at the least: Degree, Major, University Name, Date of Graduation\n\nPrimary Skill\n\n· Data Scientist\n\nSecondary Skill\n\n· Artificial Intelligence/Machine Learning\n\nREQUIREMENT SKILLS / EXPERIENCE\n\n· 7+ years of experience as Data Scientist or related roles\n\n· Bachelor’s degree in Computer Science, or a related technical field\n\n· Deep understanding and some exposure to new Gen AI Open-source Models\n\n· At least 5 years programming experience in software development and Agile process\n\n· At least 5 years Python (or equivalent) programming experience to work with ML/NLP models.\n\n· Experience in setting up supervised unsupervised learning ML/NLP models including data cleaning, data analytics, feature creation, model selection ensemble methods, performance metrics visualization\n\n· Experience in ML/NLP development pipelines of large data sets, both structured unstructured\n\n· At least 2 years’ experience in designing and developing enterprise-scale ML/NLP solutions in one or more of: Named Entity Recognition, Document Classification, Document Summarization, Topic Modelling, Dialog Systems, Sentiment Analysis, OCR text processing\n\n· Knowledge and hands-on experience working with OCR products\n\nDESIRED SKILLS / EXPERIENCE\n\n· Master’s degree in Computer Science/Data Science, or a related technical field\n\n· Collaborating with a diverse set of partners and stakeholders from various Line of Business.\n\n· Highly motivated, proactive and a self-starter; strong sense of ownership ability to create and execute plans without daily oversight\n\n· Critical thinker; ability to analyze problems and identify issues and provide solutions\n\n· Ability to navigate the enterprise data assets across multiple functions.\n\n· Highly organized. Effectively prioritizes and balances multiple efforts in a fast-paced environment\n\n· Excellent communication and Presentation skills\n\n· Analytical abilities great problem solving\n\n· Client focused\n\nJob Type: Contract\n\nPay: $56.02 - $67.47 per hour\n\nWork Location: In person",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789abcdef0123456",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "n/a",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;",
    "qualifications": "n/a",
    "description": "Benefits:\n\nHYBRID\nCompetitive salary\nOpportunity for advancement\nTraining & development\n\nJob Title: Data Scientist – Integrated Operations\nLocation: Dallas, TX (Hybrid Remote)\nIn-Person Interview\nMust be authorized to work in the U.S\n\nWork Arrangement\n\nHybrid work model: primarily remote within the Dallas–Fort Worth area.\nOccasional on-site presence required for meetings, training, or business needs.\nLimited business travel may be required.\n\nRoles & Responsibilities\n. 6+ years of experience in Machine Learning and Data Science.\n\nStrong understanding of Generative AI, Retrieval Augmented Generation, Agentic Workflow, Statistical methods, data structures, and algorithms.\nStrong programming skills in Python; experience with Machine Learning libraries and Generative AI frameworks (e.g., Pandas, NumPy, Matplotlib, Seaborn, TensorFlow, PyTorch, scikit-learn, LangChain) and LLMs.\nExperience developing and deploying AI solutions on cloud platforms (e.g., AWS, Azure, or GCP).\nExperience in building Asynchronous Python APIs.\nExperience with data visualization tools such as Matplotlib, Seaborn, or Tableau.\nFamiliarity with cloud platforms such as AWS, Azure, or Google Cloud for deploying AI solutions.\nProven experience in developing and deploying machine learning models in a production environment.\nExperience working with large datasets and performing data analysis\n\nRequired Qualifications\n\nEducation\n\nBachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.\n\nExperience\n\nAdvanced experience in data science, machine learning, AI, or optimization projects.\nProficiency in Python and SQL.\nStrong understanding of statistical methods, experimental design, and model validation.\nExperience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).\nFamiliarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).\n\nPreferred Experience\n\nExperience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).\nExposure to specialized analytics areas such as simulation, graph analytics, or video analytics.\n\nSkills & Abilities\n\nAbility to independently manage and deliver on complex projects.\nStrong problem-solving and critical thinking skills.\nEffective communication skills for both technical and executive audiences.\nAbility to adapt quickly to changing priorities and new technologies.\nStrong interpersonal and collaboration skills.\n\n.....",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Science Subject Matter Experts",
    "company": "Zion Zest LLC",
    "jobLocation": "Dallas, TX 75244",
    "jobUrl": "https://www.indeed.com/viewjob?jk=34f39dba2736a427",
    "salary": "$180,000 - $250,000 a year - Full-time, Contract",
    "benefits": "Benefits\nPulled from the full job description\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "n/a",
    "description": "Overview\nWe are seeking a skilled and motivated Data Scientist to join our dynamic team. In this role, you will leverage your expertise in data analytics, machine learning, and statistical modeling to extract valuable insights from complex datasets. You will work collaboratively with cross-functional teams to drive data-driven decision-making and contribute to innovative projects that enhance our business strategies.\n\nResponsibilities\n\nSME Expertise: Seek out an SME with in-depth knowledge of data science concepts (e.g., machine learning, statistical modeling, programming languages like Python or R) and practical experience in applying these within a business context.\nPassion for Teaching: The SME should be passionate about teaching and able to simplify complex concepts for different learning levels within the organization.\nCustomized Content: Develop a customized curriculum that addresses identified skill gaps, and includes relevant tools and platforms used within your company.\nTo effectively train employees in data science, especially within a corporate context, consider using a data science subject matter expert (SME) to guide the training program.\nAnalyze large datasets to identify trends, patterns, and anomalies that can inform business decisions.\nDevelop and implement machine learning models and algorithms to solve complex problems.\nUtilize advanced analytics techniques including data mining and predictive modeling to enhance operational efficiency.\nCollaborate with stakeholders to understand their data needs and provide actionable insights.\nCreate visualizations and reports that effectively communicate findings to both technical and non-technical audiences.\nMaintain and optimize existing data pipelines and workflows using tools such as SQL, Hadoop, or SAS.\nStay current with industry trends in AI and machine learning frameworks to continuously improve methodologies.\n\nQualifications\n\nTrain junior Data Science Engineers and help them with programming.\nProficiency in programming languages such as C and VBA for data manipulation and analysis.\nStrong knowledge of SQL for database querying and management.\nExperience with linked data concepts and analytics tools.\nFamiliarity with machine learning frameworks (e.g., TensorFlow, PyTorch) is a plus.\nDemonstrated ability in data mining techniques for extracting insights from large datasets.\nExcellent problem-solving skills with a keen analytical mindset.\nStrong communication skills, both written and verbal, for effective collaboration across teams.\nA degree in Data Science, Computer Science, Statistics, or a related field is preferred.\n\nJoin us in harnessing the power of data to drive innovation and success!\n\nJob Types: Full-time, Contract\n\nPay: $180,000.00 - $250,000.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nWork Location: In person",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "AI GTM Analyst",
    "company": "Karbon",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4434e4117c77b9c6",
    "salary": "$100,000 - $130,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nWork from home stipend\nPaid parental leave\nParental leave\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\nShow more\n&nbsp;",
    "qualifications": "n/a",
    "description": "About Karbon\n\nKarbon is the global leader in practice management software for growth-minded accounting firms. We provide an award-winning, highly collaborative cloud platform that streamlines work and communication, enabling the average accounting firm using Karbon to save 18.5 hours per week, per employee.\n\nWe have customers in 34 countries and have grown into a globally distributed team, with our people based throughout the US, Australia, New Zealand, Canada, the United Kingdom, and the Philippines. We are well-funded, ranked #1 on G2, have a fantastic team culture built on our values, are growing rapidly, and making a global impact.\n\nWe are seeking an AI and LLM-powered GTM Analyst/Lead to transform our go-to-market operations by applying advanced AI techniques to uncover and optimize the biggest revenue levers across inbound, outbound, and CSQL channels. This role prioritizes AI-driven analysis of conversion ratios, improving one key metric at a time to compound gains across the funnel. Through LLM-powered time studies and predictive modeling, this role will reveal how GTM teams allocate time, what activities drive customer health, and where AI automation can accelerate pipeline performance. This is initially a 6-month full-time position.\n\nKey Responsibilities\n\n1. AI-Driven Funnel Analysis & Lever Optimization (Primary Focus)\n\nUse AI-powered data analysis and LLM-enhanced dashboards to identify the most impactful conversion levers across inbound, outbound, and CSQL funnels.\n\nDevelop and test LLM-informed hypotheses to improve one ratio at a time (e.g., lead-to-opportunity or win rates).\n\nCollaborate with GTM and RevOps teams to operationalize AI-generated insights for measurable improvements.\n\n2. LLM-Powered Time Studies (Primary Focus)\n\nDeploy AI models and LLMs to analyze rep activity and time-to-serve by customer segment (e.g., <1-year vs. 1-year+ healthy accounts).\n\nIdentify repetitive or low-value tasks for automation using AI agents to improve efficiency and focus on high-value activities.\n\n3. Predictive Signal Layer Creation (Secondary Focus)\n\nUnify CRM, call, email, product usage, and enrichment data into an AI-driven predictive signal layer that surfaces intent, fit, and timing.\n\nTrain LLM-based scoring models to enhance account prioritization and sales targeting.\n\n4. Insight Automation with LLMs (Secondary Focus)\n\nUse LLMs and embeddings to turn Gong calls, notes, and emails into structured AI-extracted insights.\n\nAutomate AI-generated summaries of objections, next-best actions, and risk signals for pipeline forecasting.\n\n5. AI-Enabled Playbooks & Dynamic Collateral (Tertiary Focus)\n\nDeploy AI and LLM tools to automatically generate personalized collateral (emails, decks, and messaging) tailored to prospect profiles.\n\nImplement AI-driven workflows for prospecting, reactivation, and qualification in platforms like HubSpot and Clay.\n\nQualifications\n\nHands-on experience with AI, LLMs, and vector embeddings, including tools like OpenAI API, LangChain, or similar frameworks.\n\nProven ability to design, implement, and optimize AI workflows for GTM teams, including predictive modeling and automated insights.\n\nStrong understanding of data pipelines and unstructured data analysis (e.g., Gong call transcripts, email content) using LLM-based techniques.\n\nExpertise in applying LLMs for summarization, insight extraction, and next-best action recommendations within GTM contexts.\n\nFamiliarity with AI-powered automation platforms (e.g., HubSpot AI, Clay, or custom GPT-based agents).\n\nDeep knowledge of GTM tech stacks (e.g., Salesforce, Gong, HubSpot, Outreach) and experience leveraging AI integrations to extract maximum value from these tools.\n\nSolid grounding in GTM funnel metrics and the ability to apply AI analytics to improve conversion ratios sequentially.\n\nProficiency in SQL or Python for data manipulation and AI model integration is plus.\n\nWhy Work at Karbon\n\nGain global experience across the USA, Australia, New Zealand, UK, Canada and the Philippines\n\nExcellent benefits package including:\n\nPaid Flexible Time Off with an encouraged 3 weeks use per year\n\nCompany paid medical for you and eligible spouse/partner and dependents\n\nCompany paid dental and vision and eligible spouse/partner and dependents\n\nFully company funded short and long term disability\n\nFully company paid life insurance\n\n401(k) with company matching\n\nFlexible Spending Account\n\nUp to 8 weeks paid parental leave\n\nWork-from-home stipend\n\nWork with (and learn from) an experienced, high-performing team\n\nA collaborative, team-oriented culture that embraces diversity, invests in development and provides consistent feedback\n\nBe part of a fast-growing company that firmly believes in promoting high performers from within\n\nKarbon embraces diversity and inclusion, aligning with our values as a business. Research has shown that women and underrepresented groups are less likely to apply to jobs unless they meet every single criteria. If you've made it this far in the job description but your past experience doesn't perfectly align, we do encourage you to still apply. You could still be the right person for the role!\n\nWe recruit and reward people based on capability and performance. We don't discriminate based on race, gender, sexual orientation, gender identity or expression, lifestyle, age, educational background, national origin, religion, physical or cognitive ability, and other diversity dimensions that may hinder inclusion in the organization.\n\nGenerally, if you are a good person, we want to talk to you.\n\nIf there are any adjustments or accommodations that we can make to assist you during the recruitment process, and your journey at Karbon, contact us at people.support@karbonhq.com for a confidential discussion.\n\n\n\n\nAt this time, we request that agency referrals are not submitted for this position. We appreciate your understanding and encourage direct applications from interested candidates. Thank you!",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Job Description\n\n\nJob Description:\n\nImportant Note: Candidates should have the following experience\n\nPOSITION SUMMARY –\n\nReason for contingent headcount?\n\nWorkload\n\nWhat is the project(s) name?\n\nWhat specific departments will they interact with?\n\nWhat phase is the project currently in?\n\nOngoing Support\n\nRequirements:\n\nMust Haves:\n\nStrong quantitative skills\n\nPreferred/ Nice-to-haves: (The below is not necessary for this position. These are the responsibilities of the new big data architect position we are hiring for)\n\n\nAdditional Information\n\n\nAll your information will be kept confidential according to EEO guidelines.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "salary": "Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights.\n\n\n\n\n\n\n\nKEY EXPECTATIONS\n\n\n\n\nWork with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\nMine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.\nAssess the effectiveness and accuracy of new data sources and data gathering techniques.\nDevelop custom data models and algorithms to apply to data sets.\nUse predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.\nDevelop company A/B testing framework and test model quality.\nCoordinate with different functional teams to implement models and monitor outcomes.\nDevelop processes and tools to monitor and analyze model performance and data accuracy.\n\n\nDESIRED SKILLS AND EXPERIENCE\n\n\n\n\nStrong problem-solving skills with an emphasis on product development.\nExperience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\nExperience working with and creating data architectures.\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\nKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\nExcellent written and verbal communication skills for coordinating across teams.\nA drive to learn and master new technologies and techniques.\n5-7 years of experience manipulating data sets and building statistical models.\nMaster’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools:\n\n\nCoding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.\nKnowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.\nExperience querying databases and using statistical computer languages: R, Python, SLQ, etc.\nExperience using web services: Redshift, S3, Spark, DigitalOcean, etc.\nExperience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.\nExperience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.\nExperience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.\nExperience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.\n\n\nEmployer’s Rights:\n\n\nPeoplevisor, LLC. has the right to revise this job description at any time. This job description is not a contract for employment. This job description does not list all the duties of the job. You may be asked by your supervisors or managers to perform other duties. You will be evaluated in part based upon your performance of the tasks listed in this job description.\n\n\nEqual Opportunity Statement:\n\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or status as a Vietnam or disabled veteran.\n\n\nApplications for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Peoplevisor, LLC.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Science Engineer",
    "company": "Goodnight Midstream",
    "jobLocation": "Hybrid work in Dallas, TX 75206",
    "jobUrl": "https://www.indeed.com/viewjob?jk=a9de40a688b5e9f7",
    "salary": "Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "We're seeking an outgoing and collaborative Data Science Engineer to join our team. You'll play a key role in building and integrating data tools and solutions that will directly impact our business operations. Goodnight Midstream is predominantly a MS Power Platform, Palantir Foundry and Ignition/SCADA shop.\n\nThis is an exempt-level position based out of our Dallas office, working a hybrid schedule. Applicants must be currently authorized to work in the United States on a full-time basis- Goodnight Midstream is not able to sponsor applicants for work visa.\n\nThis position requires someone who's not only technically skilled but also a great communicator, capable of working effectively across multiple teams to understand their needs and deliver innovative solutions. You'll be instrumental in developing and maintaining our data infrastructure, with a particular focus on integrating with industrial SCADA systems and SQL databases to drive insights and improve efficiency.\n\nResponsibilities:\n\nServe as an engineering resource for the development of Data Science projects.\nBuild and maintain data pipelines to support data-driven decision making across the organization.\nIntegrate data from diverse sources, including, but not limited to, APIs, industrial SCADA systems and various SQL databases.\nDevelop and deploy AI-powered tools and models to solve complex business problems.\nCollaborate with cross-functional teams, including engineers, operations and management to define project requirements and deliver effective solutions.\nManage data science projects from conception to completion, ensuring timely and successful delivery using professional project management tools.\nTrain end users on optimizing their use of the Data Science data platform.\nUtilize a variety of AI tools to automate processes, enhance data analysis and improve overall operational intelligence.\nManage and maintain the company’s schema and data map\n\nEducation, Experience, and Technical Skills:\n\nA bachelor’s degree is required. While a technical background is preferred, we welcome applicants from a variety of educational fields, including engineering disciplines such as mechanical or electrical engineering. Candidates should have at least two years of professional experience in a data-focused role, with proven expertise in building and integrating data systems.\n\nExperience and proficiency with the following technologies is required:\n\nPython\nMicrosoft Power Platform\nMS SQL Server\nMS Excel\nProficiency in programmatically interacting with APIs for data exchange and system integration.\nExperience with the following technologies would be preferred and ideal:\nPalantir Foundry, and specifically Quiver\nSplunk\nAI Tools\nYou should be able to demonstrate your skills without references.\n\nThe candidate should be highly skilled in the following areas: problem solving, prioritization, attention to detail, verbal and written communication. This position requires a self-starter/self-learner that demonstrates clear accountability and can adapt easily whether working independently or with a team. The candidate must have a strong sense of urgency and sound judgment. This candidate must be able to work independently, as well as in a group setting. Ability to plan out, manage, document and delegate multiple concurrent projects.\n\nWorking Environment/Physical Requirements:\n\nWorking conditions are normal for an office environment. This position remains sedentary at least 75% of the time. This position constantly operates computers, phones, printers and other office productivity machines (e.g., fax machine, copier, printer, etc.). Occasionally required to move documents or files weighing up to 10 lbs. This position requires frequent communication and exchange of information verbally and in writing. This position must be able to inspect and observe information on a computer screen at least 80% of the time. Occasional travel to field facilities and other locations may be required.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Sr Data Scientist GenAI",
    "company": "Select Minds LLC",
    "jobLocation": "Dallas, TX 75235 \n(Dallas Love Field area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0adc95909d448a8e",
    "salary": "$150,000 - $210,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\nFlexible schedule\n&nbsp;",
    "qualifications": "n/a",
    "description": "Benefits:\n\nCompetitive salary\nFlexible schedule\nOpportunity for advancement\n\nSr Data Scientist (NLP / LLM / Generative AI)\nLocation: Dallas, TX\n\nRoles & Responsibilities :\n\nDesign, build, fine-tune, and deploy LLMs, transformer-based NLP models, and GenAI solutions for both batch and real-time/streaming contexts.\nOwn all major components of ML pipelines: data ingestion, cleaning, pre-processing (structured & unstructured), embedding, search & retrieval, prompt engineering, RAG (Retrieval-Augmented Generation).\nCollaborate closely with ML Engineers, MLOps, software engineering, product, compliance, legal etc., to move models from prototype to production—ensuring reliability, scalability, monitoring, and maintainability.\nDefine and implement evaluation frameworks: accuracy, bias, fairness, hallucination, consistency, latency; run UAT, stress-tests, drift detection.\nOptimize models and pipelines for performance, cost, and efficiency.\nEnsure best practices in model development: version control, repeatability, documentation, governance, and ethical AI use.\nMentor more junior data scientists; help build team skills in NLP, GenAI practices, prompt engineering, fine-tuning.\nIdentify new use cases; prototype innovations in GenAI/NLP; keep up with latest research and open source developments, decide what to adopt.\n\nMust-Have Qualifications:\n\n10+ years of experience in data science / ML, with substantial work in NLP, LLMs, or Generative AI.\nDeep hands-on experience in Python, using frameworks like PyTorch, TensorFlow, HuggingFace etc.\nProven track record building transformer/NLP / LLM models; experience with fine-tuning, prompt engineering.\nSolid experience with information retrieval / search: keyword + semantic search, embeddings, vector databases.\nExperience working in production / deploying models (batch and streaming), working with MLOps practices.\nStrong algorithmic / statistical / mathematical fundamentals. Ability to reason about model behaviour, bias, uncertainty.\nGood communicator: able to translate complex technical detail to business / non-technical stakeholders.\n\nNice to Have:\n\nMaster's in Computer Science, Computational Linguistics, Statistics, Machine Learning or related field.\nExperience with multimodal models (vision + text) or emerging LLMs and agent-based systems.\nExperience with open source LLMs & toolkits; familiarity with LangChain or similar frameworks.\nPrior experience in regulated environments (finance, risk, legal, compliance) with strong governance, privacy requirements.\n\n\n\nWork remote temporarily due to COVID-19.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  }
]