[
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;",
    "qualifications": "Education; Bachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.; Experience; Advanced experience in data science, machine learning, AI, or optimization projects.; Proficiency in Python and SQL.; Strong understanding of statistical methods, experimental design, and model validation.; Experience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).; Familiarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).",
    "description": "Benefits: HYBRID Competitive salary Opportunity for advancement Training & development...",
    "preferences": "Experience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).; Exposure to specialized analytics areas such as simulation, graph analytics, or video analytics.; Skills & Abilities; Ability to independently manage and deliver on complex projects.; Strong problem-solving and critical thinking skills.; Effective communication skills for both technical and executive audiences.; Ability to adapt quickly to changing priorities and new technologies.; Strong interpersonal and collaboration skills.; ....."
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Rhapsody",
    "jobLocation": "Remote in Dallas, TX 75201",
    "jobUrl": "https://www.indeed.com/viewjob?jk=eb48d0156c9fa160",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Required:; 3+ years of experience in data science, machine learning, or applied analytics; Strong Python skills (e.g., pandas, NumPy, matplotlib, scikit-learn); Strong data analysis skills, with experience exploring, interpreting, and extracting insights from complex datasets; Familiarity with SQL; Experience working with structured data and building basic models (e.g., classification, regression); Curiosity about AI/ML systems and a willingness to learn quickly through real-world application",
    "description": "About Rhapsody: We all know that our health care system is complicated. Getting data from one provider to another, or from a provider to a health insurance company, is frustrating for virtually everyone. Imagine developing solutions that help make these data transactions easier and faster. That is what we do at Rhapsody; we make interoperability platforms that allow data – such as patient encounter details, lab results, and billing information – to move seamlessly from one system to another. While most people will not ever see our products and services during a medical encounter, our interoperability platforms are running behind the scenes. Think of them as the central nervous system helping to move data where it needs to be to improve the patient experience. To learn more about Rhapsody, visit www.rhapsody.health If using your expertise in a way that impacts our health care system, patient care, and population health sounds like something you would find rewarding, apply today! This is a remote position. However, preference is for someone local to Dallas, TX....",
    "preferences": "Exposure to evaluating or experimenting with neural networks; Familiarity with model evaluation techniques (e.g., precision/recall, ROC, drift detection); Interest in or exposure to GenAI workflows (e.g., prompt evaluation, embedding inspection); Experience using tools like Jupyter, MLflow, Airflow, or analytics platforms; Education:; Bachelor’s or Master’s degree in Data Science, Statistics, Computer Science, or a related field (or equivalent experience)"
  },
  {
    "jobTitle": "Data Engineer",
    "company": "Rapideagle",
    "jobLocation": "Plano, TX 75023",
    "jobUrl": "https://www.indeed.com/viewjob?jk=632b61b982c7cb54",
    "salary": "$57.52 - $69.27 an hour - Full-time, Contract",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\nPaid time off\nDental insurance\n&nbsp;",
    "qualifications": "Not specified",
    "description": "Job Overview We are seeking a skilled and motivated Data Engineer to join our dynamic team. The ideal candidate will be responsible for designing, developing, and maintaining robust data pipelines and architectures that support our data-driven decision-making processes. This role requires a strong understanding of big data technologies and cloud-based solutions, particularly within the Azure ecosystem. Duties Develop and maintain scalable data pipelines using Azure Data Lake and Hadoop to support large-scale data processing. Collaborate with data scientists and analysts to facilitate model training and ensure data availability for analysis....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "OxeFit, Inc.",
    "jobLocation": "Plano, TX 75093",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0b45b010841965be",
    "salary": "Full-time",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "Not specified",
    "description": "Salary Range: Based on experience As a Data Scientist, you will have the opportunity to build and develop models for data processing and analytics related to strength training and fitness. Essential Functions: ● Work with subject matter experts in fitness and strength training to develop metrics and...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Engineer",
    "company": "Artius Solutions",
    "jobLocation": "Dallas, TX 75219 \n(Oak Lawn area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=103ede5a08ec3bc6",
    "salary": "$60 - $65 an hour",
    "benefits": "Not specified",
    "qualifications": "Communicate technical concepts effectively to both technical and non-technical stakeholders.; Bachelor's or Master's degree in Computer Science, Data Engineering, or a related quantitative field.; 7+ years of experience in data engineering, with at least 3+ years in a lead or senior role.; Proven expertise in designing and implementing data solutions on Databricks.; Strong hands-on experience with Apache Kafka for real-time data streaming.; In-depth knowledge and practical experience with Databricks Unity Catalog for data governance and access control.; Solid understanding of AWS cloud services and their application in data architectures (S3, EC2, Lambda, VPC, IAM, etc.).; Demonstrated ability to optimize cloud resource usage and implement cost-saving strategies.; Proficiency in Python and Spark (PySpark/Spark SQL) for data processing and analysis.; Experience with Delta Lake and other modern data lake formats.; Excellent problem-solving, analytical, and communication skills.; Added Advantage (Bonus Skills):; Experience with Apache Flink for stream processing.; Databricks certifications.; Experience with CI/CD pipelines for Databricks deployments.; Knowledge of other cloud platforms (Azure, GCP) is a plus.; .",
    "description": "Job Title: Data Engineer Location: Dallas, TX Job Summary: As a Databricks Lead, you will be a critical member of our data engineering team, responsible for designing, developing, and optimizing our data pipelines and platforms on Databricks, primarily leveraging AWS services. You will play a key role in implementing robust data governance with Unity Catalog and ensuring cost-effective data solutions. This role requires a strong technical leader who can mentor junior engineers, drive best practices, and contribute hands-on to complex data challenges. Responsibilities:...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Sr. Data Engineer",
    "company": "S Tekwizards LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=be008c41dcaf77db",
    "salary": "$100,000 - $120,000 a year - Full-time, Contract",
    "benefits": "Not specified",
    "qualifications": "Optimize data models and queries for performance and cost-efficiency in Snowflake.; Ensure data quality, integrity, and governance across all pipelines.; Integrate Snowflake datasets with Power BI for reporting and analytics.; Monitor and troubleshoot data pipeline issues and implement proactive improvements.; Document processes, data flows, and architecture for transparency and maintainability.; Job Types: Full-time, Contract; Pay: $100,000.00 - $120,000.00 per year",
    "description": "Job Title: Data Engineer – Insurance Data Modernization Location: Irving, Texas Department: Data & Analytics Employment Type: Full-Time ( US Citizens / Green Cards only ) Company Overview...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Python AI Developer",
    "company": "Seven Hills Group Technologies inc.",
    "jobLocation": "Dallas, TX 75201 \n(Downtown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=67b0af1bb059688f",
    "salary": "Contract",
    "benefits": "Not specified",
    "qualifications": "Testing & Optimization:; Develop automated tests, monitor system performance, and continually refine integration points for reliability and efficiency.; Proven experience with fullstack Python development (FastAPI, Flask, Django, React/Vue/Angular, SQL/NoSQL databases).; Hands-on experience building and integrating AI agents (LLMs, RAG, multi-agent systems) in production environments.; Familiarity with the LangGraph framework and agent orchestration patterns.; Deep understanding of context engineering, including retrieval-augmented generation, prompt design, and session management.; Experience with cloud platforms (AWS, GCP, Azure), containerization (Docker), and CI/CD pipelines.; Strong problem-solving skills, attention to detail, and a collaborative mindset.",
    "description": "We are seeking a talented and driven Integration Engineer with a strong fullstack Python background to join our AI solutions team. In this role, you will be responsible for building, integrating, and optimizing intelligent systems leveraging AI agents, the LangGraph framework, and advanced context engineering techniques. You will work across the stack, collaborating with data scientists, ML engineers, and product teams to deliver scalable, adaptive, and context-aware solutions. Key Responsibilities: Fullstack Development: Design, develop, and maintain end-to-end Python applications that interface with AI agents and backend services, ensuring robust, scalable, and maintainable codebases. AI Agent Integration:...",
    "preferences": "Knowledge of advanced ML model serving, vector search, or knowledge graph integration.; Experience with modern front-end frameworks and data visualization tools.; Contributions to open-source AI or agent frameworks.; Thanks and Regards; Nick Awasth; Job Type: Contract; Experience:"
  },
  {
    "jobTitle": "Data Scientist/Machine Learning Engineer",
    "company": "Ad hoc Research",
    "jobLocation": "Plano, TX 75074",
    "jobUrl": "https://www.indeed.com/viewjob?jk=74e623cedcbf0dc3",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Job description: **MUST BE US CITIZEN OR GREEN CARD HOLDER** We are looking for a experienced Data Scientist/Machine Learning Engineer. 1. Must have a Master's Degree in any of the these field - Mathematics, Statistics, Computer Science, Data Science, Engineering or related field. 2. At least 5 Years of industry Experience with machine learning algorithms and frameworks like scikit-learn, TensorFlow, and PyTorch....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist/Machine Learning Engineer",
    "company": "Ad hoc Research",
    "jobLocation": "Plano, TX 75074",
    "jobUrl": "https://www.indeed.com/viewjob?jk=890abcdef0123456",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Spectral MD Inc",
    "jobLocation": "Dallas, TX 75201 \n(Uptown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=f46871773389d191",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "M.S. or Ph.D. in Computer Science, Electrical Engineering, Biomedical Engineering, Statistics, Applied Mathematics or related field.; Knowledge, Skills, and Abilities:; Strong foundation in state-of-the-art deep learning architectures (e.g., vision transformers) for computer vision tasks including image classification, object detection, and semantic segmentation.; Proficiency in deep learning libraries and frameworks, including PyTorch and TensorFlow.; Proficiency in C++ regarding object-oriented programming, data structure and performance optimization technique.; Solid knowledge of model optimization techniques, such as pruning, quantization, mixed-precision inference, and other performance-enhancing strategies.; Solid knowledge of model deployment tools, including ONNX, LibTorch, and TensorRT.; Strong grasp of model evaluation metrics, benchmarking, and best practices for computer vision model validation.; Self-driven with the ability to deliver on ambiguous projects with incomplete data.; Excellent written communication skills, especially in writing technical manuscripts.; Bonus:; Experience and knowledge in healthcare domain with successful outcomes.; Experience with CUDA programming for developing custom GPU kernels, optimizing computational performance, and accelerating deep learning workflows.; Prolonged periods of sitting at a desk and working on a computer.; Travel:; N/A; Equal Employment Opportunity:; Spectral MD, Inc. is an equal opportunity and affirmative action employer. All applicants will be considered for employment without regard to race, color, ancestry, national origin, sex, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing, protected veteran status, or any other characteristic protected by applicable federal, state or local laws.",
    "description": "Position Summary: We are seeking a motivated Data Scientist to research, develop, and enhance machine learning and deep learning algorithms that drive innovative healthcare solutions. This role involves maintaining high data quality standards, collaborating with clinical and business partners to understand their needs, and translating advanced research into practical applications. The ideal candidate will assist in building and improving deep learning frameworks, manage projects independently, and work effectively both individually and within cross-functional teams. Staying current with emerging technologies and demonstrating strong communication, attention to detail, and persistence are essential for success in this role. Essential Duties and Responsibilities: Research, develop, and enhance machine learning and deep learning algorithms and frameworks for computer vision applications, translating cutting-edge research into practical healthcare solutions. Implement and optimize deployment pipelines for trained models to enable efficient, scalable, and hardware-optimized inference....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Must Haves:; Strong quantitative skills",
    "description": "Job Description Job Description: Important Note: Candidates should have the following experience POSITION SUMMARY – Reason for contingent headcount?...",
    "preferences": "Additional Information; All your information will be kept confidential according to EEO guidelines."
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. KEY EXPECTATIONS Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions. Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies. Assess the effectiveness and accuracy of new data sources and data gathering techniques....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "AI Engineer",
    "company": "Scalable Systems",
    "jobLocation": "Dallas, TX 75201 \n(Downtown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=cef287c20bd88b89",
    "salary": "$45 - $50 an hour - Contract",
    "benefits": "Not specified",
    "qualifications": "Bachelor’s or Master’s degree in Computer Science, Artificial Intelligence, Data Science, or a related field.; Proven experience in AI/ML model development and deployment.; Strong programming skills in Python, R, or similar languages.; Experience with AI/ML frameworks such as TensorFlow, PyTorch, or scikit-learn.; Solid understanding of data structures, algorithms, and software engineering principles.; Knowledge of cloud platforms (AWS, Azure, GCP) for AI/ML deployment is a plus.; Strong problem-solving skills and ability to work in a collaborative environment.; Experience with natural language processing (NLP), computer vision, or reinforcement learning.; Familiarity with big data tools like Spark, Hadoop, or Kafka.; Prior experience in production-level AI systems.; Job Type: Contract; Pay: $45.00 - $50.00 per hour; Experience:; AI Engineer: 3 years (Required); Machine learning: 3 years (Required); Python: 5 years (Required)",
    "description": "About the Role: We are seeking a talented and motivated AI Engineer to join our dynamic team in Dallas, TX. The ideal candidate will have experience in designing, developing, and deploying AI/ML models and solutions that drive business impact. You will work closely with data scientists, software engineers, and product teams to implement scalable AI systems. Key Responsibilities: Design, develop, and deploy AI/ML models for various business applications. Collaborate with data engineering and product teams to integrate AI solutions into production systems....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Senior Data Scientist",
    "company": "CARE IT SERVICES INC",
    "jobLocation": "Dallas, TX 75201 \n(Downtown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=6a4895d490612e28",
    "salary": "$100,000 - $140,000 a year - Full-time, Contract",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Job Title: Sr. Data Scientist Experience: 8–12 years Employment Type: W2 / 1099 only (No OPT / CPT) locations : Dallas, TX, Jerseycity, NJ , Tampa, FL, Atlanta, GA, Bay Area, CA Note: H-1B candidates are also welcome to apply....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Center Operating Engineer",
    "company": "Entangl",
    "jobLocation": "Remote in Dallas-Fort Worth, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=86d799d3b3e76b76",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "3+ years of direct experience as an Operating Engineer or Facilities Engineer in a data center environment.; Deep understanding of data center operations, infrastructure, maintenance, and reliability practices.; Strong communication skills to effectively collaborate across technical and operational teams.; Experience with writing and reviewing maintenance procedures.; Experience with reading one-line schematics.; Why Entangl:; Work on cutting-edge technology at the intersection of AI and data center management.; Influence product development at a strategic level.; Flexible, remote-friendly environment.; Be part of a dynamic, fast-growing startup team.; How applications work?; If your application is not a match for our team, we may forward it to our customers when we believe it could be a strong fit for their needs.",
    "description": "Position Overview: We are seeking an experienced Operating Engineer with direct hands-on experience in data centers. Your primary role will be reviewing our AI models to ensure accuracy, reliability, and practical applicability in operational scenarios. You’ll collaborate closely with our data scientists and engineers, ensuring our AI recommendations reflect real operational challenges. Responsibilities: Evaluate and review AI models designed to optimize data center operations. Provide feedback based on real-world data center operational knowledge....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Engineer",
    "company": "Care Continuity",
    "jobLocation": "Remote in Irving, TX 75038",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b734f86f7aa1801f",
    "salary": "$130,000 - $155,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\n401(k)\nHealth insurance\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "This is a high-ownership role for someone excited to solve complex data problems at the intersection of healthcare, analytics, and product development.; What You'll Do; Design scalable data models to support downstream analysis and reporting; Create and optimize data pipelines for efficient data processing, ensuring data is readily available for data scientists and analysts; Help define data engineering standards, tooling, and architecture as we scale; Implement data quality checks, logging, and monitoring for reliability and transparency; Collaborate with engineering to define and implement ingestion across data sources; Write clean, testable code for transformation logic and pipeline orchestration; Produce clear documentation and runbooks; What We're Looking For; 3–6+ years of experience in data engineering, building production data pipelines; Strong experience with ETL pipeline development using modern tools (e.g., Airflow, dbt, Spark, etc.); Proficiency in Python, SQL, and NoSQL databases; Experience working with HL7 CDA / CCD documents, FHIR resources, or other healthcare data formats; Experience designing data models for analytics and machine learning; Strong problem-solving mindset and willingness to dive into ambiguity; Nice to Have; Healthcare data experience (e.g., SNOMED, ICD-10, CDA); Experience building data pipelines in cloud environments (AWS, GCP, Azure); Experience with dbt or similar transformation layer tools; Exposure to predictive modeling or ML pipelines is a plus",
    "description": "About Care Continuity Care Continuity is redefining patient navigation. We combine clinical expertise, AI-driven insights, and compassionate human support to ensure patients receive the care they need - when and where they need it. Our solutions empower health systems and providers to close care gaps, reduce readmissions, and drive ROI through smarter, more connected navigation. Our work is transforming how care decisions are made - and we're just getting started. About the Role You'll be responsible for designing and implementing scalable, reliable ETL pipelines that power our core data platform....",
    "preferences": "Not specified"
  }
]