[
  {
    "jobTitle": "AI Engineer - Core Education",
    "company": "Stemuli",
    "jobLocation": "Dallas, TX 75201 \n(Downtown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=be1c66f51b5e950b",
    "salary": "$150,000 - $185,000 a year - Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Company Overview\n\nStemuli is a pioneering technology company at the intersection of AI, gaming, and workforce development. Backed by the Gates Foundation, Stride Learning, Heartland Forward, Draper & Associates, Slauson & Co, and Valor Ventures, Stemuli is building the world's first AI-native educational gaming platform. Recognized as the 2024 Global Champion of AI for Good by the United Nations, our mission is to make education and career development personalized, engaging, and accessible to billions of learners worldwide.\n\nPosition Overview\n\nAs an AI Engineer – Core Education, you will play a pivotal role in advancing the intelligence of ORB Chat, our personalized AI learning companion. You'll build the core AI systems that power daily motivational dialogues, adaptive tutoring, and real-time guidance that helps students connect their academic progress (e.g., math and AI literacy) with future career opportunities. Your work will be central to scaling ORB to serve hundreds of thousands of students across Stride schools, Heartland Forward's 20-state initiative, and our international partnerships.\n\nResponsibilities\n\nBuild and scale LLM-powered educational assistants (ORB Chat) that deliver personalized, culturally responsive learning experiences.\nDesign and maintain ETL pipelines for K‑12 curricular data, AI literacy modules, and workforce skills content.\nDevelop and fine-tune generative AI models for problem creation, explanations, and adaptive feedback in math and career-learning contexts.\nEnsure reliability and safety of AI outputs through structured output validation, re-asking strategies, and bias-mitigation techniques.\nPartner with game designers and Unity engineers to bring AI-driven NPCs to life inside the 3D City and Founder Tycoon experiences.\nCollaborate with education researchers to ensure models align with industry and standards-aligned curricula and support equitable outcomes for all learners\n\nWhat We're Looking For\n\n3+ years of experience with large language models (LLMs), including prompting, RAG pipelines, and fine-tuning.\nStrong skills in Python and experience with LLMOps platforms (e.g., Weights & Biases).\nExperience building AI-driven tutoring, chatbots, or content-generation systems.\nStrong foundation in data structures, algorithms, and software engineering principles.\nCreative, mission-driven mindset with a passion for transforming how students learn through play and AI.\n\nWhat We Offer\n\nOpportunity to define and scale the core AI companion (ORB) at the center of a new global education platform.\nCollaboration with a diverse, world-class team across game design, Unity, backend, and education research.\n$160K – $185K annual salary + meaningful equity.\nHybrid: Seattle-based AI team with flexibility.\nComprehensive benefits package.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Cyber Infotech",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fc93d4af354c1d0f",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Build, implement and maintain predictive models through their full lifecycle.\nIdentify patterns & trends in data, and provides insights to enhance business decision making.\nIdentify challenges and opportunities from client strategy discussions and taking ownership of solution.\nSet up and monitor monthly model recalibration process.\nGenerate complex ad-hoc analyses combining disparate concepts or creating new approaches.\nDesign and create new analytic procedures & automation.\n\nPlease forward your resume to contact@cyberinfotek.com",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Data Xpander",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=cdaa9e9635b3200e",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Email at hr@dataxpander.com\n\nThey need to have statistical, mathematical, predictive modelling as well as business strategy skills to build the algorithms necessary to ask the right questions and find the right answers. They also need to be able to communicate their findings, orally and visually. They need to understand how the products are developed and even more important, as big data touches the privacy of consumers, they need to have a set of ethical responsibilities.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Machine Learning Engineer I - Realm-X",
    "company": "AppFolio",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=dce6ca123694dc9f",
    "salary": "$114,400 - $143,000 a year - Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Hi, We’re AppFolio.\n\nWe’re innovators, changemakers, and collaborators. We’re more than just a software company — we’re building the cloud and AI-based Platform where the Real Estate industry comes to do business. We’re revolutionizing the way Property Managers do business, while improving how people live, and we want your ideas, your enthusiasm, and your passion to help us keep on innovating.\n\nWe love where we work, and you can, too.\n\n\nWho we are looking for:\n\nWe’re seeking a mid-level Full Stack Software Engineer II to join our AI Engineering Group (Realm-X) and help drive the evolution of our Workflows Platform. This platform delivers a robust framework for automating key business processes—such as leasing, maintenance, move-ins, and move-outs—while equipping teams with powerful tools to build Agentic Workflows that push automation even further, streamlining both operations and communications.\n\nWe work collaboratively to set the technical direction for our SaaS and AI products, developing easy-to-use solutions for our customers. Our engineers find deep satisfaction in building things that customers need. We focus on delivering value to customers and understand that this often means delivering code that isn't perfect but meets customer needs.\n\nThis is an ideal opportunity for someone who has a passion for building leading-edge software in the intersection of workflows, AI Agents, and automation. We foster an environment that empowers small teams to set the technical direction of our solutions collaboratively.\n\n\nResponsibilities:\n\nDevelop front-end and back-end scalable features for AppFolio’s robust and web-based workflow builder for Property Manager businesses.\n\nDevelop and improve AppFolio’s DSL (Domain-Specific Language), which enables our customers and internal teams to quickly create customizable business processes.\n\nFormulate, implement, and evaluate algorithms and database queries to support SaaS scalability and stability.\n\nImplement new features and optimize existing ones to drive maximum performance.\n\nUse test-driven development, code reviews, and continuous integration to deliver high-quality software and rapidly fix bugs as they come up.\n\nWork closely with, and incorporate feedback from other engineering team members, QA, product owners, and our APM customers.\n\nLeveraging agile practices, encourage collaboration, prioritization, and urgency to develop at a rapid pace\n\nResearch, share, and recommend new technologies and trends.\n\n\nYou know you’re the right fit if…\n\nYou’ve heard of Ruby and Rails and have experience working with a language like Ruby, Go, Python, and JavaScript.\n\nYou love learning about new technologies but understand the value of using something old if it still does everything you need it to do.\n\nYou care about the long-term maintainability of the codebase and will learn to advocate for refactoring and clean-ups where appropriate.\n\nYou care about work-life balance and want your company to care about it, too; you'll put in the extra hour when needed but won't let it become a habit.\n\n\nAdditional Skills and Knowledge:\n\nBachelor's, Master's, or Ph.D. in Computer Science or related technical discipline\n\nHands-on work experience developing web-based applications, preferably in a SaaS environment using cloud technologies like AWS.\n\nCreativity, the ability to solve complex problems without a roadmap\n\n\nNice to Have:\n\nKnowledge or experience with some areas of our tech, like Ruby on Rails, React, Go, Python, and AWS.\n\nWorkflow technologies knowledge or experience (Temporal)\n\nAI/ML knowledge or experience (evaluating and deploying models in production)\n\nAI Agents knowledge (LangChain, LangGraph, OpenAI API, LLMs, and prompting)\n\nExperience working across all levels of the development stack\n\nFamiliarity with Agile software development processes: Scrum or Kanban\n\nFamiliarity with Test-Driven-Development\n\n\nCompensation & Benefits\n\nThe base salary that we reasonably expect to pay for this role is 114,400.00 - 143,000.00 USD annually. The actual base salary for this role will be determined by a variety of factors, including but not limited to the candidate’s skills, education, experience, etc.\n\nPlease note that base pay is one important aspect of a compelling Total Rewards package. The base pay range indicated here does not include any additional benefits or bonuses that you may be eligible for based on your role and/or employment type.\n\nRegular full-time employees are eligible for benefits - see here.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "GenAI Data Scientist",
    "company": "Qode",
    "jobLocation": "Dallas, TX 75201",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b9871fd999f920b1",
    "salary": "Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Job Title: GenAI Data Scientist Location: Dallas, TX or New Jersey or Tampa, FLJob Summary: We are looking for a Data Scientist with a passion for Generative AI to support AI/ML model development and data-driven innovation. The role focuses on applying Python and SQL skills to prepare data, build prototypes, and contribute to AI-powered solutions.Must-Have Skills: • Proficiency in Python (Pandas, NumPy, Scikit-learn, etc.).\n\nStrong knowledge of SQL for querying and data manipulation.\nSolid understanding of statistics and data analysis techniques.\nAbility to work with large datasets and troubleshoot data quality issues.\nEducation & Experience: · Bachelor’s degree or Master’s Degree in Computer Science, Data Science, or related field.· 0–5 years of experience (academic projects or internships in AI/ML are a plus).",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "n/a",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.\n\nTurnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.\n\nTurnitin, LLC is an equal opportunity employer- vets/disabled.\n\n\nJob Description\n\n\nMachine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products.\n\nWe are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.\n\nResponsibilities and Requirements:\n\nWe expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).\n\nDay-to-day, your responsibilities are to:\n\nWork with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.\nWork with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.\nAnswer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.\nDevelop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.\nUtilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.\nStay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.\nOptimize models for scaled production usage.\nCommunicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.\nWrite clean, efficient, and modular code, with automated tests and appropriate documentation.\nStay up to date with technology, make good technological choices, and be able to explain them to the organization.\n\nQualifications\n\n\nRequired Qualifications:\n\nExperience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.\nA strong understanding of the math and theory behind machine learning and deep learning.\nSoftware engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).\nMachine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).\nAn understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.\nMaster's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.\nExcellent communication and teamwork skills.\nFluent in written and spoken English.\n\nWould be a plus:\n\nFamiliarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.\nEssential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).\nFamiliarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.\nExperience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).\nShowcase previous work (e.g. via a website, presentation, open source code).\n\nAdditional Information\n\n\nThe expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.\n\nAs a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.\n\nTotal Rewards @ Turnitin\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.\n\nOur Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.\n\nOur Values underpin everything we do.\n\nCustomer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.\nPassion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.\nIntegrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.\nAction & Ownership - We have a bias toward action and empower teammates to make decisions.\nOne Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.\nGlobal Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.\n\nGlobal Benefits\n\nRemote First Culture\nHealth Care Coverage*\nEducation Reimbursement*\nCompetitive Paid Time Off\n4 Self-Care Days per year\nNational Holidays*\n2 Founder Days + Juneteenth Observed\nPaid Volunteer Time*\nCharitable contribution match*\nMonthly Wellness or Home Office Reimbursement*\nAccess to Modern Health (mental health platform)\nParental Leave*\nRetirement Plan with match/contribution*\nvaries by country\n\nSeeing Beyond the Job Ad\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!\n\nTurnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist - Applied Research (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fa7309553094efc6",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "n/a",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.\n\nTurnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.\n\nTurnitin, LLC is an equal opportunity employer- vets/disabled.\n\n\nJob Description\n\n\nMachine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products.\n\nWe are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.\n\nResponsibilities and Requirements\n\nWe’re an applied science group leaning towards modern Deep Learning. We expect our Senior Machine Learning Scientists to have a well-balanced set of skills, both in the Science as well as Software Engineering aspects of (Deep) Machine Learning. You will focus on developing novel and deployable ML models and solutions where no ready-made solution may be available. Therefore you need to be conversant enough with the mathematics of machine learning and deep neural networks such that you can construct novel model architectures, loss functions, training methods, training loops etc. You are also expected to keep abreast of the latest research advancements in AI and Deep Learning across modalities and apply those to your work. While we leverage ready-made training platforms, we also write our own training loops. Additionally, the models need to be directly deployable in our products, therefore, production level coding and software engineering proficiency is required. You may train large models (up to 100s of billions of parameters) therefore, ability to train on multiple GPUs and nodes and knowledge of the latest model training and inferencing advancements is necessary. Next, the models must perform well in production not only in terms of accuracy but also compute-cost. Delivering such software requires a sufficiently deep Computer Science background. Dataset exploration, generation (synthetic), design, construction and analysis, are a routine part of the job and may occupy a significant fraction of your time. Also, datasets can be large (billions of samples), therefore the ability to write parallel and efficient pipelines is a necessary skill. You will also be involved in code & model maintenance, code hardening (preparing the model and code for production pipelines), developing and staging demos and presenting your work within the company as well as via publications in peer reviewed venues (preferably A/A+ rated).\n\nDay-to-day, your responsibilities are to:\n\nResearch and develop production grade Machine Learning models as described above. Optimize models for scaled production usage.\nWork with colleagues in the AI team, other Engineering teams, subject matter experts, Product Management, Marketing, Sales and Customer support to explore ongoing product issues, challenges and opportunities and then recommend innovative ML/AI based solutions.\nHelp out with ad-hoc one-off tasks as a team player within the AI team.\nWork with subject matter experts to curate and generate optimal datasets following responsible data collection and model maintenance practices. Explore and access SQL, no-SQL and web data and write efficient parallel pipelines. Review and design datasets to ensure data quality.\nInvestigate weaknesses of models in production and work on pragmatic solutions.\nUtilize, adopt, and fine-tune off the shelf models, including LLMs exposed via API (through prompt engineering and agents) and locally hosting LMs and other foundation models.\nStay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.\nWrite clean, efficient, and modular code with automated tests and appropriate documentation.\nStay up to date with technology and platforms, make good technological choices, and be able to explain them to the organization.\nWork with downstream teams to productionize your work and ensure that it makes into a product release.\nCommunicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.\nPresent and publish your work.\n\nQualifications\n\n\nRequired Qualifications:\n\nMaster's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field or outstanding previous achievements demonstrating excellence in Deep Machine Learning, Computer Science and Software Engineering.\nAt least 5 years of industry experience in Machine / Deep Learning (we use the python ecosystem for ML), Computer Science and Software Engineering.\nA strong understanding of the math and theory behind machine learning and deep learning is a prerequisite.\nAcademic publications in peer reviewed conferences or journals related to Machine Learning - preferably A/A+ rated such as NeurIPS, ICML, ICLR, AAAI, TMLR, JMLR, IJCAI, ICANN, KDD, ACL, EMNLP, NAACL, COLING, CVPR, ICCV, ECCV, IEEE etc.\nMachine / Deep Learning development skills, including popular platforms (we use AWS SageMaker, Hugging Face, Transformers, PyTorch, PyTorch Lightning, Ray, scikit-learn, Jupyter, Weights & Biases etc.).\nAn understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.\nExcellent communication and teamwork skills.\nFluent in written and spoken English.\n\nWould be a plus:\n\nWe’re an applied science group, therefore Software development proficiency is a requirement. Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.\nA Computer Science educational background is preferred as opposed to statistics or pure mathematics.\nFamiliarity in building front-ends (Gradio, Streamlit, Dash or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.\nExperience with advanced prompting / agentic-systems and fine-tuning or training an LLM, using industry accepted platforms.\nShowcase previous work (e.g. via a website, presentation, open source code).\nFamiliarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.\nEssential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).\n\nAdditional Information\n\n\nThe expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.\n\nAs a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.\n\nTotal Rewards @ Turnitin\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.\n\nOur Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.\n\nOur Values underpin everything we do.\n\nCustomer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.\nPassion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.\nIntegrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.\nAction & Ownership - We have a bias toward action and empower teammates to make decisions.\nOne Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.\nGlobal Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.\n\nGlobal Benefits\n\nRemote First Culture\nHealth Care Coverage*\nEducation Reimbursement*\nCompetitive Paid Time Off\n4 Self-Care Days per year\nNational Holidays*\n2 Founder Days + Juneteenth Observed\nPaid Volunteer Time*\nCharitable contribution match*\nMonthly Wellness or Home Office Reimbursement*\nAccess to Modern Health (mental health platform)\nParental Leave*\nRetirement Plan with match/contribution*\nvaries by country\n\nSeeing Beyond the Job Ad\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!\n\nTurnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789b20dee7d0ba72",
    "salary": "$56.02 - $67.47 an hour - Contract",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "POSITION SUMMARY\n\n· We’re looking for a Data Scientist who can be responsible for designing, building and maintaining document capture applications. The ideal candidate will have a solid background in software engineering with experience in building Machine Learning NLP Models and good familiarity with Gen AI Models.\n\nEDUCATION\n\n· Provide Bachelor's degree information\n\n· Education should always have at the least: Degree, Major, University Name, Date of Graduation\n\nPrimary Skill\n\n· Data Scientist\n\nSecondary Skill\n\n· Artificial Intelligence/Machine Learning\n\nREQUIREMENT SKILLS / EXPERIENCE\n\n· 7+ years of experience as Data Scientist or related roles\n\n· Bachelor’s degree in Computer Science, or a related technical field\n\n· Deep understanding and some exposure to new Gen AI Open-source Models\n\n· At least 5 years programming experience in software development and Agile process\n\n· At least 5 years Python (or equivalent) programming experience to work with ML/NLP models.\n\n· Experience in setting up supervised unsupervised learning ML/NLP models including data cleaning, data analytics, feature creation, model selection ensemble methods, performance metrics visualization\n\n· Experience in ML/NLP development pipelines of large data sets, both structured unstructured\n\n· At least 2 years’ experience in designing and developing enterprise-scale ML/NLP solutions in one or more of: Named Entity Recognition, Document Classification, Document Summarization, Topic Modelling, Dialog Systems, Sentiment Analysis, OCR text processing\n\n· Knowledge and hands-on experience working with OCR products\n\nDESIRED SKILLS / EXPERIENCE\n\n· Master’s degree in Computer Science/Data Science, or a related technical field\n\n· Collaborating with a diverse set of partners and stakeholders from various Line of Business.\n\n· Highly motivated, proactive and a self-starter; strong sense of ownership ability to create and execute plans without daily oversight\n\n· Critical thinker; ability to analyze problems and identify issues and provide solutions\n\n· Ability to navigate the enterprise data assets across multiple functions.\n\n· Highly organized. Effectively prioritizes and balances multiple efforts in a fast-paced environment\n\n· Excellent communication and Presentation skills\n\n· Analytical abilities great problem solving\n\n· Client focused\n\nJob Type: Contract\n\nPay: $56.02 - $67.47 per hour\n\nWork Location: In person",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;",
    "qualifications": "n/a",
    "description": "Benefits:\n\nHYBRID\nCompetitive salary\nOpportunity for advancement\nTraining & development\n\nJob Title: Data Scientist – Integrated Operations\nLocation: Dallas, TX (Hybrid Remote)\nIn-Person Interview\nMust be authorized to work in the U.S\n\nWork Arrangement\n\nHybrid work model: primarily remote within the Dallas–Fort Worth area.\nOccasional on-site presence required for meetings, training, or business needs.\nLimited business travel may be required.\n\nRoles & Responsibilities\n. 6+ years of experience in Machine Learning and Data Science.\n\nStrong understanding of Generative AI, Retrieval Augmented Generation, Agentic Workflow, Statistical methods, data structures, and algorithms.\nStrong programming skills in Python; experience with Machine Learning libraries and Generative AI frameworks (e.g., Pandas, NumPy, Matplotlib, Seaborn, TensorFlow, PyTorch, scikit-learn, LangChain) and LLMs.\nExperience developing and deploying AI solutions on cloud platforms (e.g., AWS, Azure, or GCP).\nExperience in building Asynchronous Python APIs.\nExperience with data visualization tools such as Matplotlib, Seaborn, or Tableau.\nFamiliarity with cloud platforms such as AWS, Azure, or Google Cloud for deploying AI solutions.\nProven experience in developing and deploying machine learning models in a production environment.\nExperience working with large datasets and performing data analysis\n\nRequired Qualifications\n\nEducation\n\nBachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.\n\nExperience\n\nAdvanced experience in data science, machine learning, AI, or optimization projects.\nProficiency in Python and SQL.\nStrong understanding of statistical methods, experimental design, and model validation.\nExperience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).\nFamiliarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).\n\nPreferred Experience\n\nExperience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).\nExposure to specialized analytics areas such as simulation, graph analytics, or video analytics.\n\nSkills & Abilities\n\nAbility to independently manage and deliver on complex projects.\nStrong problem-solving and critical thinking skills.\nEffective communication skills for both technical and executive audiences.\nAbility to adapt quickly to changing priorities and new technologies.\nStrong interpersonal and collaboration skills.\n\n.....",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Agentic AI Engineer",
    "company": "Onpoint Healthcare Partners Inc",
    "jobLocation": "Irving, TX 75062 \n(Las Colinas Urban Center area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=e929bd8b4c58bfcb",
    "salary": "$105,000 - $115,000 a year - Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Location: US\n\nDepartment: Information Technology\n\nReports To: SVP of Information Technology\n\nPosition Overview\n\nWe are seeking a forward-thinking Agentic AI Engineer to lead the design and development of intelligent agent workflows and autonomous systems. This role is central to our efforts in building scalable, context-aware AI agents that operate across multi-agent environments. The ideal candidate will possess deep technical expertise in cloud-native development, AI orchestration, and prompt engineering, with a strong foundation in C#, Terraform, Azure Function Apps, and Azure ML Studio.\n\nKey Responsibilities\n\nArchitect and implement agentic AI systems that support autonomous decision-making and collaboration across multiple agents.\nDevelop and optimize context-aware workflows using advanced context engineering techniques.\nDesign and refine prompts for AI agents to ensure accurate, efficient, and safe task execution.\nBuild and maintain Azure Function Apps to support agent orchestration and event-driven processing.\nIntegrate and manage AI models using Azure ML Studio for real-time inference and learning.\nUse Terraform to provision and manage scalable infrastructure for agentic systems.\nCollaborate with cross-functional teams to identify automation opportunities and translate them into agentic solutions.\nMonitor, evaluate, and improve agent performance and inter-agent communication.\nDocument architecture, workflows, and engineering decisions for internal knowledge sharing.\n\nRequired Qualifications\n\nBachelor’s or Master’s degree in Computer Science, Engineering, or related field.\nStrong proficiency in C# and .NET development.\nHands-on experience with Terraform and infrastructure-as-code practices.\nProven experience with Azure Function Apps and Azure ML Studio.\nSolid understanding of agentic AI principles, including multi-agent coordination and autonomous behavior.\nExperience with context engineering and prompt design for AI systems.\nExcellent analytical, problem-solving, and communication skills.\nExperience with Microsoft 365, including Outlook, Word, Excel, Teams, and PowerPoint.\nEligible to work in the U.S. without relying solely on a student visa or a visa sponsored by a third-party employer.\n\nPreferred Qualifications\n\nExperience with reinforcement learning, AI planning, or distributed agent systems.\nFamiliarity with LLM-based agent frameworks and orchestration tools.\nKnowledge of DevOps practices and CI/CD pipelines in Azure.\nBackground in data engineering or real-time data processing.\n\n\nCore Competencies:\n\nFlexible, Detail Oriented, Customer Focus, Team Working, Initiative, Problem Solving, Organized, Self-Motivated\n\n\nGeneral:\n\nAdopt the OnPoint culture of respect, integrity, and accountability that contributes to an internal environment of teamwork and promotes a positive brand image to our external customers.\nIncorporate a data-centric leadership mindset to your role.\nComply with OnPoint procedures, policies, and regulations relevant to your role.\nSuccessfully completes all OnPoint training requirements (i.e. HIPAA, compliance, etc.)\nResponsible for compliance with all regulatory requirements and/or guidelines. These requirements/guidelines include, but are not limited to: HIPAA, Federal Fraud and Abuse laws.\nAble to communicate effectively with others, both verbally and in writing.\nProven ability to manage time, meet deadlines and prioritize.\nAble to maintain standards and professionalism during periods of fluctuating workloads.\nProvide professional service to direct customers and vendors/delivery partners of OnPoint in all interactions.\nBuild effective working relationships with other team members.\nManage daily tasks to ensure business needs are consistently met.\nExcellent communication and customer service skills.\nAble to work independently and as part of a team.\nAble to handle multiple tasks and prioritize work effectively.\n\n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this job, the employee is regularly required to speak, hear, read, and type. This is largely a sedentary role; however, some shipping may be required. This position requires the ability to occasionally lift office products and supplies up to 40 pounds.\n\n\nWork Environment:\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill and/or ability required.\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time, with or without notice.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Decision Science Analyst",
    "company": "Kobie Marketing",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=71b38a52461f949c",
    "salary": "Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Join a National Top Workplace\nNamed a Top Workplace in the USA and Top Remote Workplace, Kobie is where the best minds in loyalty come together, driven by passion and innovation. We’re always looking for talented individuals who are ready to join a collaborative, growth-focused culture. As a partner to some of the world’s most recognized brands, we are leaders in loyalty, helping brands build lasting emotional connections with their consumers.\nJoin Us from Anywhere\nWhile our headquarters are nestled in sunny St. Petersburg, Florida, Kobie embraces a flexible work environment, offering teammates the freedom to work remotely. We understand the importance of work-life balance and support our team with:\n\nFlexible Time Off to recharge when needed\nNine Company-Wide Holidays\nA diverse suite of benefits prioritizing your growth, development, and personal well-being\n\nDiscover more about our perks and benefits here.\nKobie is a values-led organization where we believe that everyone is a leader, regardless of their position or role.\n\nAbout the team and what we’ll build together\n\n\n\nWe find actionable insights in our clients’ loyalty data that help drive enterprise value. We create real time dashboards to inform internal and external stakeholders. You'll bring your experience with a breadth of marketing techniques, an ease of working with customer data, and an understanding of advanced mathematics and statistical techniques. This position is a client-facing, hands-on role that is responsible for helping shape our clients’ strategic direction for their loyalty initiatives.\nHow you will make an impact\nPlay a key role as part of a team responsible for delivering data-driven, actionable customer insights that directly contribute to increased sales/profit through our clients’ customer loyalty programs, while collaborating closely with Strategy and Client Services teams to align on client objectives and deliver impactful results.\nBuild and maintain audience lists to support the CRM team in executing targeted campaigns and achieving engagement goals.\nProvide actionable recommendations that drive business objectives by drawing out key insights from in-depth, complex data sources based on a thorough understanding of client’s strategy, success criteria, and program objectives\nDevelop data visualizations and narratives that make data and analysis consumable by all levels and expertise of internal and external stakeholders\nCollaborate with Data Engineering and Business Intelligence teams to design and develop new tools, models, and data sources to support our clients’ business objectives and overcome challenges\nProactively create learning agendas, test plans, and solutions that make attribution unassailable and maximize key KPIs such as incremental ROI and LTV\nManage workflow, scope and prioritization of client requests and Kobie investments\nWhat you need to be successful\n2-4+ years previous relevant customer analytics and/or marketing/CRM experience\nGreat storyteller with data that can influence senior stakeholders with insights and recommendations\nFamiliarity with data exploration and data visualization tools like Tableau, PowerBI , or Sigma\nDemonstrated success using customer segmentation techniques such as RFM, cluster analysis and regression modeling to drive targeted marketing\nSolid project management skills and experience in juggling multiple projects at a time\nBachelor’s Degree in Statistics, Marketing, Economics, or Computer Science\nPython/SQL programming experience preferred\nMaster’s in Statistics, Economics or Applied Mathematics, or MBA, preferred\nProficiency in fundamental marketing and loyalty principles, preferred\nWho we are As a trusted partner, Kobie delivers market-leading, end-to-end loyalty solutions designed to enable customer experiences for the world's most successful brands. We do this with a strategy-led technology approach that uncovers the truth behind what drives consumers on an emotional level. We believe that our team's passion and expertise are the driving forces behind our success and are proud to be named a Top Workplaces in the USA, where the best and brightest in loyalty drive our mission of growing enterprise value through loyalty.\nA place for all We celebrate and embrace diversity at Kobie!\nEmployment at Kobie is based solely on an individual's merit and qualifications, which are directly related to professional competence. We do not discriminate against any teammate or applicant because of race,color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy, or any other characteristic protected by applicable law.\nWe are fiercely committed to fostering a workplace where teammates can bring their authentic selves to work every day. Our DEI initiatives, including various committees, ensure that principles of equity, diversity, and inclusion are deeply ingrained throughout Kobie. While our leadership team fully supports our policy of nondiscrimination and equal opportunity, it is the responsibility of all teammates to uphold these values.\nReady to join us? If you’re ready to make an impact and grow in a supportive, innovative environment, we’d love to hear from you. Apply today and join the best and brightest in loyalty!",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Decision Science Analyst",
    "company": "Kobie Marketing",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=890abcdef0123456",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "n/a",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Data Science Subject Matter Experts",
    "company": "Zion Zest LLC",
    "jobLocation": "Dallas, TX 75244",
    "jobUrl": "https://www.indeed.com/viewjob?jk=34f39dba2736a427",
    "salary": "n/a",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "n/a",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Machine Learning Engineer",
    "company": "Tiger Analytics",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=e8b61f5ad64f8bbf",
    "salary": "Full-time",
    "benefits": "n/a",
    "qualifications": "n/a",
    "description": "Tiger Analytics is an advanced analytics consulting firm. We are the trusted analytics partner for several Fortune 100 companies, enabling them to generate business value from data. Our consultants bring deep expertise in Data Science, Machine Learning, and AI. Our business value and leadership have been recognized by various market research firms, including Forrester and Gartner.\n\nAre you a Machine Learning Engineer with expertise in Google Cloud Platform (GCP) and Vertex AI? We are looking for two talented professionals to join our team in a fully remote, onshore capacity. If you thrive in building and deploying scalable AI solutions, this role is for you!\n\nWhat You'll Do:\n\n\n\nCollaborate with cross-functional teams to design and deploy ML models.\n\nDevelop reusable, scalable code for AI/ML applications.\n\nLeverage GCP services to build end-to-end machine learning pipelines.\n\nOptimize models for performance and scalability using Vertex AI.\n\nRequirements\n\nKey Requirements:\n\n\n\nGoogle Cloud Platform (GCP) Experience: Strong proficiency in GCP services, including data engineering and machine learning tools.\n\nGoogle Vertex AI Expertise: Hands-on experience with model training, deployment, and optimization using Vertex AI.\n\nModel Development & Deployment: Proven ability to design, build, and productionize machine learning models.\n\nAPI Development: Skilled in developing robust APIs for seamless integrations.\n\nPython Programming with CI/CD: Experience in Python-based applications and implementing CI/CD pipelines.\n\n\nWhy Join Us?\n\n\n\nWork remotely while contributing to cutting-edge projects.\n\nCollaborate with a dynamic team passionate about AI/ML innovation.\n\nOpportunity to work with the latest Google Cloud technologies.\n\nReady to take the next step? Apply now and be part of a team that’s shaping the future of AI!\n\nBenefits\n\nSignificant career development opportunities exist as the company grows. The position offers a unique opportunity to be part of a small, fast-growing, challenging and entrepreneurial environment, with a high degree of individual responsibility.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "AI GTM Analyst",
    "company": "Karbon",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4434e4117c77b9c6",
    "salary": "$100,000 - $130,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nWork from home stipend\nPaid parental leave\nParental leave\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\nShow more\n&nbsp;",
    "qualifications": "n/a",
    "description": "About Karbon\n\nKarbon is the global leader in practice management software for growth-minded accounting firms. We provide an award-winning, highly collaborative cloud platform that streamlines work and communication, enabling the average accounting firm using Karbon to save 18.5 hours per week, per employee.\n\nWe have customers in 34 countries and have grown into a globally distributed team, with our people based throughout the US, Australia, New Zealand, Canada, the United Kingdom, and the Philippines. We are well-funded, ranked #1 on G2, have a fantastic team culture built on our values, are growing rapidly, and making a global impact.\n\nWe are seeking an AI and LLM-powered GTM Analyst/Lead to transform our go-to-market operations by applying advanced AI techniques to uncover and optimize the biggest revenue levers across inbound, outbound, and CSQL channels. This role prioritizes AI-driven analysis of conversion ratios, improving one key metric at a time to compound gains across the funnel. Through LLM-powered time studies and predictive modeling, this role will reveal how GTM teams allocate time, what activities drive customer health, and where AI automation can accelerate pipeline performance. This is initially a 6-month full-time position.\n\nKey Responsibilities\n\n1. AI-Driven Funnel Analysis & Lever Optimization (Primary Focus)\n\nUse AI-powered data analysis and LLM-enhanced dashboards to identify the most impactful conversion levers across inbound, outbound, and CSQL funnels.\n\nDevelop and test LLM-informed hypotheses to improve one ratio at a time (e.g., lead-to-opportunity or win rates).\n\nCollaborate with GTM and RevOps teams to operationalize AI-generated insights for measurable improvements.\n\n2. LLM-Powered Time Studies (Primary Focus)\n\nDeploy AI models and LLMs to analyze rep activity and time-to-serve by customer segment (e.g., <1-year vs. 1-year+ healthy accounts).\n\nIdentify repetitive or low-value tasks for automation using AI agents to improve efficiency and focus on high-value activities.\n\n3. Predictive Signal Layer Creation (Secondary Focus)\n\nUnify CRM, call, email, product usage, and enrichment data into an AI-driven predictive signal layer that surfaces intent, fit, and timing.\n\nTrain LLM-based scoring models to enhance account prioritization and sales targeting.\n\n4. Insight Automation with LLMs (Secondary Focus)\n\nUse LLMs and embeddings to turn Gong calls, notes, and emails into structured AI-extracted insights.\n\nAutomate AI-generated summaries of objections, next-best actions, and risk signals for pipeline forecasting.\n\n5. AI-Enabled Playbooks & Dynamic Collateral (Tertiary Focus)\n\nDeploy AI and LLM tools to automatically generate personalized collateral (emails, decks, and messaging) tailored to prospect profiles.\n\nImplement AI-driven workflows for prospecting, reactivation, and qualification in platforms like HubSpot and Clay.\n\nQualifications\n\nHands-on experience with AI, LLMs, and vector embeddings, including tools like OpenAI API, LangChain, or similar frameworks.\n\nProven ability to design, implement, and optimize AI workflows for GTM teams, including predictive modeling and automated insights.\n\nStrong understanding of data pipelines and unstructured data analysis (e.g., Gong call transcripts, email content) using LLM-based techniques.\n\nExpertise in applying LLMs for summarization, insight extraction, and next-best action recommendations within GTM contexts.\n\nFamiliarity with AI-powered automation platforms (e.g., HubSpot AI, Clay, or custom GPT-based agents).\n\nDeep knowledge of GTM tech stacks (e.g., Salesforce, Gong, HubSpot, Outreach) and experience leveraging AI integrations to extract maximum value from these tools.\n\nSolid grounding in GTM funnel metrics and the ability to apply AI analytics to improve conversion ratios sequentially.\n\nProficiency in SQL or Python for data manipulation and AI model integration is plus.\n\nWhy Work at Karbon\n\nGain global experience across the USA, Australia, New Zealand, UK, Canada and the Philippines\n\nExcellent benefits package including:\n\nPaid Flexible Time Off with an encouraged 3 weeks use per year\n\nCompany paid medical for you and eligible spouse/partner and dependents\n\nCompany paid dental and vision and eligible spouse/partner and dependents\n\nFully company funded short and long term disability\n\nFully company paid life insurance\n\n401(k) with company matching\n\nFlexible Spending Account\n\nUp to 8 weeks paid parental leave\n\nWork-from-home stipend\n\nWork with (and learn from) an experienced, high-performing team\n\nA collaborative, team-oriented culture that embraces diversity, invests in development and provides consistent feedback\n\nBe part of a fast-growing company that firmly believes in promoting high performers from within\n\nKarbon embraces diversity and inclusion, aligning with our values as a business. Research has shown that women and underrepresented groups are less likely to apply to jobs unless they meet every single criteria. If you've made it this far in the job description but your past experience doesn't perfectly align, we do encourage you to still apply. You could still be the right person for the role!\n\nWe recruit and reward people based on capability and performance. We don't discriminate based on race, gender, sexual orientation, gender identity or expression, lifestyle, age, educational background, national origin, religion, physical or cognitive ability, and other diversity dimensions that may hinder inclusion in the organization.\n\nGenerally, if you are a good person, we want to talk to you.\n\nIf there are any adjustments or accommodations that we can make to assist you during the recruitment process, and your journey at Karbon, contact us at people.support@karbonhq.com for a confidential discussion.\n\n\n\n\nAt this time, we request that agency referrals are not submitted for this position. We appreciate your understanding and encourage direct applications from interested candidates. Thank you!",
    "preferences": "n/a",
    "mission_statement": "n/a"
  },
  {
    "jobTitle": "Sr. Data Analyst",
    "company": "Group O",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=61bf97539391f49b",
    "salary": "$70,000 - $90,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\nFlexible spending account\nLife insurance\nShow more\n&nbsp;",
    "qualifications": "n/a",
    "description": "Description\n\nThe Sr. Data Analyst will be responsible for collecting, processing, and analyzing large sets of data to provide actionable insights that drive business decisions and strategies. This role requires an initiative-taking individual who can effectively communicate complex data findings to non-technical stakeholders.\n\nThe ideal candidate for the Senior Data Analyst position is a meticulous and analytical professional proficient in SQL, Python, R, and data visualization tools like Tableau or Power BI. They possess strong critical thinking skills, excellent communication abilities, and can effectively collaborate with cross-functional teams. Location is Dallas, TX.\n\nKey Responsibilities\n\nEssential Functions:\nWrite SQL queries in a Azure Synapse and Snowflake Environment.\nUtilize Microsoft Access including data import/export, query building, information extraction, and mechanization.\nCollect, clean, and validate data from various sources to ensure accuracy and completeness.\nAnalyze data to identify trends, patterns, and anomalies.\nDevelop and maintain dashboards and reports using data visualization tools such as Tableau, Power BI, or similar platforms.\nCollaborate with cross-functional teams to understand their data needs and provide relevant insights.\nUtilize statistical techniques to perform hypothesis testing, regression analysis, and predictive modeling.\nCommunicate findings and insights through clear and concise reports and presentations.\nMonitor key performance indicators (KPIs) and metrics to track business performance and identify areas for improvement.\nAssist in the development and implementation of data collection systems and strategies to optimize efficiency and quality.\nStay updated with industry trends and best practices in data analysis and visualization.\nResponsible for collecting, analyzing, and interpreting complex datasets to extract actionable insights and guide critical business decisions.\nLead projects, mentoring junior analysts, and applying advanced statistical methods to solve complex problems.\n\n\nJob Qualifications\n\nEducation/Certifications:\nBachelor’s degree in Statistics, Mathematics, Computer Science, Economics, or a related field.\nExperience:\nProven experience as a Data Analyst or in a similar role.\nExpert knowledge of complex databases: i.e., Azure Synapse and Snowflake accessing customers, products, orders, etc.\nExpert knowledge of Excel Graphs, Charts, Pivot Tables, Power Point, etc.\nSkills and Qualifications:\nAbility to write SQL queries in a large database environment. Must be a strong SQL Coder with Data Mining Skills (Understands complex coding processes, i.e., Joins, Aggregating Data, Building Temp Tables, Formatting Data, and Import & Export Processes).\nProficiency with ETL (Extract, Transfer & Load) processing.\nStrong knowledge of data visualization tools (e.g., Tableau, Power BI).\nExcellent analytical and critical thinking skills.\nAbility to interpret and present complex data in a clear and concise manner.\nStrong mindfulness and accuracy.\nEffective communication and collaboration skills.\nAbility to work independently and manage multiple tasks simultaneously.\nPreferred: Experience using UNIX, Fast Load, Fast Export, encryption software a plus; as well as experience/knowledge in the Telecommunication industry.\nRequirements:\nExceptional problem-solving skills, critical thinking, and a strong understanding of how to leverage AI tools like Copilot and ChatGPT to enhance productivity and drive innovation.\nWith a background in Statistics, Mathematics, Computer Science, or Economics, they stay updated with industry trends and demonstrate high ethical standards in handling data.\nThey are initiative-taking, adaptable, and capable of aligning data insights with business goals to drive informed decision-making.\nLocation is Dallas, TX.\nPhysical Requirements : N/A\n\nBenefits\n\n\nMedical, Dental, Vision, and Life Insurance\nFlexible Spending Accounts (Medical and Dependent Care)\n401(k) Plan with Company Match\nGenerous Paid Time Off\n10.5 Paid Holidays\nCareer Development Opportunities\n\n\nAbout Group O\nAt Group O, it’s our employees who we value most. That’s why we provide a supportive environment where employees are given every opportunity to excel. Group O offers a wide variety of careers with room for professional growth and advancement, and we are always looking for motivated individuals to join our team. At Group O, our employees’ health and well-being is equally as important as the work they perform. We back up that philosophy by providing a competitive benefits package that supports now and for their future.\n\nIn 1974, Bob Ontiveros saw an opportunity to live the American dream and build a company for himself and his family. 50 years later, the packaging company he originally founded out of the back of his station wagon - Group O is ranked by the United States Hispanic Chamber of Commerce as one of the top five Latino-owned businesses in the country. Group O has gained prestige for helping Fortune 500 companies like Samsung, Michelin, Caterpillar, and PepsiCo turn their most complex business challenges into centers of profitability and efficiency. Headquartered in Milan, IL, Group O employs over 1,200 employees.\n\n\nGroup O is committed to providing equal employment opportunities to all employees and applicants for employment. We prohibit discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, and sexual orientation. If you require accommodations to participate in the job application process, please contact recruiting@groupo.com, we will work with you to meet your needs. Information provided by applicants will be treated with the utmost confidentiality. We respect your privacy and will handle your application data in accordance with our privacy policy.",
    "preferences": "n/a",
    "mission_statement": "n/a"
  }
]