[
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "Responsibilities and Requirements:; We expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).; Day-to-day, your responsibilities are to:; Work with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.; Work with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.; Answer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.; Develop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.; Utilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.; Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.; Optimize models for scaled production usage.; Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.; Write clean, efficient, and modular code, with automated tests and appropriate documentation.; Stay up to date with technology, make good technological choices, and be able to explain them to the organization.; Qualifications; Required Qualifications:; Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.; A strong understanding of the math and theory behind machine learning and deep learning.; Software engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).; Machine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).; An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.; Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.; Excellent communication and teamwork skills.; Fluent in written and spoken English.; Would be a plus:; Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.; Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).; Familiarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.; Experience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).; Showcase previous work (e.g. via a website, presentation, open source code).; Additional Information; The expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.; As a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.; Total Rewards @ Turnitin; Turnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.; Our Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.; Our Values underpin everything we do.; Customer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.; Passion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.; Integrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.; Action & Ownership - We have a bias toward action and empower teammates to make decisions.; One Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.; Global Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.; Global Benefits; Remote First Culture; Health Care Coverage*; Education Reimbursement*; Competitive Paid Time Off; 4 Self-Care Days per year; National Holidays*; 2 Founder Days + Juneteenth Observed; Paid Volunteer Time*; Charitable contribution match*; Monthly Wellness or Home Office Reimbursement*; Access to Modern Health (mental health platform); Parental Leave*; Retirement Plan with match/contribution*; varies by country; Seeing Beyond the Job Ad; At Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!; Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric c...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789b20dee7d0ba72",
    "salary": "$56.02 - $67.47 an hour - Contract",
    "benefits": "Not specified",
    "qualifications": "Primary Skill; · Data Scientist; Secondary Skill; · Artificial Intelligence/Machine Learning; REQUIREMENT SKILLS / EXPERIENCE; · 7+ years of experience as Data Scientist or related roles; · Bachelor’s degree in Computer Science, or a related technical field; · Deep understanding and some exposure to new Gen AI Open-source Models; · At least 5 years programming experience in software development and Agile process; · At least 5 years Python (or equivalent) programming experience to work with ML/NLP models.; · Experience in setting up supervised unsupervised learning ML/NLP models including data cleaning, data analytics, feature creation, model selection ensemble methods, performance metrics visualization; · Experience in ML/NLP development pipelines of large data sets, both structured unstructured; · At least 2 years’ experience in designing and developing enterprise-scale ML/NLP solutions in one or more of: Named Entity Recognition, Document Classification, Document Summarization, Topic Modelling, Dialog Systems, Sentiment Analysis, OCR text processing; · Knowledge and hands-on experience working with OCR products; DESIRED SKILLS / EXPERIENCE; · Master’s degree in Computer Science/Data Science, or a related technical field; · Collaborating with a diverse set of partners and stakeholders from various Line of Business.; · Highly motivated, proactive and a self-starter; strong sense of ownership ability to create and execute plans without daily oversight; · Critical thinker; ability to analyze problems and identify issues and provide solutions; · Ability to navigate the enterprise data assets across multiple functions.; · Highly organized. Effectively prioritizes and balances multiple efforts in a fast-paced environment; · Excellent communication and Presentation skills; · Analytical abilities great problem solving; · Client focused; Job Type: Contract; Pay: $56.02 - $67.47 per hour; Work Location: In person",
    "description": "POSITION SUMMARY\n\n· We’re looking for a Data Scientist who can be responsible for designing, building and maintaining document capture applications. The ideal candidate will have a solid background in software engineering with experience in building Machine Learning NLP Models and good familiarity with Gen AI Models.\n\nEDUCATION\n\n· Provide Bachelor's degree information\n\n· Education should always have at the least: Degree, Major, University Name, Date of Graduation\n\nPrimary Skill\n\n· Data Scientist...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Science Subject Matter Experts",
    "company": "Zion Zest LLC",
    "jobLocation": "Dallas, TX 75244",
    "jobUrl": "https://www.indeed.com/viewjob?jk=34f39dba2736a427",
    "salary": "$180,000 - $250,000 a year - Full-time, Contract",
    "benefits": "Benefits\nPulled from the full job description\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "We are seeking a skilled and motivated Data Scientist to join our dynamic team. In this role, you will leverage your expertise in data analytics, machine learning, and statistical modeling to extract valuable insights from complex datasets. You will work collaboratively with cross-functional teams to drive data-driven decision-making and contribute to innovative projects that enhance our business strategies.; Responsibilities; SME Expertise: Seek out an SME with in-depth knowledge of data science concepts (e.g., machine learning, statistical modeling, programming languages like Python or R) and practical experience in applying these within a business context.; Passion for Teaching: The SME should be passionate about teaching and able to simplify complex concepts for different learning levels within the organization.; Customized Content: Develop a customized curriculum that addresses identified skill gaps, and includes relevant tools and platforms used within your company.; To effectively train employees in data science, especially within a corporate context, consider using a data science subject matter expert (SME) to guide the training program.; Analyze large datasets to identify trends, patterns, and anomalies that can inform business decisions.; Develop and implement machine learning models and algorithms to solve complex problems.; Utilize advanced analytics techniques including data mining and predictive modeling to enhance operational efficiency.; Collaborate with stakeholders to understand their data needs and provide actionable insights.; Create visualizations and reports that effectively communicate findings to both technical and non-technical audiences.; Maintain and optimize existing data pipelines and workflows using tools such as SQL, Hadoop, or SAS.; Stay current with industry trends in AI and machine learning frameworks to continuously improve methodologies.; Qualifications; Train junior Data Science Engineers and help them with programming.; Proficiency in programming languages such as C and VBA for data manipulation and analysis.; Strong knowledge of SQL for database querying and management.; Experience with linked data concepts and analytics tools.; Familiarity with machine learning frameworks (e.g., TensorFlow, PyTorch) is a plus.; Demonstrated ability in data mining techniques for extracting insights from large datasets.; Excellent problem-solving skills with a keen analytical mindset.; Strong communication skills, both written and verbal, for effective collaboration across teams.; A degree in Data Science, Computer Science, Statistics, or a related field is preferred.; Join us in harnessing the power of data to drive innovation and success!; Job Types: Full-time, Contract; Pay: $180,000.00 - $250,000.00 per year; Benefits:; 401(k); 401(k) matching; Dental insurance; Health insurance; Paid time off; Vision insurance; Work Location: In person",
    "description": "Overview\nWe are seeking a skilled and motivated Data Scientist to join our dynamic team. In this role, you will leverage your expertise in data analytics, machine learning, and statistical modeling to extract valuable insights from complex datasets. You will work collaboratively with cross-functional teams to drive data-driven decision-making and contribute to innovative projects that enhance our business strategies.\n\nResponsibilities\n\nSME Expertise: Seek out an SME with in-depth knowledge of da...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Requirements:; Must Haves:; Strong quantitative skills; Preferred/ Nice-to-haves: (The below is not necessary for this position. These are the responsibilities of the new big data architect position we are hiring for); Additional Information; All your information will be kept confidential according to EEO guidelines.",
    "description": "Job Description\n\n\nJob Description:\n\nImportant Note: Candidates should have the following experience\n\nPOSITION SUMMARY –\n\nReason for contingent headcount?\n\nWorkload\n\nWhat is the project(s) name?\n\nWhat specific departments will they interact with?\n\nWhat phase is the project currently in?\n\nOngoing Support\n\nRequirements:\n\nMust Haves:\n\nStrong quantitative skills\n\nPreferred/ Nice-to-haves: (The below is not necessary for this position. These are the responsibilities of the new big data architect posit...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "AI/ML Engineer",
    "company": "Stemuli",
    "jobLocation": "Dallas, TX 75201 \n(Downtown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=e0c89a10578c2071",
    "salary": "$160,000 - $185,000 a year - Full-time",
    "benefits": "Not specified",
    "qualifications": "Design dynamic balancing systems that allow players to earn, invest, and scale virtual businesses tied to real-world skills.; Collaborate with game designers and Unity engineers to integrate AI models into the Founder Tycoon gameplay loop.; Apply LLM, reinforcement learning, and agent-based modeling to create lifelike NPC interactions and market dynamics.; Develop tools for data ingestion and analysis to measure student engagement, learning outcomes, and workforce readiness.; Partner with educators and researchers to ensure simulations align with career pathways and learning frameworks to drive measurable wage gains.; What We're Looking For; 3–5+ years of applied AI/ML engineering experience.; Strong skills in Python, machine learning frameworks (PyTorch, TensorFlow), and LLM fine-tuning.; Experience with simulation, reinforcement learning, or agent-based systems (e.g., multi-agent frameworks).; Comfort integrating AI into Unity-based game environments (working with C# engineers).; Data-driven mindset with experience in building analytics pipelines to measure impact.; Passion for building AI that unlocks human potential and transforms education.; What We Offer; Opportunity to pioneer AI-driven game economies and simulations for education.; Work closely with a multidisciplinary team of game designers, AI engineers, and educators to deliver a category-defining product.; $160K – $185K annual salary + meaningful equity.; Hybrid: Dallas & Seattle -based AI team with flexibility.; Comprehensive benefits package.",
    "description": "Company Overview\n\nStemuli is reimagining the future of learning by merging AI, video games, and workforce development. Backed by the Gates Foundation, Stride Learning, Heartland Forward, and leading venture capitalists, Stemuli is scaling its AI-powered video game platform across the U.S. (including a large-scale student rollout with the largest online school in the United States and a 20-state Heartland Forward initiative). Our platform equips students to learn math, master AI literacy, and bec...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist - Applied Research (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fa7309553094efc6",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "Responsibilities and Requirements; We’re an applied science group leaning towards modern Deep Learning. We expect our Senior Machine Learning Scientists to have a well-balanced set of skills, both in the Science as well as Software Engineering aspects of (Deep) Machine Learning. You will focus on developing novel and deployable ML models and solutions where no ready-made solution may be available. Therefore you need to be conversant enough with the mathematics of machine learning and deep neural networks such that you can construct novel model architectures, loss functions, training methods, training loops etc. You are also expected to keep abreast of the latest research advancements in AI and Deep Learning across modalities and apply those to your work. While we leverage ready-made training platforms, we also write our own training loops. Additionally, the models need to be directly deployable in our products, therefore, production level coding and software engineering proficiency is required. You may train large models (up to 100s of billions of parameters) therefore, ability to train on multiple GPUs and nodes and knowledge of the latest model training and inferencing advancements is necessary. Next, the models must perform well in production not only in terms of accuracy but also compute-cost. Delivering such software requires a sufficiently deep Computer Science background. Dataset exploration, generation (synthetic), design, construction and analysis, are a routine part of the job and may occupy a significant fraction of your time. Also, datasets can be large (billions of samples), therefore the ability to write parallel and efficient pipelines is a necessary skill. You will also be involved in code & model maintenance, code hardening (preparing the model and code for production pipelines), developing and staging demos and presenting your work within the company as well as via publications in peer reviewed venues (preferably A/A+ rated).; Day-to-day, your responsibilities are to:; Research and develop production grade Machine Learning models as described above. Optimize models for scaled production usage.; Work with colleagues in the AI team, other Engineering teams, subject matter experts, Product Management, Marketing, Sales and Customer support to explore ongoing product issues, challenges and opportunities and then recommend innovative ML/AI based solutions.; Help out with ad-hoc one-off tasks as a team player within the AI team.; Work with subject matter experts to curate and generate optimal datasets following responsible data collection and model maintenance practices. Explore and access SQL, no-SQL and web data and write efficient parallel pipelines. Review and design datasets to ensure data quality.; Investigate weaknesses of models in production and work on pragmatic solutions.; Utilize, adopt, and fine-tune off the shelf models, including LLMs exposed via API (through prompt engineering and agents) and locally hosting LMs and other foundation models.; Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.; Write clean, efficient, and modular code with automated tests and appropriate documentation.; Stay up to date with technology and platforms, make good technological choices, and be able to explain them to the organization.; Work with downstream teams to productionize your work and ensure that it makes into a product release.; Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.; Present and publish your work.; Qualifications; Required Qualifications:; Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field or outstanding previous achievements demonstrating excellence in Deep Machine Learning, Computer Science and Software Engineering.; At least 5 years of industry experience in Machine / Deep Learning (we use the python ecosystem for ML), Computer Science and Software Engineering.; A strong understanding of the math and theory behind machine learning and deep learning is a prerequisite.; Academic publications in peer reviewed conferences or journals related to Machine Learning - preferably A/A+ rated such as NeurIPS, ICML, ICLR, AAAI, TMLR, JMLR, IJCAI, ICANN, KDD, ACL, EMNLP, NAACL, COLING, CVPR, ICCV, ECCV, IEEE etc.; Machine / Deep Learning development skills, including popular platforms (we use AWS SageMaker, Hugging Face, Transformers, PyTorch, PyTorch Lightning, Ray, scikit-learn, Jupyter, Weights & Biases etc.).; An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.; Excellent communication and teamwork skills.; Fluent in written and spoken English.; Would be a plus:; We’re an applied science group, therefore Software development proficiency is a requirement. Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.; A Computer Science educational background is preferred as opposed to statistics or pure mathematics.; Familiarity in building front-ends (Gradio, Streamlit, Dash or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.; Experience with advanced prompting / agentic-systems and fine-tuning or training an LLM, using industry accepted platforms.; Showcase previous work (e.g. via a website, presentation, open source code).; Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.; Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).; Additional Information; The expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.; As a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.; Total Rewards @ Turnitin; Turnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.; Our Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.; Our Values underpin everything we do.; Customer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.; Passion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.; Integrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.; Action & Ownership - We have a bias toward action and empower teammates to make decisions.; One Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.; Global Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.; Global Benefits; Remote First Culture; Health Care Coverage*; Education Reimbursement*; Competitive Paid Time Off; 4 Self-Care Days per year; National Holidays*; 2 Founder Days + Juneteenth Observed; Paid Volunteer Time*; Charitable contribution match*; Monthly Wellness or Home Office Reimbursement*; Access to Modern Health (mental health platform); Parental Leave*; Retirement Plan with match/contribution*; varies by country; Seeing Beyond the Job Ad; At Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!; Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric c...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Staff AI Engineer",
    "company": "Doma Technology LLC",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=d6286aac449a0a05",
    "salary": "$168,680 - $214,800 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nAD&D insurance\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nHealth savings account\nShow more\n&nbsp;",
    "qualifications": "Qualifications; 5+ years of experience building and shipping production-grade AI or ML systems, with a strong focus on LLMs and transformer models.; Deep understanding of LLM internals (attention mechanisms, tokenization, fine-tuning techniques) and best practices around their use.; Experience developing and deploying models in a cloud-based production environment following MLOps best practices, with proficiency in Python, SQL, Git, Docker.; Enthusiasm about taking ownership of complex projects, including managing the requests coming from multiple stakeholders throughout the company; Ability to manage stakeholders and communicate technical concepts to people throughout the company, including business partners in product and senior leadership.; How we'll value you and make your life a bit easier:; We offer a comprehensive package of benefits to eligible employees (FTE, non-contract): medical/dental/vision insurance, 401(k), generous vacation time, and paid bonding leave.; Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, or any other form of compensation that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company's sole discretion, consistent with the law.; We believe the most valuable investment we can make is to build an outstanding team of colleagues and leaders who are passionate about our mission.; We currently offer the following benefits to all Full-Time employees:; Work/Life Balance - We encourage taking Paid Time Off (PTO)!; 12 Weeks of Paid Family Bonding Leave (Maternity and Paternity); Incredible medical, dental, and vision benefits options to allow you to customize to you and your family's needs that all start in the following month following your first day of employment; Health Savings Account (HSA); 401K with company match program; Short-Term & Long-Term Disability; Supplemental Life and AD&D Insurance; Critical Illness, Injury and Hospital Insurance; We believe in Equal Opportunity; We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "description": "If you're good at what you do, you can work anywhere. If you're the best at what you do, come work for Doma Technology.\nAbout Us\n\nDoma Technology LLC offers solutions for lenders, real estate professionals, title agents, and homeowners that make closings vastly simpler and more efficient, reducing cost and increasing customer satisfaction.\n\nOur Values\nObsessively Entrepreneurial - We encourage calculated risk-taking, and we know that some of our best learning happens by making mistakes along the...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;",
    "qualifications": "Strong programming skills in Python; experience with Machine Learning libraries and Generative AI frameworks (e.g., Pandas, NumPy, Matplotlib, Seaborn, TensorFlow, PyTorch, scikit-learn, LangChain) and LLMs.; Experience developing and deploying AI solutions on cloud platforms (e.g., AWS, Azure, or GCP).; Experience in building Asynchronous Python APIs.; Experience with data visualization tools such as Matplotlib, Seaborn, or Tableau.; Familiarity with cloud platforms such as AWS, Azure, or Google Cloud for deploying AI solutions.; Proven experience in developing and deploying machine learning models in a production environment.; Experience working with large datasets and performing data analysis; Required Qualifications; Education; Bachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.; Experience; Advanced experience in data science, machine learning, AI, or optimization projects.; Proficiency in Python and SQL.; Strong understanding of statistical methods, experimental design, and model validation.; Experience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).; Familiarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).; Preferred Experience; Experience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).; Exposure to specialized analytics areas such as simulation, graph analytics, or video analytics.; Skills & Abilities; Ability to independently manage and deliver on complex projects.; Strong problem-solving and critical thinking skills.; Effective communication skills for both technical and executive audiences.; Ability to adapt quickly to changing priorities and new technologies.; Strong interpersonal and collaboration skills.; .....",
    "description": "Benefits:\n\nHYBRID\nCompetitive salary\nOpportunity for advancement\nTraining & development\n\nJob Title: Data Scientist – Integrated Operations\nLocation: Dallas, TX (Hybrid Remote)\nIn-Person Interview\nMust be authorized to work in the U.S\n\nWork Arrangement\n\nHybrid work model: primarily remote within the Dallas–Fort Worth area.\nOccasional on-site presence required for meetings, training, or business needs.\nLimited business travel may be required.\n\nRoles & Responsibilities\n. 6+ years of experience in M...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Machine Learning Engineer",
    "company": "Tiger Analytics",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=e8b61f5ad64f8bbf",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Requirements; Key Requirements:; Google Cloud Platform (GCP) Experience: Strong proficiency in GCP services, including data engineering and machine learning tools.; Google Vertex AI Expertise: Hands-on experience with model training, deployment, and optimization using Vertex AI.; Model Development & Deployment: Proven ability to design, build, and productionize machine learning models.; API Development: Skilled in developing robust APIs for seamless integrations.; Python Programming with CI/CD: Experience in Python-based applications and implementing CI/CD pipelines.; Why Join Us?; Work remotely while contributing to cutting-edge projects.; Collaborate with a dynamic team passionate about AI/ML innovation.; Opportunity to work with the latest Google Cloud technologies.; Ready to take the next step? Apply now and be part of a team that’s shaping the future of AI!; Benefits",
    "description": "Tiger Analytics is an advanced analytics consulting firm. We are the trusted analytics partner for several Fortune 100 companies, enabling them to generate business value from data. Our consultants bring deep expertise in Data Science, Machine Learning, and AI. Our business value and leadership have been recognized by various market research firms, including Forrester and Gartner.\n\nAre you a Machine Learning Engineer with expertise in Google Cloud Platform (GCP) and Vertex AI? We are looking for...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "AI Engineer",
    "company": "Wellfit Technologies",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=5445a91de7d17680",
    "salary": "$150,000 - $180,000 a year",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "To perform this job successfully, an individual must be able to perform each essential function at a high degree of proficient execution. The requirements listed below are representative, but not all inclusive, of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions.; Take on a technical role by taking a hands-on approach developing systems that integrate with new and existing Wellfit technologies and products.; Demonstrate expertise in the code and the various teams' software development processes.; Help to continuously improve both software and processes.; Evaluate multiple approaches to technical problems and be able to recommend one solution after considering limitations and challenges.; Be proficient in applying the scientific method to execute research and development Initiatives.; Communicate clearly with others regarding project status and risks, and to ensure that work is aligned with the Wellfit's Innovation Strategy.; Serve as a role model for excellent software skills and a source of expertise to participants in Wellfit's Innovation program.; Ensure that code is efficient, scalable, maintainable, extensible, robust and easy to understand. Diagnose and fix code problems.; Deliver code that meets requirements on schedule.; Optimize code to improve tool run time and memory capacity.; Create unit, regression and/or system-level tests to thoroughly validate new features or changes.; Communicate solution, design, high level architecture through documentation including diagrams.; Qualifications:; BS degree in Computer Science or related field.; 5+ years of experience in Full Stack Development with ASP.NET, .NET Framework 2.0, C#, and SQL and/or equivalent back-end development experience using Python (FastAPI, Flask, Django) with strong database skills.; 5+ years of experience in Web Development, Javascript frameworks, Angular.; Hands-on experience building AI-powered features, integrating machine learning models, or using AI tooling to acscelerate development workflows; Experience performing proofs of concept, research and development, or pure research.; Strong background with solid understanding of standards and best practices in web development, data structures, algorithms, and debugging.; Experience working with Cloud API's, Web Services, Source Control tools.; Experience in writing, refactoring, debugging, testing code.; Experience with unit testing (TDD, BDD, ATDD).; Demonstrated technical leadership, and successful delivery of projects involving multiple engineers.; Solid understanding of cloud service providers such as AWS, GCP, and/or Azure and services each provides.; Familiarity with Domain Driven Design.; Familiarity with Design Thinking and Human-centered Design.; Demonstrated expertise In Artificial Intelligence and related disciplines.; Experience with Microservices, DevOps, GIT, Framework Development, Full-Stack Engineering.; Why Wellfit?; Make an Impact: Your work will directly shape the financial backbone of one of the most innovative healthcare fintech companies in the U.S.; Work Flexibly: Hybrid model based in Dallas with 3 days/week in-office.; Comprehensive Benefits: Full medical, dental, vision, and generous PTO.; Invest in Your Future: Competitive salary, bonus eligibility, and 401(k) matching.; Fast-Growth Environment: A rare opportunity to grow with a profitable startup on a national trajectory.; Alongside a competitive annual bonus, we offer a 401(k) with up to a 4% match, generous paid time off, and comprehensive healthcare benefits.",
    "description": "Wellfit is the dental industry’s fintech solution! A healthcare fintech company that enhances experiences between patients, providers, employers and payors. Wellfit provides access to treatment and care of all by removing financial barriers.\n\nAbout the Role:\nThe AI Engineer position, is a key role for our organization. You will be immersed in a high performing and frequently challenged team responsible for researching and experimenting with new technology and processes to optimize our ability to...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Spectral MD Inc",
    "jobLocation": "Dallas, TX 75201 \n(Uptown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=f46871773389d191",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Demonstrate strong communication skills, persistence, attention to detail, and a drive to complete research projects end-to-end.; Qualifications:; M.S. or Ph.D. in Computer Science, Electrical Engineering, Biomedical Engineering, Statistics, Applied Mathematics or related field.; Knowledge, Skills, and Abilities:; Strong foundation in state-of-the-art deep learning architectures (e.g., vision transformers) for computer vision tasks including image classification, object detection, and semantic segmentation.; Proficiency in deep learning libraries and frameworks, including PyTorch and TensorFlow.; Proficiency in C++ regarding object-oriented programming, data structure and performance optimization technique.; Solid knowledge of model optimization techniques, such as pruning, quantization, mixed-precision inference, and other performance-enhancing strategies.; Solid knowledge of model deployment tools, including ONNX, LibTorch, and TensorRT.; Strong grasp of model evaluation metrics, benchmarking, and best practices for computer vision model validation.; Self-driven with the ability to deliver on ambiguous projects with incomplete data.; Excellent written communication skills, especially in writing technical manuscripts.; Bonus:; Experience and knowledge in healthcare domain with successful outcomes.; Experience with CUDA programming for developing custom GPU kernels, optimizing computational performance, and accelerating deep learning workflows.; Physical Requirements:; Prolonged periods of sitting at a desk and working on a computer.; Travel:; N/A; Equal Employment Opportunity:; Spectral MD, Inc. is an equal opportunity and affirmative action employer. All applicants will be considered for employment without regard to race, color, ancestry, national origin, sex, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing, protected veteran status, or any other characteristic protected by applicable federal, state or local laws.",
    "description": "Position Summary:\n\nWe are seeking a motivated Data Scientist to research, develop, and enhance machine learning and deep learning algorithms that drive innovative healthcare solutions. This role involves maintaining high data quality standards, collaborating with clinical and business partners to understand their needs, and translating advanced research into practical applications. The ideal candidate will assist in building and improving deep learning frameworks, manage projects independently, ...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "AI GTM Analyst",
    "company": "Karbon",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4434e4117c77b9c6",
    "salary": "$100,000 - $130,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nWork from home stipend\nPaid parental leave\nParental leave\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\nShow more\n&nbsp;",
    "qualifications": "Implement AI-driven workflows for prospecting, reactivation, and qualification in platforms like HubSpot and Clay.; Qualifications; Hands-on experience with AI, LLMs, and vector embeddings, including tools like OpenAI API, LangChain, or similar frameworks.; Proven ability to design, implement, and optimize AI workflows for GTM teams, including predictive modeling and automated insights.; Strong understanding of data pipelines and unstructured data analysis (e.g., Gong call transcripts, email content) using LLM-based techniques.; Expertise in applying LLMs for summarization, insight extraction, and next-best action recommendations within GTM contexts.; Familiarity with AI-powered automation platforms (e.g., HubSpot AI, Clay, or custom GPT-based agents).; Deep knowledge of GTM tech stacks (e.g., Salesforce, Gong, HubSpot, Outreach) and experience leveraging AI integrations to extract maximum value from these tools.; Solid grounding in GTM funnel metrics and the ability to apply AI analytics to improve conversion ratios sequentially.; Proficiency in SQL or Python for data manipulation and AI model integration is plus.; Why Work at Karbon; Gain global experience across the USA, Australia, New Zealand, UK, Canada and the Philippines; Excellent benefits package including:; Paid Flexible Time Off with an encouraged 3 weeks use per year; Company paid medical for you and eligible spouse/partner and dependents; Company paid dental and vision and eligible spouse/partner and dependents; Fully company funded short and long term disability; Fully company paid life insurance; 401(k) with company matching; Flexible Spending Account; Up to 8 weeks paid parental leave; Work-from-home stipend; Work with (and learn from) an experienced, high-performing team; A collaborative, team-oriented culture that embraces diversity, invests in development and provides consistent feedback; Be part of a fast-growing company that firmly believes in promoting high performers from within; Karbon embraces diversity and inclusion, aligning with our values as a business. Research has shown that women and underrepresented groups are less likely to apply to jobs unless they meet every single criteria. If you've made it this far in the job description but your past experience doesn't perfectly align, we do encourage you to still apply. You could still be the right person for the role!; We recruit and reward people based on capability and performance. We don't discriminate based on race, gender, sexual orientation, gender identity or expression, lifestyle, age, educational background, national origin, religion, physical or cognitive ability, and other diversity dimensions that may hinder inclusion in the organization.; Generally, if you are a good person, we want to talk to you.; If there are any adjustments or accommodations that we can make to assist you during the recruitment process, and your journey at Karbon, contact us at people.support@karbonhq.com for a confidential discussion.; At this time, we request that agency referrals are not submitted for this position. We appreciate your understanding and encourage direct applications from interested candidates. Thank you!",
    "description": "About Karbon\n\nKarbon is the global leader in practice management software for growth-minded accounting firms. We provide an award-winning, highly collaborative cloud platform that streamlines work and communication, enabling the average accounting firm using Karbon to save 18.5 hours per week, per employee.\n\nWe have customers in 34 countries and have grown into a globally distributed team, with our people based throughout the US, Australia, New Zealand, Canada, the United Kingdom, and the Philip...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "DESIRED SKILLS AND EXPERIENCE; Strong problem-solving skills with an emphasis on product development.; Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.; Experience working with and creating data architectures.; Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.; Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.; Excellent written and verbal communication skills for coordinating across teams.; A drive to learn and master new technologies and techniques.; 5-7 years of experience manipulating data sets and building statistical models.; Master’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools:; Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.; Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.; Experience querying databases and using statistical computer languages: R, Python, SLQ, etc.; Experience using web services: Redshift, S3, Spark, DigitalOcean, etc.; Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.; Experience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.; Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.; Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.; Employer’s Rights:",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementi...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Science Engineer",
    "company": "Goodnight Midstream",
    "jobLocation": "Hybrid work in Dallas, TX 75206",
    "jobUrl": "https://www.indeed.com/viewjob?jk=a9de40a688b5e9f7",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "This position requires someone who's not only technically skilled but also a great communicator, capable of working effectively across multiple teams to understand their needs and deliver innovative solutions. You'll be instrumental in developing and maintaining our data infrastructure, with a particular focus on integrating with industrial SCADA systems and SQL databases to drive insights and improve efficiency.; Responsibilities:; Serve as an engineering resource for the development of Data Science projects.; Build and maintain data pipelines to support data-driven decision making across the organization.; Integrate data from diverse sources, including, but not limited to, APIs, industrial SCADA systems and various SQL databases.; Develop and deploy AI-powered tools and models to solve complex business problems.; Collaborate with cross-functional teams, including engineers, operations and management to define project requirements and deliver effective solutions.; Manage data science projects from conception to completion, ensuring timely and successful delivery using professional project management tools.; Train end users on optimizing their use of the Data Science data platform.; Utilize a variety of AI tools to automate processes, enhance data analysis and improve overall operational intelligence.; Manage and maintain the company’s schema and data map; Education, Experience, and Technical Skills:; A bachelor’s degree is required. While a technical background is preferred, we welcome applicants from a variety of educational fields, including engineering disciplines such as mechanical or electrical engineering. Candidates should have at least two years of professional experience in a data-focused role, with proven expertise in building and integrating data systems.; Experience and proficiency with the following technologies is required:; Python; Microsoft Power Platform; MS SQL Server; MS Excel; Proficiency in programmatically interacting with APIs for data exchange and system integration.; Experience with the following technologies would be preferred and ideal:; Palantir Foundry, and specifically Quiver; Splunk; AI Tools; You should be able to demonstrate your skills without references.; The candidate should be highly skilled in the following areas: problem solving, prioritization, attention to detail, verbal and written communication. This position requires a self-starter/self-learner that demonstrates clear accountability and can adapt easily whether working independently or with a team. The candidate must have a strong sense of urgency and sound judgment. This candidate must be able to work independently, as well as in a group setting. Ability to plan out, manage, document and delegate multiple concurrent projects.; Working Environment/Physical Requirements:; Working conditions are normal for an office environment. This position remains sedentary at least 75% of the time. This position constantly operates computers, phones, printers and other office productivity machines (e.g., fax machine, copier, printer, etc.). Occasionally required to move documents or files weighing up to 10 lbs. This position requires frequent communication and exchange of information verbally and in writing. This position must be able to inspect and observe information on a computer screen at least 80% of the time. Occasional travel to field facilities and other locations may be required.",
    "description": "We're seeking an outgoing and collaborative Data Science Engineer to join our team. You'll play a key role in building and integrating data tools and solutions that will directly impact our business operations. Goodnight Midstream is predominantly a MS Power Platform, Palantir Foundry and Ignition/SCADA shop.\n\nThis is an exempt-level position based out of our Dallas office, working a hybrid schedule. Applicants must be currently authorized to work in the United States on a full-time basis- Goodn...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Data Science Engineer",
    "company": "Goodnight Midstream",
    "jobLocation": "Hybrid work in Dallas, TX 75206",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0f1e2d3c4b5a6978",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  },
  {
    "jobTitle": "Sr Data Scientist GenAI",
    "company": "Select Minds LLC",
    "jobLocation": "Dallas, TX 75235 \n(Dallas Love Field area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0adc95909d448a8e",
    "salary": "$150,000 - $210,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\nFlexible schedule\n&nbsp;",
    "qualifications": "Mentor more junior data scientists; help build team skills in NLP, GenAI practices, prompt engineering, fine-tuning.; Identify new use cases; prototype innovations in GenAI/NLP; keep up with latest research and open source developments, decide what to adopt.; Must-Have Qualifications:; 10+ years of experience in data science / ML, with substantial work in NLP, LLMs, or Generative AI.; Deep hands-on experience in Python, using frameworks like PyTorch, TensorFlow, HuggingFace etc.; Proven track record building transformer/NLP / LLM models; experience with fine-tuning, prompt engineering.; Solid experience with information retrieval / search: keyword + semantic search, embeddings, vector databases.; Experience working in production / deploying models (batch and streaming), working with MLOps practices.; Strong algorithmic / statistical / mathematical fundamentals. Ability to reason about model behaviour, bias, uncertainty.; Good communicator: able to translate complex technical detail to business / non-technical stakeholders.; Nice to Have:; Master's in Computer Science, Computational Linguistics, Statistics, Machine Learning or related field.; Experience with multimodal models (vision + text) or emerging LLMs and agent-based systems.; Experience with open source LLMs & toolkits; familiarity with LangChain or similar frameworks.; Prior experience in regulated environments (finance, risk, legal, compliance) with strong governance, privacy requirements.; Work remote temporarily due to COVID-19.",
    "description": "Benefits:\n\nCompetitive salary\nFlexible schedule\nOpportunity for advancement\n\nSr Data Scientist (NLP / LLM / Generative AI)\nLocation: Dallas, TX\n\nRoles & Responsibilities :\n\nDesign, build, fine-tune, and deploy LLMs, transformer-based NLP models, and GenAI solutions for both batch and real-time/streaming contexts.\nOwn all major components of ML pipelines: data ingestion, cleaning, pre-processing (structured & unstructured), embedding, search & retrieval, prompt engineering, RAG (Retrieval-Augment...",
    "preferences": "Not specified",
    "mission_statement": "Not specified"
  }
]