[
  {
    "jobTitle": "Sr Data Scientist GenAI",
    "company": "Select Minds LLC",
    "jobLocation": "Dallas, TX 75235 \n(Dallas Love Field area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0adc95909d448a8e",
    "salary": "$150,000 - $210,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\nFlexible schedule\n&nbsp;",
    "qualifications": "10+ years of experience in data science / ML, with substantial work in NLP, LLMs, or Generative AI.; Deep hands-on experience in Python, using frameworks like PyTorch, TensorFlow, HuggingFace etc.; Proven track record building transformer/NLP / LLM models; experience with fine-tuning, prompt engineering.; Solid experience with information retrieval / search: keyword + semantic search, embeddings, vector databases.; Experience working in production / deploying models (batch and streaming), working with MLOps practices.; Strong algorithmic / statistical / mathematical fundamentals. Ability to reason about model behaviour, bias, uncertainty.; Good communicator: able to translate complex technical detail to business / non-technical stakeholders.; Nice to Have:; Master's in Computer Science, Computational Linguistics, Statistics, Machine Learning or related field.; Experience with multimodal models (vision + text) or emerging LLMs and agent-based systems.; Experience with open source LLMs & toolkits; familiarity with LangChain or similar frameworks.; Work remote temporarily due to COVID-19.",
    "description": "Benefits: Competitive salary Flexible schedule Opportunity for advancement Sr Data Scientist (NLP / LLM / Generative AI)...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "We expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).; Day-to-day, your responsibilities are to:; Work with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.; Work with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.; Answer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.; Develop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.; Utilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.; Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.; Optimize models for scaled production usage.; Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.; Write clean, efficient, and modular code, with automated tests and appropriate documentation.; Stay up to date with technology, make good technological choices, and be able to explain them to the organization.; Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.; A strong understanding of the math and theory behind machine learning and deep learning.; Software engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).; Machine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).; An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.; Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.; Excellent communication and teamwork skills.; Fluent in written and spoken English.; Would be a plus:; Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.; Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).; Familiarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.; Experience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).; Showcase previous work (e.g. via a website, presentation, open source code).; Additional Information; Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "description": "Company Description When you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education. Turnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines. Turnitin, LLC is an equal opportunity employer- vets/disabled....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist - Applied Research (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fa7309553094efc6",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "We’re an applied science group leaning towards modern Deep Learning. We expect our Senior Machine Learning Scientists to have a well-balanced set of skills, both in the Science as well as Software Engineering aspects of (Deep) Machine Learning. You will focus on developing novel and deployable ML models and solutions where no ready-made solution may be available. Therefore you need to be conversant enough with the mathematics of machine learning and deep neural networks such that you can construct novel model architectures, loss functions, training methods, training loops etc. You are also expected to keep abreast of the latest research advancements in AI and Deep Learning across modalities and apply those to your work. While we leverage ready-made training platforms, we also write our own training loops. Additionally, the models need to be directly deployable in our products, therefore, production level coding and software engineering proficiency is required. You may train large models (up to 100s of billions of parameters) therefore, ability to train on multiple GPUs and nodes and knowledge of the latest model training and inferencing advancements is necessary. Next, the models must perform well in production not only in terms of accuracy but also compute-cost. Delivering such software requires a sufficiently deep Computer Science background. Dataset exploration, generation (synthetic), design, construction and analysis, are a routine part of the job and may occupy a significant fraction of your time. Also, datasets can be large (billions of samples), therefore the ability to write parallel and efficient pipelines is a necessary skill. You will also be involved in code & model maintenance, code hardening (preparing the model and code for production pipelines), developing and staging demos and presenting your work within the company as well as via publications in peer reviewed venues (preferably A/A+ rated).; Day-to-day, your responsibilities are to:; Research and develop production grade Machine Learning models as described above. Optimize models for scaled production usage.; Work with colleagues in the AI team, other Engineering teams, subject matter experts, Product Management, Marketing, Sales and Customer support to explore ongoing product issues, challenges and opportunities and then recommend innovative ML/AI based solutions.; Help out with ad-hoc one-off tasks as a team player within the AI team.; Work with subject matter experts to curate and generate optimal datasets following responsible data collection and model maintenance practices. Explore and access SQL, no-SQL and web data and write efficient parallel pipelines. Review and design datasets to ensure data quality.; Investigate weaknesses of models in production and work on pragmatic solutions.; Utilize, adopt, and fine-tune off the shelf models, including LLMs exposed via API (through prompt engineering and agents) and locally hosting LMs and other foundation models.; Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.; Write clean, efficient, and modular code with automated tests and appropriate documentation.; Stay up to date with technology and platforms, make good technological choices, and be able to explain them to the organization.; Work with downstream teams to productionize your work and ensure that it makes into a product release.; Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.; Present and publish your work.; Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field or outstanding previous achievements demonstrating excellence in Deep Machine Learning, Computer Science and Software Engineering.; At least 5 years of industry experience in Machine / Deep Learning (we use the python ecosystem for ML), Computer Science and Software Engineering.; A strong understanding of the math and theory behind machine learning and deep learning is a prerequisite.; Academic publications in peer reviewed conferences or journals related to Machine Learning - preferably A/A+ rated such as NeurIPS, ICML, ICLR, AAAI, TMLR, JMLR, IJCAI, ICANN, KDD, ACL, EMNLP, NAACL, COLING, CVPR, ICCV, ECCV, IEEE etc.; Machine / Deep Learning development skills, including popular platforms (we use AWS SageMaker, Hugging Face, Transformers, PyTorch, PyTorch Lightning, Ray, scikit-learn, Jupyter, Weights & Biases etc.).; An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.; Excellent communication and teamwork skills.; Fluent in written and spoken English.; Would be a plus:; Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "description": "Company Description When you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education. Turnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines. Turnitin, LLC is an equal opportunity employer- vets/disabled....",
    "preferences": "Familiarity in building front-ends (Gradio, Streamlit, Dash or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.; Experience with advanced prompting / agentic-systems and fine-tuning or training an LLM, using industry accepted platforms.; Showcase previous work (e.g. via a website, presentation, open source code).; Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.; Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).; Additional Information"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;",
    "qualifications": "Education; Bachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.; Experience; Advanced experience in data science, machine learning, AI, or optimization projects.; Proficiency in Python and SQL.; Strong understanding of statistical methods, experimental design, and model validation.; Experience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).; Familiarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).",
    "description": "Benefits: HYBRID Competitive salary Opportunity for advancement Training & development...",
    "preferences": "Experience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).; Exposure to specialized analytics areas such as simulation, graph analytics, or video analytics.; Skills & Abilities; Ability to independently manage and deliver on complex projects.; Strong problem-solving and critical thinking skills.; Effective communication skills for both technical and executive audiences.; Ability to adapt quickly to changing priorities and new technologies.; Strong interpersonal and collaboration skills.; ....."
  },
  {
    "jobTitle": "Sr. Staff Data Scientist, Machine Learning",
    "company": "Varo Bank",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fcbae146e73f48b6",
    "salary": "$210,000 - $280,000 a year - Full-time",
    "benefits": "Not specified",
    "qualifications": "About Varo; Varo launched in 2017 with the vision to bring the best of fintech into the regulated banking system. We’re a new kind of bank – all-digital, mission-driven, FDIC-insured, and designed around the modern American consumer.; As the first consumer fintech to be granted a national bank charter in 2020, we make financial inclusion and opportunity for all a reality by empowering everyone with the products, insights, and support they need to get ahead. Through our core product offerings and suite of customer-first features, we aim to address a broad range of consumer needs while profitably serving underserved communities that have been historically excluded from the traditional financial system.; Learn more about Varo by following us:; Facebook - https://www.facebook.com/varomoney; Instagram - www.instagram.com/varobank; LinkedIn - https://www.linkedin.com/company/varobank; Varo is an equal opportunity employer. Varo embraces diversity and we are committed to building teams that represent a variety of backgrounds, perspectives, and skills. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.; Beware of fraudulent job postings!; Varo will never ask for payment to process documents, refer you to a third party to process applications or visas, or ask you to pay costs. Never send money to anyone suggesting they can provide work with Varo. If you suspect you have received a phony offer, please e-mail careers@varomoney.com with the pertinent information and contact information.; CCPA Notice at Collection for California Employees and Applicants:; https://www.varomoney.com/privacy-legal/; We may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.",
    "description": "Varo is an entirely new kind of bank. All digital, mission-driven, FDIC insured and designed for the way our customers live their lives. A bank for all of us. Each member of the Data team plays an integral part of what we are building at Varo. We rely on advanced techniques in machine learning, cloud platforms and big data to drive decisions across the organization. If you are interested in working with an impressive team of Data pros who collaborate and challenge each other, and want to solve interesting problems to propel the company’s growth, apply now! What you'll be doing Develop custom models and algorithms to apply to large datasets, as well as, processes for monitoring and analyzing their performance Mine and analyze data from different resources, and use predictive modeling to increase and optimize customer experiences, customer acquisition, underwriting and other business outcomes...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist/Machine Learning Engineer",
    "company": "Ad hoc Research",
    "jobLocation": "Plano, TX 75074",
    "jobUrl": "https://www.indeed.com/viewjob?jk=74e623cedcbf0dc3",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Job description: **MUST BE US CITIZEN OR GREEN CARD HOLDER** We are looking for a experienced Data Scientist/Machine Learning Engineer. 1. Must have a Master's Degree in any of the these field - Mathematics, Statistics, Computer Science, Data Science, Engineering or related field. 2. At least 5 Years of industry Experience with machine learning algorithms and frameworks like scikit-learn, TensorFlow, and PyTorch....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Spectral MD Inc",
    "jobLocation": "Dallas, TX 75201 \n(Uptown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=f46871773389d191",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "M.S. or Ph.D. in Computer Science, Electrical Engineering, Biomedical Engineering, Statistics, Applied Mathematics or related field.; Knowledge, Skills, and Abilities:; Strong foundation in state-of-the-art deep learning architectures (e.g., vision transformers) for computer vision tasks including image classification, object detection, and semantic segmentation.; Proficiency in deep learning libraries and frameworks, including PyTorch and TensorFlow.; Proficiency in C++ regarding object-oriented programming, data structure and performance optimization technique.; Solid knowledge of model optimization techniques, such as pruning, quantization, mixed-precision inference, and other performance-enhancing strategies.; Solid knowledge of model deployment tools, including ONNX, LibTorch, and TensorRT.; Strong grasp of model evaluation metrics, benchmarking, and best practices for computer vision model validation.; Self-driven with the ability to deliver on ambiguous projects with incomplete data.; Excellent written communication skills, especially in writing technical manuscripts.; Bonus:; Experience and knowledge in healthcare domain with successful outcomes.; Experience with CUDA programming for developing custom GPU kernels, optimizing computational performance, and accelerating deep learning workflows.; Prolonged periods of sitting at a desk and working on a computer.; Travel:; N/A; Equal Employment Opportunity:; Spectral MD, Inc. is an equal opportunity and affirmative action employer. All applicants will be considered for employment without regard to race, color, ancestry, national origin, sex, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing, protected veteran status, or any other characteristic protected by applicable federal, state or local laws.",
    "description": "Position Summary: We are seeking a motivated Data Scientist to research, develop, and enhance machine learning and deep learning algorithms that drive innovative healthcare solutions. This role involves maintaining high data quality standards, collaborating with clinical and business partners to understand their needs, and translating advanced research into practical applications. The ideal candidate will assist in building and improving deep learning frameworks, manage projects independently, and work effectively both individually and within cross-functional teams. Staying current with emerging technologies and demonstrating strong communication, attention to detail, and persistence are essential for success in this role. Essential Duties and Responsibilities: Research, develop, and enhance machine learning and deep learning algorithms and frameworks for computer vision applications, translating cutting-edge research into practical healthcare solutions. Implement and optimize deployment pipelines for trained models to enable efficient, scalable, and hardware-optimized inference....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Rhapsody",
    "jobLocation": "Remote in Dallas, TX 75201",
    "jobUrl": "https://www.indeed.com/viewjob?jk=eb48d0156c9fa160",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Required:; 3+ years of experience in data science, machine learning, or applied analytics; Strong Python skills (e.g., pandas, NumPy, matplotlib, scikit-learn); Strong data analysis skills, with experience exploring, interpreting, and extracting insights from complex datasets; Familiarity with SQL; Experience working with structured data and building basic models (e.g., classification, regression); Curiosity about AI/ML systems and a willingness to learn quickly through real-world application",
    "description": "About Rhapsody: We all know that our health care system is complicated. Getting data from one provider to another, or from a provider to a health insurance company, is frustrating for virtually everyone. Imagine developing solutions that help make these data transactions easier and faster. That is what we do at Rhapsody; we make interoperability platforms that allow data – such as patient encounter details, lab results, and billing information – to move seamlessly from one system to another. While most people will not ever see our products and services during a medical encounter, our interoperability platforms are running behind the scenes. Think of them as the central nervous system helping to move data where it needs to be to improve the patient experience. To learn more about Rhapsody, visit www.rhapsody.health If using your expertise in a way that impacts our health care system, patient care, and population health sounds like something you would find rewarding, apply today! This is a remote position. However, preference is for someone local to Dallas, TX....",
    "preferences": "Exposure to evaluating or experimenting with neural networks; Familiarity with model evaluation techniques (e.g., precision/recall, ROC, drift detection); Interest in or exposure to GenAI workflows (e.g., prompt evaluation, embedding inspection); Experience using tools like Jupyter, MLflow, Airflow, or analytics platforms; Education:; Bachelor’s or Master’s degree in Data Science, Statistics, Computer Science, or a related field (or equivalent experience)"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "OxeFit, Inc.",
    "jobLocation": "Plano, TX 75093",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0b45b010841965be",
    "salary": "Full-time",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "Not specified",
    "description": "Salary Range: Based on experience As a Data Scientist, you will have the opportunity to build and develop models for data processing and analytics related to strength training and fitness. Essential Functions: ● Work with subject matter experts in fitness and strength training to develop metrics and...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Must Haves:; Strong quantitative skills",
    "description": "Job Description Job Description: Important Note: Candidates should have the following experience POSITION SUMMARY – Reason for contingent headcount?...",
    "preferences": "Additional Information; All your information will be kept confidential according to EEO guidelines."
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=a1b2c3d4e5f67890",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. KEY EXPECTATIONS Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions. Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies. Assess the effectiveness and accuracy of new data sources and data gathering techniques....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Senior Data Scientist",
    "company": "CARE IT SERVICES INC",
    "jobLocation": "Dallas, TX 75201 \n(Downtown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=6a4895d490612e28",
    "salary": "$100,000 - $140,000 a year - Full-time, Contract",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Job Title: Sr. Data Scientist Experience: 8–12 years Employment Type: W2 / 1099 only (No OPT / CPT) locations : Dallas, TX, Jerseycity, NJ , Tampa, FL, Atlanta, GA, Bay Area, CA Note: H-1B candidates are also welcome to apply....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist, Lead",
    "company": "o9 Solutions",
    "jobLocation": "Dallas, TX 75234",
    "jobUrl": "https://www.indeed.com/viewjob?jk=22b3cf3d942bae5c",
    "salary": "$133,000 - $175,000 a year - Full-time",
    "benefits": "Not specified",
    "qualifications": "Strong presentation and communications skills with ability to communicate complex analytical or technical concepts to audiences with limited analytical or technical background; Experience in time series forecasting in scale using heuristic based hierarchical best-fit models using algorithms like exponential smoothing, ARIMA, prophet and custom parameter tuning; Education: Master’s in Computer Science, Mathematics, Statistics, Economics, Engineering, or related field; Skills: R, Python, Pyspark, Machine Learning, SQL, building models in platforms like Power BI or Tableau; Characteristics: You thrive in a fast paced, challenging environment, where this is much white space and problem solving is at the heart of what drives your analysis; We really value team spirit: Transparency and frequent communication is key. At o9, this is not limited by hierarchy, distance, or function",
    "description": "Transforming the Future of Enterprise Planning At o9, our mission is to be the Most Value-Creating Platform for enterprises by transforming decision-making through our AI-first approach. By integrating siloed planning capabilities and capturing millions—even billions—in value leakage, we help businesses plan smarter and faster. This not only enhances operational efficiency but also reduces waste, leading to better outcomes for both businesses and the planet. Global leaders like Google, PepsiCo, Walmart, T-Mobile, AB InBev, and Starbucks trust o9 to optimize their supply chains. At o9, we invest in people. We seek talented, driven individuals to power our transformative approach. You’ll thrive in a dynamic, supportive environment, growing while making a real impact. About the role:...",
    "preferences": "Exposure to distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, or related Big Data technologies; Experience with Deep Learning frameworks such as Keras, Tensorflow or PyTorch is preferable; Experience in implementing planning applications will be a plus"
  },
  {
    "jobTitle": "Sr. Data Scientist",
    "company": "Ample IT Services",
    "jobLocation": "Irving, TX 75038 \n(Cottonwood area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=74c7c15677c0991b",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Master's deg in Comp Sci, Data Sci, Engg, Tech or related field, along with 2 yrs of exp in dvlp & producing Machine Learning (ML) & ntrl lang processing (NLP) models. The role involves deploying models in Kubernetes with CI/CD pipelines, apply MLOps practices & performing advanced data analysis using Python & SQL to address biz challenges. Responsibilities include building real-time ML pipelines with Spark & Airflow, measuring & improving NLP model performance, & using AI to drive forecasting & biz insights. Exp in ML, NLP, MLOps, & CI/CD, as well as expertise in Python, SQL, Kubernetes, & model monitoring tools like Grafana. Work loc: Work location is Irving, TX with required travel & work from various unanticipated client worksites throughout the USA. Please mail resumes to 5605 N Macarthur Blvd, Suite 1005, Irving TX 75038 (or) e-mail ramesh.tavva@ampleit.net",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "AI/ML and Data Scientist",
    "company": "RisamSoft",
    "jobLocation": "Irving, TX 75063 \n(Freeport/Hackberry area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=ebf80c00df9c0209",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Master's degree in Computer Science, Statistics, Mathematics, Physics, or a related field.; 4+ years of experience as a data scientist or related role.; Strong proficiency in Python and other relevant programming languages (e.g., R, Java, Scala).; Experience with machine learning libraries and frameworks (e.g., TensorFlow, PyTorch, scikit-learn).; Excellent data wrangling and manipulation skills.; Experience with cloud platforms (e.g., AWS, Azure) is a plus.; Strong communication and collaboration skills.; Ability to translate technical concepts into easily understandable terms.; Passion for learning and staying up-to-date with the latest advancements in AI/ML.",
    "description": "Risamsoft is a technology company that seeks talented and motivated individuals to join its team. We are passionate about using cutting-edge technology to solve real-world problems and believe in teamwork, diversity, and lifelong learning. We offer a variety of opportunities for professionals of all levels, from entry-level to senior management. Whether you are a seasoned expert or just starting out, we will provide you with the support and resources you need to succeed. At Risamsoft, your adventure starts right now. Join us and make a difference! Role Overview: We are looking for a highly motivated and talented AI/ML and Data Scientist with 4+ years of experience to join our team. In this role, you will be responsible for the entire data science lifecycle, from data acquisition and preprocessing to model development, deployment, and monitoring. You will collaborate closely with cross-functional teams to develop AI-powered solutions that solve real-world business problems and contribute to organizational growth....",
    "preferences": "Not specified"
  }
]