[
  {
    "jobTitle": "Data Scientist",
    "company": "Cyber Infotech",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fc93d4af354c1d0f",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Build, implement and maintain predictive models through their full lifecycle.\nIdentify patterns & trends in data, and provides insights to enhance business decision making.\nIdentify challenges and opportunities from client strategy discussions and taking ownership of solution.\nSet up and monitor monthly model recalibration process.\nGenerate complex ad-hoc analyses combining disparate concepts or creating new approaches.\nDesign and create new analytic procedures & automation.\n\nPlease forward your resume to contact@cyberinfotek.com",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Data Xpander",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=cdaa9e9635b3200e",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Email at hr@dataxpander.com\n\nThey need to have statistical, mathematical, predictive modelling as well as business strategy skills to build the algorithms necessary to ask the right questions and find the right answers. They also need to be able to communicate their findings, orally and visually. They need to understand how the products are developed and even more important, as big data touches the privacy of consumers, they need to have a set of ethical responsibilities.",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Data Xpander",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fedcba9876543210",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "n/a",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "LTIMindtree",
    "jobLocation": "Irving, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=b5b7bfd8c050ec3f",
    "qualifications": "n/a",
    "salary": "$79,851 - $107,720 a year",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Role description\n\nJob Title: AI/ML Consultant\nWork Location:\nIrving, TX\n\nJob Description:\n\nHaving good experience in using ML models and debugging ML models and work on training of new LLM models for creating end to end automation frameworks.\nShould have experience on Python PySpark and Big data technologies.\nGood to have React JS knowledge for creating websites for using framework.\nGood communication skills.\nAbility to work independently and handle the issues with support teams.\nExposure in creating Agentic AI having hands on testing agentic AI is a plus.\nMandatory Certification in Microsoft Azure Data Scientist Associate or Databricks Certified Associated Developer for Apache Spark.\n\nSkills\n\n\nMandatory Skills : MLOPS,GenAI - LLMOps,Python - Data Science,Machine Learning - AIOPS,Deep Learning - AIOPS\n\n\nOther details\n\n\nBenefits/perks listed below may vary depending on the nature of your employment with LTIMindtree (“LTIM”):\n\nBenefits and Perks:\n\nComprehensive Medical Plan Covering Medical, Dental, Vision\nShort Term and Long-Term Disability Coverage\n401(k) Plan with Company match\nLife Insurance\nVacation Time, Sick Leave, Paid Holidays\nPaid Paternity and Maternity Leave\n\nThe range displayed on each job posting reflects the minimum and maximum salary target for the position across all US locations. Within the range, individual pay is determined by work location and job level and additional factors including job-related skills, experience, and relevant education or training. Depending on the position offered, other forms of compensation may be provided as part of overall compensation like an annual performance-based bonus, sales incentive pay and other forms of bonus or variable compensation.\n\nDisclaimer: The compensation and benefits information provided herein is accurate as of the date of this posting.\n\nLTIMindtree is an equal opportunity employer that is committed to diversity in the workplace. Our employment decisions are made without regard to race, color, creed, religion, sex (including pregnancy, childbirth or related medical conditions), gender identity or expression, national origin, ancestry, age, family-care status, veteran status, marital status, civil union status, domestic partnership status, military service, handicap or disability or history of handicap or disability, genetic information, atypical hereditary cellular or blood trait, union affiliation, affectional or sexual orientation or preference, or any other characteristic protected by applicable federal, state, or local law, except where such considerations are bona fide occupational qualifications permitted by law.\n\n\n\n\nBenefits\nCompensation range: $79,851.00 to $107,720.00 per year\nAbout LTIMindtree\nLTIMindtree is a global technology consulting and digital solutions company that enables enterprises across industries to reimagine business models, accelerate innovation, and maximize growth by harnessing digital technologies. As a digital transformation partner to more than 700 clients, LTIMindtree brings extensive domain and technology expertise to help drive superior competitive differentiation, customer experiences, and business outcomes in a converging world. Powered by 83,000+ talented and entrepreneurial professionals across more than 40 countries, LTIMindtree — a Larsen & Toubro Group company — solves the most complex business challenges and delivers transformation at scale. For more information, please visit https://www.ltimindtree.com/.",
    "benefits": "Benefits\nPulled from the full job description\nPaid parental leave\nParental leave\nHealth insurance\n401(k) matching\nVision insurance\nDental insurance\nLife insurance\nShow more\n&nbsp;"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Beckett Collectibles",
    "jobLocation": "Remote in Plano, TX 75074",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fb3ee106f632130d",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Location: Remote-US (Preferably Dallas/Fort Worth, Texas)\nOur portfolio at Collectivus Holdings, LLC includes Beckett, Dragon Shield, Southern Hobby, and Merchant Guild—four brands with decades of expertise and dedication to elevating the collecting experience for enthusiasts and businesses alike.\nOur mission is to connect the world of collecting and gaming through brands that deliver quality, integrity, and reliability. Together, Beckett, Dragon Shield, Southern Hobby, and Merchant Guild work to enhance the hobbies and passions that bring people together.\n\nArcane Tinmen – Beckett Collectibles – Southern Hobby Distribution\n\nNashville – Plano – Aarhus – Lisbon – Worldwide\n\nCollectivus is seeking a highly skilled and analytical Data Scientist to join our team. The Data Scientist will play a crucial role in leveraging data to optimize our grading processes, enhance operational efficiency, and provide valuable insights into market trends and customer behavior. This position requires strong analytical skills, proficiency in data science tools and techniques, and the ability to work collaboratively across various departments.\n\n\nKey Responsibilities\nData Analysis and Modeling:\nCollect, clean, and analyze large datasets related to card grading operations, market trends, and customer behavior.\nDevelop and implement predictive models and algorithms to improve grading accuracy and operational efficiency.\nApply machine learning techniques to identify patterns, trends, and anomalies in data.\nProcess Optimization:\nAnalyze grading processes and workflows to identify inefficiencies and opportunities for improvement.\nCollaborate with the grading team to design and implement data-driven process enhancements and standard operating procedures (SOPs).\nConduct regular audits to ensure adherence to established procedures and quality standards.\nMarket and Customer Insights:\nAnalyze market trends and customer behavior to provide actionable insights on demand for different types of cards and collectibles.\nDevelop data-driven strategies to enhance customer satisfaction and retention.\nPartner with the marketing team to create targeted campaigns and promotions.\nData Visualization and Reporting:\nCreate and maintain dashboards and reports to monitor key performance indicators (KPIs) and operational metrics.\nPresent findings and recommendations to stakeholders clearly and effectively.\nDevelop compelling data visualizations to communicate complex insights effectively.\nCollaboration and Support:\nWork closely with IT and cross-functional teams to ensure data systems and tools are maintained and optimized.\nProvide support in organizing and managing data related to inventory, grading operations, and customer interactions.\nAssist in the development and delivery of training programs for staff on data-related topics.\nQualifications\nBachelor’s or Master’s degree in Data Science, Statistics, Computer Science, or a related field.\nProven experience as a Data Scientist or in a similar role, ideally within a grading, quality assurance, or operations environment.\nStrong analytical skills with proficiency in data analysis tools and software (e.g., Python, R, SQL, Power BI, Tableau).\nHands-on experience with machine learning techniques and predictive modeling.\nExcellent problem-solving skills and keen attention to detail.\nStrong communication and interpersonal skills, with the ability to collaborate effectively in a team environment.\nFamiliarity with trading cards, sports cards, or collectibles is a plus.\nAbility to manage multiple tasks and projects simultaneously in a fast-paced setting.\n\n\n\n#LI-Remote",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Toyota",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=162807d1f8394621",
    "qualifications": "n/a",
    "salary": "$70 - $81 an hour",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Who we are\nCollaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to Dream. Do. Grow. with us.\n\n\nWhat we’re looking for\nSkilled in forecasting and leading data science projects to leverage data to make better business decisions by delivering customer-centric insights. You will lead AI/ML efforts using an analytical mindset with critical thinking data skills\n\n\n\nWhat you’ll be doing\nExpertise in Machine learning and Data Science\nExperience working with large datasets, finding insights, and telling stories using data.\nUnderstanding of advance ML topics viz. Deep learning (ENN, CNN, RNN, etc.), GAN, Transformers, NLP, LLM's is a plus.\nExperience with ELT, ETL processes using glue, glue brew transformations.\nExperience working with automotive data sets is preferred.\nDeep expertise in Data Science viz. data segmentation, churn analysis, repeat purchase, market basket, A/B testing, etc.\n\n\nQualifications/ What you bring (Must Haves) – Highlight Top 3-5 skills\nWork on ad-hoc data science projects\nStrong technical skills in SQL, Python, R , or other programming languages commonly used in data analysis.\nWorking knowledge of CI/CD and MLOps\nGood knowledge in working with distributed datastores (e.g., SQL, NoSQL ), and Big Data and Cloud technologies like GCP BQ Firebase snowflake redshift\nSuccessful completion of one or more assessments in Python, Spark, Scala, or R, Using open source frameworks (for example, scikit learn, TensorFlow, torch)\n\n\nAdded bonus if you have (Preferred):\nUnderstanding of model management framework and at least 3 models as in Claude, LLAMA, Haiku, Gemma\n\n\n\nQUALIFICATION/LICENSURE\nWork Authorization : Green Card, US Citizen\nPreferred years of experience : 0 years\nTravel required : No travel required\nShift timings : 9 AM to 5 PM",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "qualifications": "n/a",
    "salary": "$111,000 - $185,000 a year",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Company Description\n\n\nWhen you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.\n\nExperience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.\n\nTurnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.\n\nTurnitin, LLC is an equal opportunity employer- vets/disabled.\n\n\nJob Description\n\n\nMachine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products.\n\nWe are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.\n\nResponsibilities and Requirements:\n\nWe expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).\n\nDay-to-day, your responsibilities are to:\n\nWork with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.\nWork with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.\nAnswer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.\nDevelop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.\nUtilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.\nStay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.\nOptimize models for scaled production usage.\nCommunicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.\nWrite clean, efficient, and modular code, with automated tests and appropriate documentation.\nStay up to date with technology, make good technological choices, and be able to explain them to the organization.\n\nQualifications\n\n\nRequired Qualifications:\n\nExperience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.\nA strong understanding of the math and theory behind machine learning and deep learning.\nSoftware engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).\nMachine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).\nAn understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.\nMaster's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.\nExcellent communication and teamwork skills.\nFluent in written and spoken English.\n\nWould be a plus:\n\nFamiliarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.\nEssential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).\nFamiliarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.\nExperience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).\nShowcase previous work (e.g. via a website, presentation, open source code).\n\nAdditional Information\n\n\nThe expected annual base salary range for this position is: $111,000/year to $185,000/year. This position is bonus eligible / commission-based.\n\nAs a Remote-First company, actual compensation will be provided in writing at the time of offer, if extended, and is determined by work location and a range of other relevant factors, including but not limited to: experience, skills, degrees, licensures, certifications, and other job-related factors. Internal equity, market and organizational factors are also considered.\n\nTotal Rewards @ Turnitin\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.\n\nOur Mission is to ensure the integrity of global education and meaningfully improve learning outcomes.\n\nOur Values underpin everything we do.\n\nCustomer Centric - We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.\nPassion for Learning - We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.\nIntegrity - We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.\nAction & Ownership - We have a bias toward action and empower teammates to make decisions.\nOne Team - We strive to break down silos, collaborate effectively, and celebrate each other’s successes.\nGlobal Mindset - We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.\n\nGlobal Benefits\n\nRemote First Culture\nHealth Care Coverage*\nEducation Reimbursement*\nCompetitive Paid Time Off\n4 Self-Care Days per year\nNational Holidays*\n2 Founder Days + Juneteenth Observed\nPaid Volunteer Time*\nCharitable contribution match*\nMonthly Wellness or Home Office Reimbursement*\nAccess to Modern Health (mental health platform)\nParental Leave*\nRetirement Plan with match/contribution*\nvaries by country\n\nSeeing Beyond the Job Ad\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!\n\nTurnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist - Applied Research (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fa7309553094efc6",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "n/a",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789b20dee7d0ba72",
    "qualifications": "n/a",
    "salary": "$56.02 - $67.47 an hour",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "POSITION SUMMARY\n\n· We’re looking for a Data Scientist who can be responsible for designing, building and maintaining document capture applications. The ideal candidate will have a solid background in software engineering with experience in building Machine Learning NLP Models and good familiarity with Gen AI Models.\n\nEDUCATION\n\n· Provide Bachelor's degree information\n\n· Education should always have at the least: Degree, Major, University Name, Date of Graduation\n\nPrimary Skill\n\n· Data Scientist\n\nSecondary Skill\n\n· Artificial Intelligence/Machine Learning\n\nREQUIREMENT SKILLS / EXPERIENCE\n\n· 7+ years of experience as Data Scientist or related roles\n\n· Bachelor’s degree in Computer Science, or a related technical field\n\n· Deep understanding and some exposure to new Gen AI Open-source Models\n\n· At least 5 years programming experience in software development and Agile process\n\n· At least 5 years Python (or equivalent) programming experience to work with ML/NLP models.\n\n· Experience in setting up supervised unsupervised learning ML/NLP models including data cleaning, data analytics, feature creation, model selection ensemble methods, performance metrics visualization\n\n· Experience in ML/NLP development pipelines of large data sets, both structured unstructured\n\n· At least 2 years’ experience in designing and developing enterprise-scale ML/NLP solutions in one or more of: Named Entity Recognition, Document Classification, Document Summarization, Topic Modelling, Dialog Systems, Sentiment Analysis, OCR text processing\n\n· Knowledge and hands-on experience working with OCR products\n\nDESIRED SKILLS / EXPERIENCE\n\n· Master’s degree in Computer Science/Data Science, or a related technical field\n\n· Collaborating with a diverse set of partners and stakeholders from various Line of Business.\n\n· Highly motivated, proactive and a self-starter; strong sense of ownership ability to create and execute plans without daily oversight\n\n· Critical thinker; ability to analyze problems and identify issues and provide solutions\n\n· Ability to navigate the enterprise data assets across multiple functions.\n\n· Highly organized. Effectively prioritizes and balances multiple efforts in a fast-paced environment\n\n· Excellent communication and Presentation skills\n\n· Analytical abilities great problem solving\n\n· Client focused\n\nJob Type: Contract\n\nPay: $56.02 - $67.47 per hour\n\nWork Location: In person",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "qualifications": "n/a",
    "salary": "$65 - $75 an hour",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Benefits:\n\nHYBRID\nCompetitive salary\nOpportunity for advancement\nTraining & development\n\nJob Title: Data Scientist – Integrated Operations\nLocation: Dallas, TX (Hybrid Remote)\nIn-Person Interview\nMust be authorized to work in the U.S\n\nWork Arrangement\n\nHybrid work model: primarily remote within the Dallas–Fort Worth area.\nOccasional on-site presence required for meetings, training, or business needs.\nLimited business travel may be required.\n\nRoles & Responsibilities\n. 6+ years of experience in Machine Learning and Data Science.\n\nStrong understanding of Generative AI, Retrieval Augmented Generation, Agentic Workflow, Statistical methods, data structures, and algorithms.\nStrong programming skills in Python; experience with Machine Learning libraries and Generative AI frameworks (e.g., Pandas, NumPy, Matplotlib, Seaborn, TensorFlow, PyTorch, scikit-learn, LangChain) and LLMs.\nExperience developing and deploying AI solutions on cloud platforms (e.g., AWS, Azure, or GCP).\nExperience in building Asynchronous Python APIs.\nExperience with data visualization tools such as Matplotlib, Seaborn, or Tableau.\nFamiliarity with cloud platforms such as AWS, Azure, or Google Cloud for deploying AI solutions.\nProven experience in developing and deploying machine learning models in a production environment.\nExperience working with large datasets and performing data analysis\n\nRequired Qualifications\n\nEducation\n\nBachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.\n\nExperience\n\nAdvanced experience in data science, machine learning, AI, or optimization projects.\nProficiency in Python and SQL.\nStrong understanding of statistical methods, experimental design, and model validation.\nExperience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).\nFamiliarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).\n\nPreferred Experience\n\nExperience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).\nExposure to specialized analytics areas such as simulation, graph analytics, or video analytics.\n\nSkills & Abilities\n\nAbility to independently manage and deliver on complex projects.\nStrong problem-solving and critical thinking skills.\nEffective communication skills for both technical and executive audiences.\nAbility to adapt quickly to changing priorities and new technologies.\nStrong interpersonal and collaboration skills.\n\n.....",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;"
  },
  {
    "jobTitle": "Data Science Subject Matter Experts",
    "company": "Zion Zest LLC",
    "jobLocation": "Dallas, TX 75244",
    "jobUrl": "https://www.indeed.com/viewjob?jk=34f39dba2736a427",
    "qualifications": "n/a",
    "salary": "$180,000 - $250,000 a year",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Overview\nWe are seeking a skilled and motivated Data Scientist to join our dynamic team. In this role, you will leverage your expertise in data analytics, machine learning, and statistical modeling to extract valuable insights from complex datasets. You will work collaboratively with cross-functional teams to drive data-driven decision-making and contribute to innovative projects that enhance our business strategies.\n\nResponsibilities\n\nSME Expertise: Seek out an SME with in-depth knowledge of data science concepts (e.g., machine learning, statistical modeling, programming languages like Python or R) and practical experience in applying these within a business context.\nPassion for Teaching: The SME should be passionate about teaching and able to simplify complex concepts for different learning levels within the organization.\nCustomized Content: Develop a customized curriculum that addresses identified skill gaps, and includes relevant tools and platforms used within your company.\nTo effectively train employees in data science, especially within a corporate context, consider using a data science subject matter expert (SME) to guide the training program.\nAnalyze large datasets to identify trends, patterns, and anomalies that can inform business decisions.\nDevelop and implement machine learning models and algorithms to solve complex problems.\nUtilize advanced analytics techniques including data mining and predictive modeling to enhance operational efficiency.\nCollaborate with stakeholders to understand their data needs and provide actionable insights.\nCreate visualizations and reports that effectively communicate findings to both technical and non-technical audiences.\nMaintain and optimize existing data pipelines and workflows using tools such as SQL, Hadoop, or SAS.\nStay current with industry trends in AI and machine learning frameworks to continuously improve methodologies.\n\nQualifications\n\nTrain junior Data Science Engineers and help them with programming.\nProficiency in programming languages such as C and VBA for data manipulation and analysis.\nStrong knowledge of SQL for database querying and management.\nExperience with linked data concepts and analytics tools.\nFamiliarity with machine learning frameworks (e.g., TensorFlow, PyTorch) is a plus.\nDemonstrated ability in data mining techniques for extracting insights from large datasets.\nExcellent problem-solving skills with a keen analytical mindset.\nStrong communication skills, both written and verbal, for effective collaboration across teams.\nA degree in Data Science, Computer Science, Statistics, or a related field is preferred.\n\nJoin us in harnessing the power of data to drive innovation and success!\n\nJob Types: Full-time, Contract\n\nPay: $180,000.00 - $250,000.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nWork Location: In person",
    "benefits": "Benefits\nPulled from the full job description\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\n&nbsp;"
  },
  {
    "jobTitle": "Machine Learning Engineer",
    "company": "Tiger Analytics",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=e8b61f5ad64f8bbf",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Tiger Analytics is an advanced analytics consulting firm. We are the trusted analytics partner for several Fortune 100 companies, enabling them to generate business value from data. Our consultants bring deep expertise in Data Science, Machine Learning, and AI. Our business value and leadership have been recognized by various market research firms, including Forrester and Gartner.\n\nAre you a Machine Learning Engineer with expertise in Google Cloud Platform (GCP) and Vertex AI? We are looking for two talented professionals to join our team in a fully remote, onshore capacity. If you thrive in building and deploying scalable AI solutions, this role is for you!\n\nWhat You'll Do:\n\n\n\nCollaborate with cross-functional teams to design and deploy ML models.\n\nDevelop reusable, scalable code for AI/ML applications.\n\nLeverage GCP services to build end-to-end machine learning pipelines.\n\nOptimize models for performance and scalability using Vertex AI.\n\nRequirements\n\nKey Requirements:\n\n\n\nGoogle Cloud Platform (GCP) Experience: Strong proficiency in GCP services, including data engineering and machine learning tools.\n\nGoogle Vertex AI Expertise: Hands-on experience with model training, deployment, and optimization using Vertex AI.\n\nModel Development & Deployment: Proven ability to design, build, and productionize machine learning models.\n\nAPI Development: Skilled in developing robust APIs for seamless integrations.\n\nPython Programming with CI/CD: Experience in Python-based applications and implementing CI/CD pipelines.\n\n\nWhy Join Us?\n\n\n\nWork remotely while contributing to cutting-edge projects.\n\nCollaborate with a dynamic team passionate about AI/ML innovation.\n\nOpportunity to work with the latest Google Cloud technologies.\n\nReady to take the next step? Apply now and be part of a team that’s shaping the future of AI!\n\nBenefits\n\nSignificant career development opportunities exist as the company grows. The position offers a unique opportunity to be part of a small, fast-growing, challenging and entrepreneurial environment, with a high degree of individual responsibility.",
    "benefits": "n/a"
  },
  {
    "jobTitle": "AI GTM Analyst",
    "company": "Karbon",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4434e4117c77b9c6",
    "qualifications": "n/a",
    "salary": "$100,000 - $130,000 a year",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "About Karbon\n\nKarbon is the global leader in practice management software for growth-minded accounting firms. We provide an award-winning, highly collaborative cloud platform that streamlines work and communication, enabling the average accounting firm using Karbon to save 18.5 hours per week, per employee.\n\nWe have customers in 34 countries and have grown into a globally distributed team, with our people based throughout the US, Australia, New Zealand, Canada, the United Kingdom, and the Philippines. We are well-funded, ranked #1 on G2, have a fantastic team culture built on our values, are growing rapidly, and making a global impact.\n\nWe are seeking an AI and LLM-powered GTM Analyst/Lead to transform our go-to-market operations by applying advanced AI techniques to uncover and optimize the biggest revenue levers across inbound, outbound, and CSQL channels. This role prioritizes AI-driven analysis of conversion ratios, improving one key metric at a time to compound gains across the funnel. Through LLM-powered time studies and predictive modeling, this role will reveal how GTM teams allocate time, what activities drive customer health, and where AI automation can accelerate pipeline performance. This is initially a 6-month full-time position.\n\nKey Responsibilities\n\n1. AI-Driven Funnel Analysis & Lever Optimization (Primary Focus)\n\nUse AI-powered data analysis and LLM-enhanced dashboards to identify the most impactful conversion levers across inbound, outbound, and CSQL funnels.\n\nDevelop and test LLM-informed hypotheses to improve one ratio at a time (e.g., lead-to-opportunity or win rates).\n\nCollaborate with GTM and RevOps teams to operationalize AI-generated insights for measurable improvements.\n\n2. LLM-Powered Time Studies (Primary Focus)\n\nDeploy AI models and LLMs to analyze rep activity and time-to-serve by customer segment (e.g., <1-year vs. 1-year+ healthy accounts).\n\nIdentify repetitive or low-value tasks for automation using AI agents to improve efficiency and focus on high-value activities.\n\n3. Predictive Signal Layer Creation (Secondary Focus)\n\nUnify CRM, call, email, product usage, and enrichment data into an AI-driven predictive signal layer that surfaces intent, fit, and timing.\n\nTrain LLM-based scoring models to enhance account prioritization and sales targeting.\n\n4. Insight Automation with LLMs (Secondary Focus)\n\nUse LLMs and embeddings to turn Gong calls, notes, and emails into structured AI-extracted insights.\n\nAutomate AI-generated summaries of objections, next-best actions, and risk signals for pipeline forecasting.\n\n5. AI-Enabled Playbooks & Dynamic Collateral (Tertiary Focus)\n\nDeploy AI and LLM tools to automatically generate personalized collateral (emails, decks, and messaging) tailored to prospect profiles.\n\nImplement AI-driven workflows for prospecting, reactivation, and qualification in platforms like HubSpot and Clay.\n\nQualifications\n\nHands-on experience with AI, LLMs, and vector embeddings, including tools like OpenAI API, LangChain, or similar frameworks.\n\nProven ability to design, implement, and optimize AI workflows for GTM teams, including predictive modeling and automated insights.\n\nStrong understanding of data pipelines and unstructured data analysis (e.g., Gong call transcripts, email content) using LLM-based techniques.\n\nExpertise in applying LLMs for summarization, insight extraction, and next-best action recommendations within GTM contexts.\n\nFamiliarity with AI-powered automation platforms (e.g., HubSpot AI, Clay, or custom GPT-based agents).\n\nDeep knowledge of GTM tech stacks (e.g., Salesforce, Gong, HubSpot, Outreach) and experience leveraging AI integrations to extract maximum value from these tools.\n\nSolid grounding in GTM funnel metrics and the ability to apply AI analytics to improve conversion ratios sequentially.\n\nProficiency in SQL or Python for data manipulation and AI model integration is plus.\n\nWhy Work at Karbon\n\nGain global experience across the USA, Australia, New Zealand, UK, Canada and the Philippines\n\nExcellent benefits package including:\n\nPaid Flexible Time Off with an encouraged 3 weeks use per year\n\nCompany paid medical for you and eligible spouse/partner and dependents\n\nCompany paid dental and vision and eligible spouse/partner and dependents\n\nFully company funded short and long term disability\n\nFully company paid life insurance\n\n401(k) with company matching\n\nFlexible Spending Account\n\nUp to 8 weeks paid parental leave\n\nWork-from-home stipend\n\nWork with (and learn from) an experienced, high-performing team\n\nA collaborative, team-oriented culture that embraces diversity, invests in development and provides consistent feedback\n\nBe part of a fast-growing company that firmly believes in promoting high performers from within\n\nKarbon embraces diversity and inclusion, aligning with our values as a business. Research has shown that women and underrepresented groups are less likely to apply to jobs unless they meet every single criteria. If you've made it this far in the job description but your past experience doesn't perfectly align, we do encourage you to still apply. You could still be the right person for the role!\n\nWe recruit and reward people based on capability and performance. We don't discriminate based on race, gender, sexual orientation, gender identity or expression, lifestyle, age, educational background, national origin, religion, physical or cognitive ability, and other diversity dimensions that may hinder inclusion in the organization.\n\nGenerally, if you are a good person, we want to talk to you.\n\nIf there are any adjustments or accommodations that we can make to assist you during the recruitment process, and your journey at Karbon, contact us at people.support@karbonhq.com for a confidential discussion.\n\n\n\n\nAt this time, we request that agency referrals are not submitted for this position. We appreciate your understanding and encourage direct applications from interested candidates. Thank you!",
    "benefits": "Benefits\nPulled from the full job description\nWork from home stipend\nPaid parental leave\nParental leave\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\nShow more\n&nbsp;"
  },
  {
    "jobTitle": "Generative AI Specialist - Humanities (English and Italian)",
    "company": "Innodata Inc",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=7565d5d403d49bd7",
    "qualifications": "n/a",
    "salary": "$25 an hour",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Job Title: Generative AI Specialist - Humanities (English and Italian)\n\nLocation: Fully Remote within the U.S. (excluding Alaska, California, Colorado, Nevada, Puerto Rico)\n\nEmployment Type: Flexible Part-Time Role (part-time, up to 25 hours weekly)\n\nWho we are:\n\nInnodata (NASDAQ: INOD) is a leading data engineering company. With more than 2,000 customers and operations in 13 cities around the world, we are an AI technology solutions provider-of-choice for 4 out of 5 of the world’s biggest technology companies, as well as leading companies across financial services, insurance, technology, law, and medicine.\n\n\nBy combining advanced machine learning and artificial intelligence (ML/AI) technologies, a global workforce of subject matter experts, and a high-security infrastructure, we’re helping usher in the promise of AI. Innodata offers a powerful combination of both digital data solutions and easy-to-use, high-quality platforms.\n\n\nOur global workforce includes over 7,000 employees in the United States, Canada, United Kingdom, the Philippines, India, Sri Lanka, Israel and Germany. We’re poised for a period of explosive growth over the next few years.\n\n\nAbout the Role:\n\nAt Innodata, we’re partnering with the world’s leading technology companies to build the future of generative AI and large language models (LLMs). We’re on the lookout for smart, savvy, and curious Generative AI Specialist to join our global contributor community as part of our Subject Matter Expert (SME) on Demand program.\n\n\nThis is not a traditional full-time role. It’s a part-time, remote, flexible, project-specific opportunity designed for those who want to make a real impact—on their schedule. Whether you're a writer, linguist, educator, researcher, or just deeply passionate about language and logic, this role lets you contribute to cutting-edge AI development while maintaining control over your time.\n\n\nYou’ll be helping LLMs learn the intricacies of language and reasoning—not just how to write, but how to think. If you’ve ever dreamed of shaping the intelligence behind tomorrow’s technology, this is your chance.\n\n\nThis is more than just a gig—it’s a rare chance to help shape the future of AI from anywhere in the world, on your own terms.\n\n\nWhat You’ll Be Doing:\n\nCore tasks would include (any/multiple of) but not limited to the following:\n\nEvaluation: Rating/assessing the performance of AI models or algorithms based on their output or behavior through a set of evaluative questions.\n\nAnnotation Labeling: Labeling elements of a piece of content rather than the content as a whole.\n\nClassification: Assigning predefined categories or labels to items.\n\nContent Quality: Evaluating the perceived quality and/or appropriateness of content\n\nContent Understanding: Generating labels to advance understanding of a concept, trend etc.\n\nData Augmentation: Creation of additional training data for machine learning models by applying transformations to the original data, such as modifying images (rotation, flipping, cropping), generating new text (paraphrasing, summarization), or altering audio/video signals (speed modification, pitch shifting) to reduce overfitting and increase dataset diversity.\n\nGrading: Reviewing data and identifying whether or not a product feature works as intended based on the project's guidelines.\n\nIdentification Labeling: Labeling model outputs to identify if a piece of content is or isn't something. Examples: identify clickbait; identifying gaming videos; identifying branded content.\n\nPreference Ranking: Ordering or ranking items based on a set of preferences or criteria.\n\nPrompt Generation: Creating prompts or questions that will be used to generate responses from a language model or other AI system.\n\nRelevance Evaluation: Projects that evaluate the relevance of content based on a relevancy scale (1-3, 1-5, etc.).\n\nResponse Generation: Generating responses to prompts or questions using a language model or other AI system.\n\nResponse Rewrite: Rewriting existing text while preserving the original meaning, often to improve clarity or style and adherence to guidelines.\n\nResponse Summarization: Producing concise summaries of longer pieces of text or data.\n\nSimilarity Evaluation: Projects where content is compared in order to drive a determination.\n\nTranscription: Converting spoken language or audio content into written text.\n\nTranslation: Converting text or spoken language from one language to another.\n\nData Collection: Gathering and compiling various forms of data to be used for training, evaluating, or fine-tuning the AI models. This may include text, images, videos, audio files, or other types of digital content.\n\n\nMinimum Qualifications:\n\nA Bachelor’s degree or higher in a humanities specialization is required. Advanced degrees are strongly preferred (Master’s or PhD)\n\nProfessional or Expert level proficiency (C1/C2) in English and Italian\n\nHourly Range: $25.00 USD\n\nHourly rates at Innodata vary depending on a wide array of factors, which may include but are not limited to the role, skill set, educational background and geographic location.\n\nInnodata is an equal opportunity employer and values diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, disability status, or any other legally protected status.\n\nInnodata is committed to creating an inclusive environment for all employees and applicants. If you need assistance or accommodation during the application or recruitment process due to a disability, please contact us and we will be happy to assist.\n\nApplicants must be legally authorized to work in the United States at the time of hire. Innodata is unable to provide visa sponsorship now or in the future for this position.",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "n/a",
    "benefits": "n/a"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "qualifications": "n/a",
    "salary": "n/a",
    "requirements": "n/a",
    "mission_statement": "n/a",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights.\n\n\n\n\n\n\n\nKEY EXPECTATIONS\n\n\n\n\nWork with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\nMine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.\nAssess the effectiveness and accuracy of new data sources and data gathering techniques.\nDevelop custom data models and algorithms to apply to data sets.\nUse predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.\nDevelop company A/B testing framework and test model quality.\nCoordinate with different functional teams to implement models and monitor outcomes.\nDevelop processes and tools to monitor and analyze model performance and data accuracy.\n\n\nDESIRED SKILLS AND EXPERIENCE\n\n\n\n\nStrong problem-solving skills with an emphasis on product development.\nExperience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.\nExperience working with and creating data architectures.\nKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\nKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.\nExcellent written and verbal communication skills for coordinating across teams.\nA drive to learn and master new technologies and techniques.\n5-7 years of experience manipulating data sets and building statistical models.\nMaster’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools:\n\n\nCoding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.\nKnowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.\nExperience querying databases and using statistical computer languages: R, Python, SLQ, etc.\nExperience using web services: Redshift, S3, Spark, DigitalOcean, etc.\nExperience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.\nExperience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.\nExperience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.\nExperience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.\n\n\nEmployer’s Rights:\n\n\nPeoplevisor, LLC. has the right to revise this job description at any time. This job description is not a contract for employment. This job description does not list all the duties of the job. You may be asked by your supervisors or managers to perform other duties. You will be evaluated in part based upon your performance of the tasks listed in this job description.\n\n\nEqual Opportunity Statement:\n\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or status as a Vietnam or disabled veteran.\n\n\nApplications for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Peoplevisor, LLC.",
    "benefits": "n/a"
  }
]