[
  {
    "jobTitle": "Full Stack Data Scientist",
    "company": "Patriot Mobile",
    "jobLocation": "Grapevine, TX 76051",
    "jobUrl": "https://www.indeed.com/viewjob?jk=ce2c69b2b76169c2",
    "salary": "$90,000 - $160,000 a year - Full-time",
    "benefits": [
      "401(k)",
      "Dental insurance",
      "Health insurance",
      "Paid time off",
      "Vision insurance"
    ],
    "qualifications": [
      "Ability to quickly learn, analyze situations, and make decisions which support the mission of Patriot Mobile.",
      "Strong knowledge of SQL and relational databases.",
      "Ability to use Restful APIs to extract JSON data sets for processing into relational databases.",
      "Expertise in machine learning techniques, predictive modeling, clustering, and anomaly detection.",
      "Expertise in data visualization skills using tools like Tableau, Power BI, Metabase, etc...",
      "Proficient in data analysis development tools and languages such as Python and R.",
      "Knowledge of statistical methods, hypothesis testing, A/B testing, and experimental design.",
      "Strong problem-solving skills with the ability to debug and troubleshoot issues effectively.",
      "Ability to communicate complex technical insights to non-technical stakeholders.",
      "Collaborative mindset and experience working in cross-functional teams.",
      "Attention to detail and commitment to data quality."
    ],
    "description": "Patriot Mobile is seeking a Full Stack Data Scientist to join our technology team. The ideal candidate will process data from a variety of systems including telecom operations, call center management, marketing, web site analytics, and more to generate actionable insights, optimize telecom cost, enhance customer experience, and support strategic business decisions. You will work closely with engineering, product, and business teams to drive data-driven solutions across our services.",
    "preferences": [
      "Bachelor's degree in computer science, statistics, mathematics, or a related field from a regionally accredited college.",
      "Minimum of 3 years of experience as a Data Scientist or Data Analytics Engineer, preferably in telecom, networking, or related technology sectors.",
      "Familiarity with telecom-specific datasets (CDRs, network logs, device data, plan usage) is a plus."
    ],
    "responsibilities": [
      "Analyze large-scale telecom and call center datasets, including CDRs (Call Detail Records), call logs, agent performance data, and staffing data.",
      "Develop predictive and prescriptive models for customer churn, telecom cost optimization, usage forecasting, staffing optimization, and fraud detection.",
      "Implement machine learning algorithms, statistical models, and data mining techniques to extract insights and identify trends.",
      "Design and maintain scalable data pipelines for ingestion and transformation.",
      "Work with structured and unstructured data using SQL, Python, and modern ETL frameworks.",
      "Collaborate with cross-functional teams to design experiments, define KPIs, and provide actionable recommendations.",
      "Collaborate with DevOps and software engineering teams to integrate ML workflows into existing systems.",
      "Create dashboards, visualizations, and reports to communicate insights effectively to both technical and non-technical stakeholders.",
      "Stay up-to-date with industry trends, emerging technologies, and best practices in telecom analytics."
    ]
  },
  {
    "jobTitle": "Data - Data Scientist Mid Data Scientist Mid",
    "company": "Pyramid Consulting, Inc",
    "jobLocation": "Irving, TX 75063",
    "jobUrl": "https://www.indeed.com/viewjob?jk=84e2cd92ece761a3",
    "salary": "$60 - $65 an hour - Contract",
    "benefits": [
      "Pay Range: $60 - $65/hour.",
      "Employee benefits include, but are not limited to, health insurance (medical, dental, vision), 401(k) plan, and paid sick leave (depending on work location)."
    ],
    "qualifications": [
      "Overall experience is 7 to 8 years.",
      "3 years of experience with statistical data science techniques, feature engineering, customer segmentation etc.",
      "3 years of experience with SQL, PySpark and Python.",
      "3 years of experience training, evaluating and deploying Machine Learning models.",
      "3 years of experience with productionizing and deploying ML workloads in AWS/Azure.",
      "Familiarity with containerized application tooling and deployments (Docker/Kubernetes).",
      "Bachelor’s Degree or higher in Computer Science/Engineering/Math, or relevant experience.",
      "Experience with Databricks platform.",
      "Experience building ML models with large amounts of structured and unstructured data."
    ],
    "description": "Immediate need for a talented Data - Data Scientist Mid. This is a 12 months contract opportunity with long-term potential and is located in Irving, TX (Onsite).",
    "preferences": [],
    "responsibilities": [
      "Research, prototype, and develop AI solutions to build personalized systems.",
      "Build, deploy and analyze AI solutions and perform statistical experiments when deploying new AI products.",
      "Stay up to date with emerging technology and learn new technologies/libraries/frameworks.",
      "Learn and partner with peers across multiple disciplines, such as data, product, and systems design.",
      "Deliver on time with a high bar on quality of research, innovation and engineering."
    ]
  },
  {
    "jobTitle": "Senior Data Scientist - Optimization",
    "company": "Tiger Analytics",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9216e5a3f20fe686",
    "salary": "Full-time",
    "benefits": [
      "This position offers an excellent opportunity for significant career development in a fast-growing and challenging entrepreneurial environment with a high degree of individual responsibility.",
      "Tiger Analytics provides equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, pregnancy, national origin, ancestry, marital status, protected veteran status, disability status, or any other basis as protected by federal, state, or local law."
    ],
    "qualifications": [
      "Proven experience 10+ years working as a Data Scientist, with a focus on supply chain optimization and inventory allocation.",
      "MS or PhD in Computer Science, Operations Research, Applied Mathematics, Machine Learning, or a related field.",
      "Experience with using mathematical programming solvers such as Gurobi, Xpress MP, CPLEX, or Google OR Tools in applications.",
      "Solid understanding of statistical methods, optimization techniques, and predictive modelling concepts.",
      "Strong proficiency in programming languages such as Python, Pyspark and SQL, and experience working with data analysis and machine learning libraries.",
      "Ability to apply various analytical models to business use cases",
      "Exceptional communication and collaboration skills to understand business partner needs and deliver solutions and explain to business stakeholders."
    ],
    "description": "Tiger Analytics is pioneering what AI and analytics can do to solve some of the toughest problems faced by organizations globally. We develop bespoke solutions powered by data and technology for several Fortune 100 companies. We have offices in multiple cities across the US, UK, India, and Singapore, and a substantial remote global workforce. We are also market leaders in AI and analytics consulting in the CPG & retail industry with over 40% of our revenues coming from the sector. This is our fastest-growing sector, and we are beefing up our talent in the space. We are looking for a Senior Data Scientist with a good blend of data analytics background, practical experience in optimizing replenishment strategies and allocating resources within supply chains, and strong coding capabilities to add to our team.",
    "preferences": [],
    "responsibilities": [
      "Responsible for refactoring the Optimization algorithm written in Python using Object Oriented Programming",
      "Work on the latest applications of data science to solve business problems in the Supply chain and optimization space of Retail and/or CPG.",
      "Utilize advanced statistical techniques and data science algorithms to analyze large datasets and derive actionable insights related to replenishment optimization and inventory allocation.",
      "Develop and implement predictive models and optimization algorithms to improve inventory management, reduce stockouts, and optimize resource allocation across the supply chain.",
      "Collaborate with cross-functional teams to understand business requirements and translate them into data-driven solutions.",
      "Design and execute experiments to evaluate the effectiveness of different replenishment strategies and allocation policies.",
      "Monitor and analyze key performance indicators (KPIs) related to replenishment and supply chain allocation, and provide recommendations for continuous improvement.",
      "Stay abreast of industry trends and best practices in data science, replenishment optimization, and supply chain management, and leverage this knowledge to drive innovation within the organization.",
      "Collaborate, coach, and learn with a growing team of experienced Data Scientists."
    ]
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": [
      "HYBRID",
      "Competitive salary",
      "Opportunity for advancement",
      "Training & development"
    ],
    "qualifications": [
      "Bachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.",
      "Advanced experience in data science, machine learning, AI, or optimization projects.",
      "Proficiency in Python and SQL.",
      "Strong understanding of statistical methods, experimental design, and model validation.",
      "Experience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).",
      "Familiarity with data visualization tools (e.g., Tableau, Plotly, Streamlit)."
    ],
    "description": "No description provided",
    "preferences": [
      "Experience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).",
      "Exposure to specialized analytics areas such as simulation, graph analytics, or video analytics."
    ],
    "responsibilities": [
      "6+ years of experience in Machine Learning and Data Science.",
      "Strong understanding of Generative AI, Retrieval Augmented Generation, Agentic Workflow, Statistical methods, data structures, and algorithms.",
      "Strong programming skills in Python; experience with Machine Learning libraries and Generative AI frameworks (e.g., Pandas, NumPy, Matplotlib, Seaborn, TensorFlow, PyTorch, scikit-learn, LangChain) and LLMs.",
      "Experience developing and deploying AI solutions on cloud platforms (e.g., AWS, Azure, or GCP).",
      "Experience in building Asynchronous Python APIs.",
      "Experience with data visualization tools such as Matplotlib, Seaborn, or Tableau.",
      "Familiarity with cloud platforms such as AWS, Azure, or Google Cloud for deploying AI solutions.",
      "Proven experience in developing and deploying machine learning models in a production environment.",
      "Experience working with large datasets and performing data analysis."
    ]
  },
  {
    "jobTitle": "Sr. Staff Data Scientist, Machine Learning",
    "company": "Varo Bank",
    "jobLocation": "Hybrid work in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fcbae146e73f48b6",
    "salary": "$210,000 - $280,000 a year - Full-time",
    "benefits": [
      "For cash compensation, we set standard ranges for all US-based roles based on function, level, and geographic location, benchmarked against similar-stage growth companies. Per applicable law, the salary range for this role is $210,000 - $280,000. Final offer amounts are determined by multiple factors as well as candidate experience and expertise and may vary from the identified range.",
      "This role is also eligible for a bonus, equity, and competitive benefits."
    ],
    "qualifications": [
      "7+ years of experience in Analytics, Data Science or Data Engineering as an individual contributor",
      "An advanced degree in a quantitative field - computer science, engineering, statistics, operations research, economics, etc",
      "Credit and / or Fraud Risk modeling experience in consumer finance is nice to have",
      "Strong problem solving skills with an emphasis on translating real-life problems into a concrete model development strategy. Blend academic rigor with a sense of pragmatism for rapidly prototyping and delivering solutions",
      "Experienced in using Python for analysis and modeling",
      "Experience applying a wide range of statistical techniques to large data sets, and understanding their real-world advantages/drawbacks",
      "Experience using web services (AWS, GCP), and distributed data/computing tools (Spark, Map/Reduce, Hadoop, Hive, etc.)",
      "Excellent cross-functional communication skills",
      "Ability to thrive in a fast-paced environment"
    ],
    "description": "Varo is an entirely new kind of bank. All digital, mission-driven, FDIC insured and designed for the way our customers live their lives. A bank for all of us. Each member of the Data team plays an integral part of what we are building at Varo. We rely on advanced techniques in machine learning, cloud platforms and big data to drive decisions across the organization. If you are interested in working with an impressive team of Data pros who collaborate and challenge each other, and want to solve interesting problems to propel the company’s growth, apply now!",
    "preferences": [],
    "responsibilities": [
      "Develop custom models and algorithms to apply to large datasets, as well as, processes for monitoring and analyzing their performance",
      "Mine and analyze data from different resources, and use predictive modeling to increase and optimize customer experiences, customer acquisition, underwriting and other business outcomes",
      "Assess the effectiveness and accuracy of new data sources and data gathering techniques",
      "Understand and apply proper risk framework to your analysis and modeling.",
      "Work with stakeholders throughout the organization to identify opportunities for leveraging data to drive business decisions",
      "Collaborate cross functionally to implement models and monitor outcomes"
    ]
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": [
      "Remote First Culture",
      "Health Care Coverage*",
      "Education Reimbursement*",
      "Competitive Paid Time Off",
      "4 Self-Care Days per year",
      "National Holidays*",
      "2 Founder Days + Juneteenth Observed",
      "Paid Volunteer Time*",
      "Charitable contribution match*",
      "Monthly Wellness or Home Office Reimbursement*",
      "Access to Modern Health (mental health platform)",
      "Parental Leave*",
      "Retirement Plan with match/contribution*"
    ],
    "qualifications": [
      "Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.",
      "A strong understanding of the math and theory behind machine learning and deep learning.",
      "Software engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).",
      "Machine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).",
      "An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.",
      "Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.",
      "Excellent communication and teamwork skills.",
      "Fluent in written and spoken English."
    ],
    "description": "Machine Learning is integral to the continued success of our company. Our product roadmap is exciting and ambitious. You will join a global team of curious, helpful, and independent scientists and engineers, united by a commitment to deliver cutting-edge, well-engineered Machine Learning systems. You will work closely with product and engineering teams across Turnitin to integrate Machine Learning into a broad suite of learning, teaching and integrity products. We are in a unique position to deliver Machine Learning used by hundreds of thousands of instructors teaching millions of students around the world. Your contributions will have global reach and scale. Billions of papers have been submitted to the Turnitin platform, and hundreds of millions of answers have been graded on the Gradescope and Examsoft platforms. Machine Learning powers our AI Writing detection system, gives automated feedback on student writing, investigates authorship of student writing, revolutionizes the creation and grading of assessments, and plays a critical role in many back-end processes.",
    "preferences": [
      "Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.",
      "Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).",
      "Familiarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.",
      "Experience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).",
      "Showcase previous work (e.g. via a website, presentation, open source code)."
    ],
    "responsibilities": [
      "Work with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.",
      "Work with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.",
      "Answer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.",
      "Develop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.",
      "Utilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.",
      "Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.",
      "Optimize models for scaled production usage.",
      "Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.",
      "Write clean, efficient, and modular code, with automated tests and appropriate documentation.",
      "Stay up to date with technology, make good technological choices, and be able to explain them to the organization."
    ]
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Spectral MD Inc",
    "jobLocation": "Dallas, TX 75201 \n(Uptown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=f46871773389d191",
    "salary": "Full-time",
    "benefits": [],
    "qualifications": [
      "M.S. or Ph.D. in Computer Science, Electrical Engineering, Biomedical Engineering, Statistics, Applied Mathematics or related field.",
      "Strong foundation in state-of-the-art deep learning architectures (e.g., vision transformers) for computer vision tasks including image classification, object detection, and semantic segmentation.",
      "Proficiency in deep learning libraries and frameworks, including PyTorch and TensorFlow.",
      "Proficiency in C++ regarding object-oriented programming, data structure and performance optimization technique.",
      "Solid knowledge of model optimization techniques, such as pruning, quantization, mixed-precision inference, and other performance-enhancing strategies.",
      "Solid knowledge of model deployment tools, including ONNX, LibTorch, and TensorRT.",
      "Strong grasp of model evaluation metrics, benchmarking, and best practices for computer vision model validation.",
      "Self-driven with the ability to deliver on ambiguous projects with incomplete data.",
      "Excellent written communication skills, especially in writing technical manuscripts."
    ],
    "description": "We are seeking a motivated Data Scientist to research, develop, and enhance machine learning and deep learning algorithms that drive innovative healthcare solutions. This role involves maintaining high data quality standards, collaborating with clinical and business partners to understand their needs, and translating advanced research into practical applications. The ideal candidate will assist in building and improving deep learning frameworks, manage projects independently, and work effectively both individually and within cross-functional teams. Staying current with emerging technologies and demonstrating strong communication, attention to detail, and persistence are essential for success in this role.",
    "preferences": [
      "Experience and knowledge in healthcare domain with successful outcomes.",
      "Experience with CUDA programming for developing custom GPU kernels, optimizing computational performance, and accelerating deep learning workflows."
    ],
    "responsibilities": [
      "Research, develop, and enhance machine learning and deep learning algorithms and frameworks for computer vision applications, translating cutting-edge research into practical healthcare solutions.",
      "Implement and optimize deployment pipelines for trained models to enable efficient, scalable, and hardware-optimized inference.",
      "Apply model optimization techniques to reduce computational overhead while preserving accuracy.",
      "Maintain data quality and integrity across the data lifecycle to support robust algorithm development and model training.",
      "Collaborate with clinical partners and internal stakeholders to understand needs and deliver AI solutions that improve model performance.",
      "Assist in writing deep learning framework templates, identifying improvement areas, and implementing new model architectures.",
      "Manage projects independently and contribute effectively as part of a team, ensuring reproducible analyses, clear documentation, and knowledge sharing.",
      "Stay updated with the latest data science methods, technologies, and industry trends.",
      "Demonstrate strong communication skills, persistence, attention to detail, and a drive to complete research projects end-to-end."
    ]
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Spectral MD Inc",
    "jobLocation": "Dallas, TX 75201 (Uptown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=f1e2d3c4b5a67890",
    "salary": "Not specified",
    "benefits": [],
    "qualifications": [],
    "description": "No description provided",
    "preferences": [],
    "responsibilities": []
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Rhapsody",
    "jobLocation": "Hybrid work in Dallas, TX 75201",
    "jobUrl": "https://www.indeed.com/viewjob?jk=eb48d0156c9fa160",
    "salary": "Full-time",
    "benefits": [
      "Bachelor’s or Master’s degree in Data Science, Statistics, Computer Science, or a related field (or equivalent experience)"
    ],
    "qualifications": [
      "3+ years of experience in data science, machine learning, or applied analytics",
      "Strong Python skills (e.g., pandas, NumPy, matplotlib, scikit-learn)",
      "Strong data analysis skills, with experience exploring, interpreting, and extracting insights from complex datasets",
      "Familiarity with SQL",
      "Experience working with structured data and building basic models (e.g., classification, regression)",
      "Curiosity about AI/ML systems and a willingness to learn quickly through real-world application"
    ],
    "description": "About Rhapsody: We all know that our health care system is complicated. Getting data from one provider to another, or from a provider to a health insurance company, is frustrating for virtually everyone. Imagine developing solutions that help make these data transactions easier and faster. That is what we do at Rhapsody; we make interoperability platforms that allow data – such as patient encounter details, lab results, and billing information – to move seamlessly from one system to another. While most people will not ever see our products and services during a medical encounter, our interoperability platforms are running behind the scenes. Think of them as the central nervous system helping to move data where it needs to be to improve the patient experience. To learn more about Rhapsody, visit www.rhapsody.health If using your expertise in a way that impacts our health care system, patient care, and population health sounds like something you would find rewarding, apply today! This is a remote position. However, preference is for someone local to Dallas, TX.",
    "preferences": [
      "Exposure to evaluating or experimenting with neural networks",
      "Familiarity with model evaluation techniques (e.g., precision/recall, ROC, drift detection)",
      "Interest in or exposure to GenAI workflows (e.g., prompt evaluation, embedding inspection)",
      "Experience using tools like Jupyter, MLflow, Airflow, or analytics platforms"
    ],
    "responsibilities": [
      "Analyze outputs and feedback data from AI systems to identify quality gaps, failure patterns, and opportunities for improvement; help define signals and metrics that guide model refinement and evaluation",
      "Contribute to the development and evaluation of the patient matching system, including analysis of existing logic, feature design, model exploration, and performance improvement",
      "Build and evaluate predictive models for use cases such as churn, revenue forecasting, and risk scoring",
      "Collaborate on model evaluation pipelines for both structured ML and GenAI workflows",
      "Uncover patterns in data and identify opportunities where data science techniques can improve existing workflows or decision logic—even when the path isn’t strictly model-driven",
      "Analyze system behavior through performance metrics, interaction logs, and failure patterns to guide iteration",
      "Develop dashboards, reports, and datasets to inform AI, product, and business teams",
      "Collaborate with AI Engineers on LLM and GenAI-related initiatives",
      "Learn and apply best practices in testing, validation, and explainability for ML and AI-driven systems"
    ]
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "Not specified",
    "benefits": [],
    "qualifications": [
      "Strong quantitative skills"
    ],
    "description": "No description provided",
    "preferences": [],
    "responsibilities": []
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "salary": "Full-time",
    "benefits": [],
    "qualifications": [
      "Strong problem-solving skills with an emphasis on product development.",
      "Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.",
      "Experience working with and creating data architectures.",
      "Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.",
      "Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.",
      "Excellent written and verbal communication skills for coordinating across teams.",
      "A drive to learn and master new technologies and techniques.",
      "5-7 years of experience manipulating data sets and building statistical models.",
      "Master’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and is familiar with the following software/tools: Coding knowledge and experience with several languages: C, C++, Java, JavaScript, etc."
    ],
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights.",
    "preferences": [
      "Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.",
      "Experience querying databases and using statistical computer languages: R, Python, SLQ, etc.",
      "Experience using web services: Redshift, S3, Spark, DigitalOcean, etc.",
      "Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.",
      "Experience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.",
      "Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.",
      "Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc."
    ],
    "responsibilities": [
      "Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.",
      "Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.",
      "Assess the effectiveness and accuracy of new data sources and data gathering techniques.",
      "Develop custom data models and algorithms to apply to data sets.",
      "Use predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.",
      "Develop company A/B testing framework and test model quality.",
      "Coordinate with different functional teams to implement models and monitor outcomes.",
      "Develop processes and tools to monitor and analyze model performance and data accuracy."
    ]
  },
  {
    "jobTitle": "Sr. Data Scientist",
    "company": "Ample IT Services",
    "jobLocation": "Irving, TX 75038 \n(Cottonwood area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=74c7c15677c0991b",
    "salary": "Not specified",
    "benefits": [],
    "qualifications": [
      "Exp in ML, NLP, MLOps, & CI/CD, as well as expertise in Python, SQL, Kubernetes, & model monitoring tools like Grafana."
    ],
    "description": "Master's deg in Comp Sci, Data Sci, Engg, Tech or related field, along with 2 yrs of exp in dvlp & producing Machine Learning (ML) & ntrl lang processing (NLP) models. The role involves deploying models in Kubernetes with CI/CD pipelines, apply MLOps practices & performing advanced data analysis using Python & SQL to address biz challenges.",
    "preferences": [],
    "responsibilities": [
      "Responsibilities include building real-time ML pipelines with Spark & Airflow, measuring & improving NLP model performance, & using AI to drive forecasting & biz insights."
    ]
  },
  {
    "jobTitle": "AI/ML and Data Scientist",
    "company": "RisamSoft",
    "jobLocation": "Irving, TX 75063 \n(Freeport/Hackberry area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=ebf80c00df9c0209",
    "salary": "Not specified",
    "benefits": [],
    "qualifications": [
      "Master's degree in Computer Science, Statistics, Mathematics, Physics, or a related field.",
      "4+ years of experience as a data scientist or related role.",
      "Strong proficiency in Python and other relevant programming languages (e.g., R, Java, Scala).",
      "Experience with machine learning libraries and frameworks (e.g., TensorFlow, PyTorch, scikit-learn).",
      "Excellent data wrangling and manipulation skills.",
      "Experience with cloud platforms (e.g., AWS, Azure) is a plus.",
      "Strong communication and collaboration skills.",
      "Ability to translate technical concepts into easily understandable terms.",
      "Passion for learning and staying up-to-date with the latest advancements in AI/ML."
    ],
    "description": "Risamsoft is a technology company that seeks talented and motivated individuals to join its team. We are passionate about using cutting-edge technology to solve real-world problems and believe in teamwork, diversity, and lifelong learning. We offer a variety of opportunities for professionals of all levels, from entry-level to senior management. Whether you are a seasoned expert or just starting out, we will provide you with the support and resources you need to succeed. At Risamsoft, your adventure starts right now. Join us and make a difference!",
    "preferences": [],
    "responsibilities": [
      "Define and execute data science projects aligned with business objectives.",
      "Acquire and clean data from various sources, ensuring data quality and integrity.",
      "Explore, analyze, and visualize data to identify trends, patterns, and insights.",
      "Develop and implement machine learning models using various algorithms and techniques.",
      "Evaluate and optimize model performance using appropriate metrics.",
      "Deploy models into production and monitor their performance for continuous improvement.",
      "Communicate complex data insights and findings to technical and non-technical audiences.",
      "Collaborate with cross-functional teams to ensure successful project implementation.",
      "Stay up-to-date with the latest advancements in AI/ML and data science."
    ]
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Cyborgwave",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=6f19577a289a0792",
    "salary": "Not specified",
    "benefits": [],
    "qualifications": [],
    "description": "We are hiring a data scientist to analyze complex datasets, develop machine learning models, and derive actionable insights. The ideal candidate should have expertise in statistical analysis, programming languages like R or Python, and experience with machine learning frameworks such as TensorFlow or PyTorch.",
    "preferences": [],
    "responsibilities": [
      "Analyze large datasets to extract valuable insights and trends, using statistical techniques, machine learning algorithms, and data visualization tools.",
      "Develop predictive models and algorithms to solve complex business problems and optimize decision-making processes.",
      "Design and implement data pipelines for data acquisition, preprocessing, transformation, and storage, ensuring data quality and integrity.",
      "Collaborate with cross-functional teams to identify analytical requirements, define project objectives, and deliver actionable recommendations.",
      "Stay updated with the latest advancements in data science, machine learning, and big data technologies, applying new methodologies to enhance analysis.",
      "Communicate findings and insights effectively to non-technical stakeholders through reports, presentations, and data visualizations.",
      "Conduct exploratory data analysis to identify patterns, correlations, and anomalies in data, driving data-driven decision-making within the organization.",
      "Apply data mining techniques to discover hidden patterns and relationships in data, uncovering valuable insights for business improvement.",
      "Optimize model performance through iterative experimentation, feature engineering, and hyperparameter tuning, ensuring robustness and scalability.",
      "Collaborate with IT teams to deploy and integrate machine learning models into production systems, monitoring performance and making necessary improvements."
    ]
  },
  {
    "jobTitle": "Data Scientist",
    "company": "SelectMinds",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4a0298aaaa5bdf3e",
    "salary": "Contract",
    "benefits": [],
    "qualifications": [
      "Bachelor’s degree in data science, data analytics, or related field",
      "Master’s degree or Ph.D. in a quantitative field, such as statistics, computer science, mathematics, or engineering",
      "Proficiency in Python, Java, or Kotlin",
      "Knowledge of data science toolkits such as R, NumPy, and MatLab",
      "Experience with big data analytics technologies such as Spark and Hadoop",
      "Experience with data visualization tools such as D3.js and Tableau",
      "Expertise in data mining and machine learning",
      "Working knowledge of statistical models and business intelligence",
      "Familiarity with cloud-based infrastructure",
      "Ability to store and process unstructured data with NoSQL databases and machine learning models."
    ],
    "description": "We are seeking a data scientist to join our business intelligence team to help us make better business decisions based on our data. The ideal candidate will have a working knowledge of statistics, mathematics, and data science programming languages (e.g., SQL, R, Python). Your primary responsibilities will be performing statistical analyses, running custom SQL queries, and identifying patterns and trends that can improve our products’ and services’ efficiency and usability. You will also be expected to maintain and improve our data infrastructure and tools.",
    "preferences": [],
    "responsibilities": [
      "Formulates and leads guided, multifaceted analytic studies against large volumes of data.",
      "Interprets and analyzes data using exploratory mathematic and statistical techniques based on the scientific method.",
      "Coordinates research and analytic activities utilizing various data points (unstructured and structured) and employ programming to clean, massage, and organize the data.",
      "Experiments against data points, provide information based on experiment results and provide previously undiscovered solutions to command data challenges.",
      "Leads all data experiments tasked by the Data Science Team.",
      "Coordinates with Data Engineers to build data environments providing data identified by Data Analysts, Data Integrators, Knowledge Managers, and Intel Analysts.",
      "Develops methodology and processes for prioritization and scheduling of projects.",
      "Analyzes problems and determines root causes.",
      "Defines company data assets (data models), spark, sparkSQL, and hiveSQL jobs to populate data models.",
      "Works closely with all business units and engineering teams to develop strategy for long term data platform architecture."
    ]
  },
  {
    "jobTitle": "Senior Engineer - AI/ML/Data Scientist",
    "company": "Fission Labs",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=5c80d8dab82627ea",
    "salary": "Full-time",
    "benefits": [
      "BRING YOUR PASSION AND FUN. Corporate culture woven from highly diverse perspectives and insights.",
      "BALANCE WORK AND PERSONAL TIME LIKE A BOSS. Resources and flexibility to more easily integrate your work and your life.",
      "BECOME A CERTIFIED “SMARTY PANTS.” Ongoing training and development opportunities for even the most insatiable learner.",
      "START-UP SPIRIT (Good ten plus years, yet we maintain it)",
      "FLEXIBLE WORKING HOURS"
    ],
    "qualifications": [
      "Bachelor's or Master's degree in Computer Science, Engineering, Mathematics, or related fields.",
      "4 to 10 years of experience in building AI models with NLP and data engineering.",
      "Strong programming skills in Python, and familiarity with libraries such as PyTorch, TensorFlow, and Scikit-Learn.",
      "Solid understanding of machine learning concepts, algorithms, and statistical methods. Experience with data preprocessing, cleaning, and feature engineering techniques.",
      "Strong analytical and problem-solving skills, with attention to detail.",
      "Excellent communication skills, with the ability to present complex technical concepts to both technical and non-technical audiences."
    ],
    "description": "No description provided",
    "preferences": [
      "Experience with cloud-based machine learning platforms and services, such as AWS Sage Maker or Google Cloud ML Engine.",
      "Knowledge of distributed computing, parallel processing, and big data technologies such as Spark and Hadoop.",
      "Familiarity with natural language processing techniques and tools, such as spaCy and NLTK.",
      "Experience with containerization and orchestration technologies such as Docker and Kubernetes."
    ],
    "responsibilities": [
      "3+ years with AI / ML /data-platform products. should be more like,\"experience with taking an AI product/platform from ideation to market\" or similar. GenAI is also MUST HAVE.",
      "Design and develop AI models and algorithms using machine learning techniques and tools, with a focus on NLP.",
      "Work with large datasets, including cleaning, preprocessing, and transforming data to ensure its quality and relevance.",
      "Collaborate with cross-functional teams to identify and understand business requirements, use cases, and project objectives.",
      "Implement and integrate machine learning models into production systems and workflows, and optimize their performance.",
      "Develop tools and frameworks for automating the data engineering process, data ingestion, and feature engineering.",
      "Stay up-to-date with the latest research and industry trends in machine learning and NLP, and apply them to improve our models and solutions.",
      "Document and communicate technical specifications, algorithms, and results to both technical and non-technical stakeholders."
    ]
  }
]