[
  {
    "jobTitle": "Data Scientist",
    "company": "Scalable Systems",
    "jobLocation": "Addison, TX 75001",
    "jobUrl": "https://www.indeed.com/viewjob?jk=789b20dee7d0ba72",
    "salary": "$56.02 - $67.47 an hour - Contract",
    "benefits": "Not specified",
    "qualifications": "· 7+ years of experience as Data Scientist or related roles; · Bachelor’s degree in Computer Science, or a related technical field; · Deep understanding and some exposure to new Gen AI Open-source Models; · At least 5 years programming experience in software development and Agile process; · At least 5 years Python (or equivalent) programming experience to work with ML/NLP models.; · Experience in setting up supervised unsupervised learning ML/NLP models including data cleaning, data analytics, feature creation, model selection ensemble methods, performance metrics visualization; · Experience in ML/NLP development pipelines of large data sets, both structured unstructured; · At least 2 years’ experience in designing and developing enterprise-scale ML/NLP solutions in one or more of: Named Entity Recognition, Document Classification, Document Summarization, Topic Modelling, Dialog Systems, Sentiment Analysis, OCR text processing; · Knowledge and hands-on experience working with OCR products; DESIRED SKILLS / EXPERIENCE; · Master’s degree in Computer Science/Data Science, or a related technical field; · Collaborating with a diverse set of partners and stakeholders from various Line of Business.; · Highly motivated, proactive and a self-starter; strong sense of ownership ability to create and execute plans without daily oversight; · Critical thinker; ability to analyze problems and identify issues and provide solutions; · Ability to navigate the enterprise data assets across multiple functions.; · Highly organized. Effectively prioritizes and balances multiple efforts in a fast-paced environment; · Excellent communication and Presentation skills; · Analytical abilities great problem solving; · Client focused; Job Type: Contract; Pay: $56.02 - $67.47 per hour",
    "description": "POSITION SUMMARY · We’re looking for a Data Scientist who can be responsible for designing, building and maintaining document capture applications. The ideal candidate will have a solid background in software engineering with experience in building Machine Learning NLP Models and good familiarity with Gen AI Models. EDUCATION · Provide Bachelor's degree information · Education should always have at the least: Degree, Major, University Name, Date of Graduation...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Engineer (Hybrid)",
    "company": "Trace3",
    "jobLocation": "Hybrid work in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=4ebc9228840270ab",
    "salary": "$65 - $70 an hour - Full-time, Contract",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nHealth savings account\nDental insurance\nLife insurance\nShow more\n&nbsp;",
    "qualifications": "Position Overview; As a Data Engineer, you will be responsible for the development, optimization, and management of data ingestion, transformation, and storage processes using modern frameworks. The successful candidate will implement infrastructure-as-code and automation solutions to streamline and build resiliency into data processing workflows. You will work closely with our data science and analytics teams to create and optimize data and machine learning models that support stakeholder needs. This is a 6 month contract with the hopes to convert to a full-time employee.; *** US Citizenship is required for this role ***; Bachelor's degree in Computer Science, Information Technology, or related field (or equivalent combination of education and experience); 7+ years of experience in data engineering, software development, or a related field; Strong programming skills in languages such as Python and Terraform; Strong understanding of data architecture, data modeling, and data warehousing concepts; Experience with data pipeline tools such as Apache Spark, Apache Kafka, AWS Kinesis; Experience with Artificial Intelligence and Machine Learning technologies; Strong understanding of data security and compliance principles and practices; Excellent problem-solving skills, with the ability to analyze complex data systems and identify areas for improvement; Strong communication and collaboration skills, with the ability to work effectively with cross-functional teams; Desired Skills:; Experience with cloud-based data platforms such as AWS and Azure; Experience with agile development methodologies and version control systems such as Git; Experience with data visualization tools such as Tableau and Cognos Analytics; Familiarity with OpenTelemetry standards; Optimization for observability data and real time anomaly detections; The Perks; Comprehensive medical, dental and vision plans for you and your dependents; 401(k) Retirement Plan with Employer Match, 529 College Savings Plan, Health Savings Account, Life Insurance, and Long-Term Disability; Competitive Compensation; Training and development programs; Stocked kitchen with snacks and beverages; Collaborative and cool culture; Work-life balance and generous paid time off; Our Commitment; At the core of Trace3's DNA is our people. We are a diverse group of talented individuals who understand the importance of teamwork and demonstrating leadership, character, and passion in all that we do.; We're committed to fostering an inclusive workplace where everyone feels respected, valued, and empowered to grow. We recognize that embracing diversity drives innovation, improves outcomes, fosters collaboration, boosts teammate satisfaction, and builds a more inclusive culture.; Any demographic information provided is strictly voluntary, kept confidential in accordance with Equal Employment Opportunity (EEO) regulations, and will not be used in employment decisions, including hiring, promotions, or mentorship programs. We are committed to providing equal employment opportunities for all.; If you require a reasonable accommodation to complete the application process or participate in an interview, please email recruiting@trace3.com.",
    "description": "Who is Trace3? Trace3 is a leading Transformative IT Authority, providing unique technology solutions and consulting services to our clients. Equipped with elite engineering and dynamic innovation, we empower IT executives and their organizations to achieve competitive advantage through a process of Integrate, Automate, Innovate. Our culture at Trace3 embodies the spirit of a startup with the advantage of a scalable business. Employees can grow their career and have fun while doing it! Trace3 is headquartered in Irvine, California. We employ more than 1,200 people all over the United States. Our major field office locations include Denver, Indianapolis, Grand Rapids, Lexington, Los Angeles, Louisville, Texas, San Francisco. Ready to discover the possibilities that live in technology?...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Select Minds LLC",
    "jobLocation": "Hybrid work in Dallas, TX 75235",
    "jobUrl": "https://www.indeed.com/viewjob?jk=c2b0c16c74d00cd6",
    "salary": "$65 - $75 an hour - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\n&nbsp;",
    "qualifications": "Education; Bachelor's degree in Mathematics, Computer/Data Science, Information Technology, or a related field, or equivalent experience.; Experience; Advanced experience in data science, machine learning, AI, or optimization projects.; Proficiency in Python and SQL.; Strong understanding of statistical methods, experimental design, and model validation.; Experience with data pipelines and relevant programming libraries (e.g., Pandas, NumPy, Scikit-learn, XGBoost, TensorFlow, Pyspark).; Familiarity with data visualization tools (e.g., Tableau, Plotly, Streamlit).",
    "description": "Benefits: HYBRID Competitive salary Opportunity for advancement Training & development...",
    "preferences": "Experience with AWS cloud services (e.g., SageMaker, Lambda, Glue, EMR).; Exposure to specialized analytics areas such as simulation, graph analytics, or video analytics.; Skills & Abilities; Ability to independently manage and deliver on complex projects.; Strong problem-solving and critical thinking skills.; Effective communication skills for both technical and executive audiences.; Ability to adapt quickly to changing priorities and new technologies.; Strong interpersonal and collaboration skills.; ....."
  },
  {
    "jobTitle": "Data Science Subject Matter Experts",
    "company": "Zion Zest LLC",
    "jobLocation": "Dallas, TX 75244",
    "jobUrl": "https://www.indeed.com/viewjob?jk=34f39dba2736a427",
    "salary": "$180,000 - $250,000 a year - Full-time, Contract",
    "benefits": "Benefits\nPulled from the full job description\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nDental insurance\n&nbsp;",
    "qualifications": "Train junior Data Science Engineers and help them with programming.; Proficiency in programming languages such as C and VBA for data manipulation and analysis.; Strong knowledge of SQL for database querying and management.; Experience with linked data concepts and analytics tools.; Familiarity with machine learning frameworks (e.g., TensorFlow, PyTorch) is a plus.; Demonstrated ability in data mining techniques for extracting insights from large datasets.; Excellent problem-solving skills with a keen analytical mindset.; Strong communication skills, both written and verbal, for effective collaboration across teams.",
    "description": "Overview We are seeking a skilled and motivated Data Scientist to join our dynamic team. In this role, you will leverage your expertise in data analytics, machine learning, and statistical modeling to extract valuable insights from complex datasets. You will work collaboratively with cross-functional teams to drive data-driven decision-making and contribute to innovative projects that enhance our business strategies. Responsibilities SME Expertise: Seek out an SME with in-depth knowledge of data science concepts (e.g., machine learning, statistical modeling, programming languages like Python or R) and practical experience in applying these within a business context. Passion for Teaching: The SME should be passionate about teaching and able to simplify complex concepts for different learning levels within the organization....",
    "preferences": "Join us in harnessing the power of data to drive innovation and success!; Job Types: Full-time, Contract; Pay: $180,000.00 - $250,000.00 per year"
  },
  {
    "jobTitle": "Data Scientist with Big Data",
    "company": "Sonoma Consulting Inc.",
    "jobLocation": "Plano, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=98e1765874f056f1",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Must Haves:; Strong quantitative skills",
    "description": "Job Description Job Description: Important Note: Candidates should have the following experience POSITION SUMMARY – Reason for contingent headcount?...",
    "preferences": "Additional Information; All your information will be kept confidential according to EEO guidelines."
  },
  {
    "jobTitle": "Senior Machine Learning Scientist (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=78cca8f380fd5ea5",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "We expect Senior Machine Learning Scientists to be versatile and have a well-balanced set of skills. You will focus on model training and maintenance with significant capacity for research (developing novel model architectures), dataset construction, and model hardening (preparing the model and code for production pipelines).; Day-to-day, your responsibilities are to:; Work with subject matter experts and product owners to determine what questions should be asked and what questions can be answered.; Work with subject matter experts to curate, generate, and annotate data, and create optimal datasets following responsible data collection and model maintenance practices.; Answer questions and make trainable datasets from raw data, using efficient SQL queries and scripting languages, visualizing when necessary.; Develop and tune Machine Learning models, following best practices to select datasets, architectures, and model parameters.; Utilize, adopt, and fine-tune Language Models, including third-party LLMs (through prompt engineering and orchestration) and locally hosted LMs.; Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.; Optimize models for scaled production usage.; Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.; Write clean, efficient, and modular code, with automated tests and appropriate documentation.; Stay up to date with technology, make good technological choices, and be able to explain them to the organization.; Experience working with text data to build Deep Learning and ML models, both supervised and unsupervised. Experience with deep learning in other modalities such as vision and speech would be a strong bonus.; A strong understanding of the math and theory behind machine learning and deep learning.; Software engineering background with at least 8 years of experience (we use Python, SQL, Unix-based systems, git, and github for collaboration and review).; Machine / Deep Learning development skills, including experiment tracking (we use AWS SageMaker, Hugging Face, transformers, PyTorch, scikit-learn, Jupyter, Weights & Biases).; An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.; Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field, with relevant industry experience, or outstanding previous achievements in this role. A Computer Science background is required as opposed to statistics or pure mathematics. We’re an applied science group leaning towards deep learning and therefore software development proficiency is a prerequisite.; Excellent communication and teamwork skills.; Fluent in written and spoken English.; Would be a plus:; Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.; Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).; Familiarity in building front-ends (LLMs or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.; Experience with advanced prompting, fine-tuning or training an LLM, open-source or cloud, using industry accepted platforms (such as mosaic.ai or stochastic.ai).; Showcase previous work (e.g. via a website, presentation, open source code).; Additional Information; Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "description": "Company Description When you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education. Turnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines. Turnitin, LLC is an equal opportunity employer- vets/disabled....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Senior Machine Learning Scientist - Applied Research (USA Remote)",
    "company": "Turnitin, LLC",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fa7309553094efc6",
    "salary": "$111,000 - $185,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nTuition reimbursement\nParental leave\nHealth insurance\nRetirement plan\nPaid time off\n&nbsp;",
    "qualifications": "We’re an applied science group leaning towards modern Deep Learning. We expect our Senior Machine Learning Scientists to have a well-balanced set of skills, both in the Science as well as Software Engineering aspects of (Deep) Machine Learning. You will focus on developing novel and deployable ML models and solutions where no ready-made solution may be available. Therefore you need to be conversant enough with the mathematics of machine learning and deep neural networks such that you can construct novel model architectures, loss functions, training methods, training loops etc. You are also expected to keep abreast of the latest research advancements in AI and Deep Learning across modalities and apply those to your work. While we leverage ready-made training platforms, we also write our own training loops. Additionally, the models need to be directly deployable in our products, therefore, production level coding and software engineering proficiency is required. You may train large models (up to 100s of billions of parameters) therefore, ability to train on multiple GPUs and nodes and knowledge of the latest model training and inferencing advancements is necessary. Next, the models must perform well in production not only in terms of accuracy but also compute-cost. Delivering such software requires a sufficiently deep Computer Science background. Dataset exploration, generation (synthetic), design, construction and analysis, are a routine part of the job and may occupy a significant fraction of your time. Also, datasets can be large (billions of samples), therefore the ability to write parallel and efficient pipelines is a necessary skill. You will also be involved in code & model maintenance, code hardening (preparing the model and code for production pipelines), developing and staging demos and presenting your work within the company as well as via publications in peer reviewed venues (preferably A/A+ rated).; Day-to-day, your responsibilities are to:; Research and develop production grade Machine Learning models as described above. Optimize models for scaled production usage.; Work with colleagues in the AI team, other Engineering teams, subject matter experts, Product Management, Marketing, Sales and Customer support to explore ongoing product issues, challenges and opportunities and then recommend innovative ML/AI based solutions.; Help out with ad-hoc one-off tasks as a team player within the AI team.; Work with subject matter experts to curate and generate optimal datasets following responsible data collection and model maintenance practices. Explore and access SQL, no-SQL and web data and write efficient parallel pipelines. Review and design datasets to ensure data quality.; Investigate weaknesses of models in production and work on pragmatic solutions.; Utilize, adopt, and fine-tune off the shelf models, including LLMs exposed via API (through prompt engineering and agents) and locally hosting LMs and other foundation models.; Stay current in the field - read research papers, experiment with new architectures and LLMs, and share your findings.; Write clean, efficient, and modular code with automated tests and appropriate documentation.; Stay up to date with technology and platforms, make good technological choices, and be able to explain them to the organization.; Work with downstream teams to productionize your work and ensure that it makes into a product release.; Communicate insights, as well as the behavior and limitations of models, to peers, subject matter experts, and product owners.; Present and publish your work.; Master's degree or PhD in Computer Science, Electrical Engineering, AI, Machine Learning, applied math or related field or outstanding previous achievements demonstrating excellence in Deep Machine Learning, Computer Science and Software Engineering.; At least 5 years of industry experience in Machine / Deep Learning (we use the python ecosystem for ML), Computer Science and Software Engineering.; A strong understanding of the math and theory behind machine learning and deep learning is a prerequisite.; Academic publications in peer reviewed conferences or journals related to Machine Learning - preferably A/A+ rated such as NeurIPS, ICML, ICLR, AAAI, TMLR, JMLR, IJCAI, ICANN, KDD, ACL, EMNLP, NAACL, COLING, CVPR, ICCV, ECCV, IEEE etc.; Machine / Deep Learning development skills, including popular platforms (we use AWS SageMaker, Hugging Face, Transformers, PyTorch, PyTorch Lightning, Ray, scikit-learn, Jupyter, Weights & Biases etc.).; An understanding of Language Models, using and training / fine-tuning and a familiarity with industry-standard LM families.; Excellent communication and teamwork skills.; Fluent in written and spoken English.; Would be a plus:; Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "description": "Company Description When you join Turnitin, you'll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education. Turnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines. Turnitin, LLC is an equal opportunity employer- vets/disabled....",
    "preferences": "Familiarity in building front-ends (Gradio, Streamlit, Dash or more standard React, Javascript, Flask) for simple demos, POCs and prototypes.; Experience with advanced prompting / agentic-systems and fine-tuning or training an LLM, using industry accepted platforms.; Showcase previous work (e.g. via a website, presentation, open source code).; Familiarity in coding for at-scale production, ranging from best practices to building back-end API services or stand-alone libraries.; Essential dev-ops skills (we use Docker, AWS EC2/Batch/Lambda).; Additional Information"
  },
  {
    "jobTitle": "Sr. Staff Data Scientist, Machine Learning",
    "company": "Varo Bank",
    "jobLocation": "Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=fcbae146e73f48b6",
    "salary": "$210,000 - $280,000 a year - Full-time",
    "benefits": "Not specified",
    "qualifications": "About Varo; Varo launched in 2017 with the vision to bring the best of fintech into the regulated banking system. We’re a new kind of bank – all-digital, mission-driven, FDIC-insured, and designed around the modern American consumer.; As the first consumer fintech to be granted a national bank charter in 2020, we make financial inclusion and opportunity for all a reality by empowering everyone with the products, insights, and support they need to get ahead. Through our core product offerings and suite of customer-first features, we aim to address a broad range of consumer needs while profitably serving underserved communities that have been historically excluded from the traditional financial system.; Learn more about Varo by following us:; Facebook - https://www.facebook.com/varomoney; Instagram - www.instagram.com/varobank; LinkedIn - https://www.linkedin.com/company/varobank; Varo is an equal opportunity employer. Varo embraces diversity and we are committed to building teams that represent a variety of backgrounds, perspectives, and skills. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.; Beware of fraudulent job postings!; Varo will never ask for payment to process documents, refer you to a third party to process applications or visas, or ask you to pay costs. Never send money to anyone suggesting they can provide work with Varo. If you suspect you have received a phony offer, please e-mail careers@varomoney.com with the pertinent information and contact information.; CCPA Notice at Collection for California Employees and Applicants:; https://www.varomoney.com/privacy-legal/",
    "description": "Varo is an entirely new kind of bank. All digital, mission-driven, FDIC insured and designed for the way our customers live their lives. A bank for all of us. Each member of the Data team plays an integral part of what we are building at Varo. We rely on advanced techniques in machine learning, cloud platforms and big data to drive decisions across the organization. If you are interested in working with an impressive team of Data pros who collaborate and challenge each other, and want to solve interesting problems to propel the company’s growth, apply now! What you'll be doing Develop custom models and algorithms to apply to large datasets, as well as, processes for monitoring and analyzing their performance Mine and analyze data from different resources, and use predictive modeling to increase and optimize customer experiences, customer acquisition, underwriting and other business outcomes...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Spectral MD Inc",
    "jobLocation": "Dallas, TX 75201 \n(Uptown area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=f46871773389d191",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "M.S. or Ph.D. in Computer Science, Electrical Engineering, Biomedical Engineering, Statistics, Applied Mathematics or related field.; Knowledge, Skills, and Abilities:; Strong foundation in state-of-the-art deep learning architectures (e.g., vision transformers) for computer vision tasks including image classification, object detection, and semantic segmentation.; Proficiency in deep learning libraries and frameworks, including PyTorch and TensorFlow.; Proficiency in C++ regarding object-oriented programming, data structure and performance optimization technique.; Solid knowledge of model optimization techniques, such as pruning, quantization, mixed-precision inference, and other performance-enhancing strategies.; Solid knowledge of model deployment tools, including ONNX, LibTorch, and TensorRT.; Strong grasp of model evaluation metrics, benchmarking, and best practices for computer vision model validation.; Self-driven with the ability to deliver on ambiguous projects with incomplete data.; Excellent written communication skills, especially in writing technical manuscripts.; Bonus:; Experience and knowledge in healthcare domain with successful outcomes.; Experience with CUDA programming for developing custom GPU kernels, optimizing computational performance, and accelerating deep learning workflows.; Prolonged periods of sitting at a desk and working on a computer.; Travel:; N/A; Equal Employment Opportunity:; Spectral MD, Inc. is an equal opportunity and affirmative action employer. All applicants will be considered for employment without regard to race, color, ancestry, national origin, sex, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing, protected veteran status, or any other characteristic protected by applicable federal, state or local laws.",
    "description": "Position Summary: We are seeking a motivated Data Scientist to research, develop, and enhance machine learning and deep learning algorithms that drive innovative healthcare solutions. This role involves maintaining high data quality standards, collaborating with clinical and business partners to understand their needs, and translating advanced research into practical applications. The ideal candidate will assist in building and improving deep learning frameworks, manage projects independently, and work effectively both individually and within cross-functional teams. Staying current with emerging technologies and demonstrating strong communication, attention to detail, and persistence are essential for success in this role. Essential Duties and Responsibilities: Research, develop, and enhance machine learning and deep learning algorithms and frameworks for computer vision applications, translating cutting-edge research into practical healthcare solutions. Implement and optimize deployment pipelines for trained models to enable efficient, scalable, and hardware-optimized inference....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Engineer",
    "company": "Rapideagle",
    "jobLocation": "Plano, TX 75023",
    "jobUrl": "https://www.indeed.com/viewjob?jk=632b61b982c7cb54",
    "salary": "$57.52 - $69.27 an hour - Full-time, Contract",
    "benefits": "Benefits\nPulled from the full job description\nHealth insurance\nPaid time off\nDental insurance\n&nbsp;",
    "qualifications": "Not specified",
    "description": "Job Overview We are seeking a skilled and motivated Data Engineer to join our dynamic team. The ideal candidate will be responsible for designing, developing, and maintaining robust data pipelines and architectures that support our data-driven decision-making processes. This role requires a strong understanding of big data technologies and cloud-based solutions, particularly within the Azure ecosystem. Duties Develop and maintain scalable data pipelines using Azure Data Lake and Hadoop to support large-scale data processing. Collaborate with data scientists and analysts to facilitate model training and ensure data availability for analysis....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Senior Data Scientist (GenAI)",
    "company": "Tiger Analytics",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=de6b428ed3f01987",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "8 years of experience working as a GenAI Data Science.; Experience with Python from a functional programming paradigm, able to manage dependencies and virtual environments, along with version control in git; Experience with sequential algorithms (e.g., LSTM, RNN, transformer, etc.); Experience with Bedrock, JumpStart, HuggingFace; Experience evaluating ethical implications of AI and controlling for them (e.g., red-teaming); Expertise in supervised learning and unsupervised learning along with experience in deep learning and transfer learning; Experience in generative algorithms (e.g., GAN, VAE, etc.) as well as pre-trained models (e.g., LLaMa, SAM, etc.); Experience developing models from inception to deployment",
    "description": "Tiger Analytics is looking for experienced Data Scientists to join our fast-growing advanced analytics consulting firm. Our consultants bring deep expertise in Data Science, Machine Learning and AI. We are the trusted analytics partner for multiple Fortune 500 companies, enabling them to generate business value from data. Our business value and leadership has been recognized by various market research firms, including Forrester and Gartner. We are looking for top-notch talent as we continue to build the best global analytics consulting team in the world. As a Data Scientist, you will apply strong expertise in AI through the use of machine learning, data mining, and information retrieval to design, prototype, and build next generation advanced analytics engines and services. You will collaborate with cross-functional teams and business partners to define the technical problem statement and hypotheses to test. You will develop efficient and accurate analytical models which mimic business decisions and incorporate those models into analytical data products and tools. You will have the opportunity to drive current and future strategy by leveraging your analytical skills as you ensure business value and communicate the results. Key Responsibilities Collaborate with business partners to develop innovative solutions to meet objectives utilizing cutting edge techniques and tools. Experiment, evaluate, and create generative AI products for a variety of tasks, such as extracting data, summarizing documents, and other generative model applications....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=9e54bf71e82aa2ff",
    "salary": "Full-time",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Peoplevisor is seeking an experienced Data Scientist who will support our product, sales, leadership and marketing teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. KEY EXPECTATIONS Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions. Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies. Assess the effectiveness and accuracy of new data sources and data gathering techniques....",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Data Scientist",
    "company": "Peoplevisor LLC",
    "jobLocation": "Irving, TX 75039",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0f1e2d3c4b5a6978",
    "salary": "n/a",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Sr Data Scientist GenAI",
    "company": "Select Minds LLC",
    "jobLocation": "Dallas, TX 75235 \n(Dallas Love Field area)",
    "jobUrl": "https://www.indeed.com/viewjob?jk=0adc95909d448a8e",
    "salary": "$150,000 - $210,000 a year - Full-time",
    "benefits": "Benefits\nPulled from the full job description\nOpportunities for advancement\nFlexible schedule\n&nbsp;",
    "qualifications": "10+ years of experience in data science / ML, with substantial work in NLP, LLMs, or Generative AI.; Deep hands-on experience in Python, using frameworks like PyTorch, TensorFlow, HuggingFace etc.; Proven track record building transformer/NLP / LLM models; experience with fine-tuning, prompt engineering.; Solid experience with information retrieval / search: keyword + semantic search, embeddings, vector databases.; Experience working in production / deploying models (batch and streaming), working with MLOps practices.; Strong algorithmic / statistical / mathematical fundamentals. Ability to reason about model behaviour, bias, uncertainty.; Good communicator: able to translate complex technical detail to business / non-technical stakeholders.; Nice to Have:; Master's in Computer Science, Computational Linguistics, Statistics, Machine Learning or related field.; Experience with multimodal models (vision + text) or emerging LLMs and agent-based systems.; Experience with open source LLMs & toolkits; familiarity with LangChain or similar frameworks.; Work remote temporarily due to COVID-19.",
    "description": "Benefits: Competitive salary Flexible schedule Opportunity for advancement Sr Data Scientist (NLP / LLM / Generative AI)...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Director, Data & AI Strategy",
    "company": "Cerebral",
    "jobLocation": "Remote in Dallas, TX",
    "jobUrl": "https://www.indeed.com/viewjob?jk=6580de0904e41258",
    "salary": "$175,000 - $225,000 a year",
    "benefits": "Not specified",
    "qualifications": "Not specified",
    "description": "Cerebral and Resilience Lab have joined forces to build a new standard in mental health care—one that emphasizes better outcomes through stronger clinical decision-making, rigorous training, and professional excellence. By combining Resilience Lab's Methodology & clinically-led training Institute with Cerebral's extensive reach, clinical network, and care capabilities, we are creating a national model for high-quality, integrated, and accessible behavioral health care. We believe quality mental health care starts with curiosity, professionalism, and mastery of clinical decision-making. Joining our team means committing to show up on your best foot every day where you'll be equipped with structured training, supportive supervision, and a methodology designed to guide you in making sound clinical decisions. The Role: Cerebral is committed to transforming mental health care through technology, clinical excellence, and data-driven insights. We are seeking a strategic and hands-on Director of Data & AI Strategy to lead our data organization and deliver our company's AI roadmap. This leader will own the data infrastructure, deliver executive-level reporting on key business and clinical metrics, and ensure that data and AI are core enablers of how we deliver care, measure outcomes, and scale impact. Who you are:...",
    "preferences": "Not specified"
  },
  {
    "jobTitle": "Azure Data Engineer",
    "company": "Data Ninjas Inc.",
    "jobLocation": "Irving, TX 75063",
    "jobUrl": "https://www.indeed.com/viewjob?jk=ab92c29f5d4a8f91",
    "salary": "$62.27 - $70.00 an hour - Contract",
    "benefits": "Not specified",
    "qualifications": "Optimize database performance through effective database design and management in SQL Server, Oracle, and Azure Data Lake.; Utilize AWS services for cloud-based data storage and processing solutions.; Implement analytics solutions using Looker and other BI tools to provide insights from complex datasets.; Conduct model training and support machine learning initiatives by preparing datasets for analysis.; Write efficient SQL queries for data retrieval and manipulation across various databases.; Ensure data quality and integrity through rigorous testing and validation processes.; Document processes, architectures, and workflows to facilitate knowledge sharing within the team.; Proficiency in programming languages such as Java, Python, VBA, or Bash (Unix shell).; Strong experience with big data technologies including Hadoop, Apache Hive, Spark, and Informatica.; Familiarity with cloud platforms like AWS or Azure Data Lake.; Solid understanding of database design principles in Microsoft SQL Server, Oracle, or similar systems.; Experience with RESTful APIs for integrating different services and applications.; Knowledge of linked data concepts and analytics methodologies.; Strong analytical skills with the ability to interpret complex datasets effectively.; Familiarity with Agile methodologies to enhance project delivery timelines.; Excellent communication skills to collaborate effectively with technical and non-technical stakeholders. If you are passionate about leveraging data to drive business outcomes and thrive in a fast-paced environment, we encourage you to apply for this exciting opportunity as a Data Engineer.; Job Type: Contract; Pay: $62.27 - $70.00 per hour; Expected hours: 40 per week",
    "description": "Job Overview We are seeking a skilled Data Engineer to join our dynamic team. In this role, you will be responsible for designing, building, and maintaining data pipelines and architectures that support our data-driven decision-making processes. You will work closely with data scientists and analysts to ensure that the data infrastructure meets the needs of the organization. The ideal candidate will have a strong background in big data technologies and a passion for optimizing data systems. Responsibilities Design and implement robust ETL processes to extract, transform, and load data from various sources into data warehouses. Develop and maintain scalable data pipelines using technologies such as Apache Hadoop, Spark, and Talend....",
    "preferences": "Not specified"
  }
]