[
  {
    "scholarship_title": "Regeneron Science Talent Search Scholarship",
    "amount": "$250,000",
    "deadline": "November 06, 2025",
    "description": "Each year, nearly 1,900 students enter the Regeneron STS, submitting original research in critically important scientific fields of study. Unique among high school competitions, the Regeneron STS focuses on identifying, inspiring, and engaging the most promising scientists among the nation’s high school seniors. All Regeneron STS entrants must follow the official rules of entry, which outline eligibility requirements, ethics statements, and rules for scientific research.",
    "details": "Focus: Identifying and inspiring future leaders in the field of science; Total Annual Awards: $3.1 million; First Place Prize: $250,000, the largest academic prize available to a U.S. high school student",
    "eligibility": "Applicants must be in their final year of high school.; They should be completing the necessary high school courses for college applications.; Applicants must not have graduated from high school before the Regeneron STS application deadline.; Previous participation in any prior STS is not allowed.",
    "url": "https://www.scholarships.com/scholarships/regeneron-science-talent-search-scholarship"
  },
  {
    "scholarship_title": "National GEM Consortium Fellowships",
    "amount": "Full-Tuition",
    "deadline": "November 14, 2025",
    "description": "The mission of The National GEM Consortium is to enhance the value of the nation’s human capital by increasing the participation of underrepresented groups (African Americans, American Indians, and Hispanic Americans) at the master’s and doctoral levels in engineering and science. GEM recruits high quality underrepresented students looking to pursue Master’s and Doctoral degrees in applied science and engineering, and matches their specific skills to the specific technical needs of GEM employer members. The number of recipients will vary, and this can cover up to full-tuition.",
    "details": "Not specified",
    "eligibility": "Not specified",
    "url": "https://www.scholarships.com/scholarships/national-gem-consortium-fellowships"
  },
  {
    "scholarship_title": "Boston University’s Noyce Scholarship Program",
    "amount": "Full-Tuition",
    "deadline": "November 15, 2025",
    "description": "The Joy and Justice in Mathematics Teaching and Learning (J-Squared) Project is a collaboration of the Wheelock College of Education and Human Development and the College of Arts and Sciences at Boston University and school districts in the Boston area. This program focuses on preparing teachers to facilitate meaningful mathematical discourse in the classroom while simultaneously increasing students’ critical consciousness of issues of racism and other social injustices. J-Squared scholars experience a rich, hands-on, inquiry-based teacher preparation program and work closely with teachers, mathematics educators, mathematicians and students.",
    "details": "Not specified",
    "eligibility": "Not specified",
    "url": "https://www.scholarships.com/scholarships/boston-universitys-noyce-scholarship-program"
  },
  {
    "scholarship_title": "National Space Club and Foundation Keynote Scholars Program",
    "amount": "$20,000",
    "deadline": "November 17, 2025",
    "description": "Since 2013, the National Space Club and Foundation Keynote Scholarship has offered a unique opportunity for a student to deliver the keynote address at the prestigious Goddard Memorial Dinner—an event attended by top space industry leaders. In addition to speaking at this high-profile event, the selected student receives a $20,000 scholarship to support their STEM academic journey. This award recognizes excellence in academics, public speaking, and passion for a career in science, technology, engineering, or mathematics.",
    "details": "$20,000 scholarship awarded for tuition for the upcoming academic year; Opportunity to deliver the keynote speech at the Goddard Memorial Dinner; Travel and lodging for the recipient and one guest are covered; Recognition at one of the most prestigious gatherings in the space industry; Scholarship check paid directly to the recipient’s college or university",
    "eligibility": "Must be a U.S. citizen; Open to high school seniors through graduate students; Must be pursuing a career in a STEM field; Must plan to attend an accredited U.S. college or university; Applicants must not have previously spoken at the Goddard Memorial Dinner",
    "url": "https://www.scholarships.com/scholarships/national-space-club-and-foundation-keynote-scholars-program"
  },
  {
    "scholarship_title": "Colonel Kathleen Swacina Scholarship",
    "amount": "$1,500",
    "deadline": "November 30, 2025",
    "description": "This scholarship has been established to honor Col. Kathleen Swacina, USA (Ret.), and her accomplishments throughout her career and her affiliation with AFCEA. The Col. Kathleen Swacina Scholarship is funded by the generous donation provided by Col. Kathleen Swacina and Lt. Col. Daniel Swacina, USA (Ret.).",
    "details": "$1,500 scholarship awarded to one student annually; Applies to full-time undergraduate or graduate studies at accredited four-year institutions; Community college students may apply if continuing to a four-year institution; Supports students majoring in STEM fields aligned with AFCEA’s mission; Encourages applicants who have overcome adversity or demonstrated resilience",
    "eligibility": "Must be a U.S. citizen or permanent resident; Must be one of the following:\n\n\nMember of the U.S. armed forces\nEnrolled in an ROTC program\nHonorably discharged U.S. military veteran\nDirect descendant of an AFCEA member or honorably discharged service member; Member of the U.S. armed forces; Enrolled in an ROTC program; Honorably discharged U.S. military veteran; Direct descendant of an AFCEA member or honorably discharged service member; Must be enrolled full-time at an accredited institution (including community colleges); Undergraduate students must be sophomores or juniors; graduate students must have completed at least two courses; Must maintain a minimum 2.8 GPA; Must be majoring in a STEM field in alignment with AFCEA’s mission",
    "url": "https://www.scholarships.com/scholarships/colonel-kathleen-swacina-scholarship"
  },
  {
    "scholarship_title": "Oracle Women In Leadership Scholarship",
    "amount": "$1,500",
    "deadline": "November 30, 2025",
    "description": "Oracle Women in Leadership seeks to recognize one outstanding student who shows potential to excel in college STEM studies by awarding a one-time scholarship to a deserving female active-duty military college student pursuing a STEM degree. This scholarship will be applied towards the students ongoing higher-level academic education at an accredited Community College or four-year college or university.",
    "details": "One-time $1,500 scholarship awarded to an outstanding active-duty military college student; Must be used at an accredited community college or four-year college/university; Scholarship must support continued STEM education; students graduating in the current award year are not eligible",
    "eligibility": "Must be a U.S. citizen or permanent resident; Must be a current member of the U.S. Armed Forces; Must be enrolled in an accredited community college or four-year college/university; Must major in a qualifying STEM field aligned with AFCEA’s mission; Must be in good academic standing with at least a 2.8 GPA (unweighted); Must demonstrate aptitude in STEM and well-rounded academic performance",
    "url": "https://www.scholarships.com/scholarships/oracle-women-in-leadership-scholarship"
  },
  {
    "scholarship_title": "AFCEA War Veterans Scholarships: Undergraduate Only",
    "amount": "$2,500",
    "deadline": "November 30, 2025",
    "description": "At the intersection of academic support and military dedication, the AFCEA Educational Foundation stands committed to uplifting U.S. military personnel through merit-based scholarships. Thanks to the collaboration between the AFCEA NOVA chapter and the AFCEA Educational Foundation, these opportunities are extended to individuals who have demonstrated excellence in their service.",
    "details": "Not specified",
    "eligibility": "Not specified",
    "url": "https://www.scholarships.com/scholarships/afcea-war-veterans-scholarships-undergraduate-only"
  },
  {
    "scholarship_title": "SBB Research Group STEM Scholarship",
    "amount": "$2,500",
    "deadline": "November 30, 2025",
    "description": "The SBB Research Group STEM Scholarship encourages and empowers students to create significant value and countless new opportunities for society through their pursuit of higher learning, especially through interdisciplinary combinations of Science, Technology, Engineering, and Mathematics (STEM).",
    "details": "Twelve (12) scholarship awards of $2,500 each per year; Awarded to the eligible candidate with the best submission as determined by the Scholarship Committee; Winner must accept the award within one week of notification to avoid disqualification",
    "eligibility": "Open to students pursuing higher education in STEM fields; Applicants must demonstrate a commitment to using STEM principles to improve the world",
    "url": "https://www.scholarships.com/scholarships/sbb-research-group-stem-scholarship"
  },
  {
    "scholarship_title": "MMUF Dissertation Grants",
    "amount": "$30,000",
    "deadline": "December 06, 2025",
    "description": "The MMUF Advancement Program Fellows initiative fosters diverse perspectives in graduate studies and academia, empowering alumni of the Mellon Mays Undergraduate Fellowship (MMUF) to contribute their unique viewpoints within their fields and to their students. These Fellows, who are MMUF program alumni, come together to prepare for graduate school, receive additional research funding, and benefit from professional support during their dissertation research journey.",
    "details": "Fellowships exclusively for Mellon Mays Undergraduate Fellowship alumni; Supports graduate students in completing their dissertations; Dissertation grant offers up to $30,000 for a 12-month period; Encourages fellows to seek dissertation grants from their home institutions",
    "eligibility": "Open to graduate students; Must have participated in the Mellon Mays Undergraduate Fellowship Program",
    "url": "https://www.scholarships.com/scholarships/mmuf-dissertation-grants"
  },
  {
    "scholarship_title": "Scarlett Family Foundation Scholarship",
    "amount": "$30,000",
    "deadline": "December 15, 2025",
    "description": "The Scarlett Family Foundation Scholarship supports Tennessee students pursuing business or STEM-related degrees at four-year, non-profit colleges or universities. Established in 2006, this program combines financial need and merit-based criteria to help Middle Tennessee students achieve their educational goals. Scholarships are available to high school graduates, GED recipients, and college undergraduates who meet the eligibility requirements.",
    "details": "Open to students pursuing Business or STEM degrees; Available to students attending four-year, non-profit colleges or universities; Scholarship amounts vary based on financial need; Applications open from September 15 to December 15 annually",
    "eligibility": "Graduating high school senior, GED recipient, or college freshman, sophomore, or junior; Must demonstrate financial need via a 1040 tax return; Graduate from a high school in one of Middle Tennessee’s 40 counties; Enrolled or planning to enroll full-time in the next academic year; Minimum ACT score of 21 and GPA of 2.5 or higher",
    "url": "https://www.scholarships.com/scholarships/scarlett-family-foundation-scholarship"
  },
  {
    "scholarship_title": "Parker Foundation Scholarship",
    "amount": "$2,000",
    "deadline": "December 31, 2025",
    "description": "Certifications and education programs provide opportunities and credibility for rural government employees, underprivileged citizens, and veterans seeking to start a career in the information technology (IT), medical, first responder, and emergency management fields. Being certified and educated by a reputable institution allows anyone to stand out from the crowd and be more likely to succeed in their positions and obtain a better quality of life.",
    "details": "Award amount: Up to $2,000 per student; Open to students enrolled in accredited programs or certification courses in IT, medical, first responder, or emergency management fields; No deadline; applications reviewed and scholarships awarded year-round; Applicants may not request more than $2,000",
    "eligibility": "Must be one of the following:\nUnderprivileged citizens\nU.S. military veterans\nRural government employees (individuals or collective agency applications); Underprivileged citizens; U.S. military veterans; Rural government employees (individuals or collective agency applications); Must be enrolled in an accredited university, junior college, trade school, or certification program; Provide documentation verifying enrollment and eligibility",
    "url": "https://www.scholarships.com/scholarships/parker-foundation-scholarship"
  },
  {
    "scholarship_title": "NDSGC American Indian Scholarship",
    "amount": "$10,000",
    "deadline": "January 01, 2026",
    "description": "The American Indian Scholarship is designed to encourage and support tribal college students interested in pursuing STEM degrees and continuing their education.",
    "details": "Five scholarships of $2,500 each; Targeted at students from five specific tribal colleges in North Dakota; Designed to support STEM and STEM Education degrees",
    "eligibility": "Enrolled at one of the five specified tribal colleges in North Dakota; U.S. Citizenship required; Must be in good academic standing; Pursuing a STEM or STEM Education degree; Nursing majors are ineligible due to NASA rules and regulations",
    "url": "https://www.scholarships.com/scholarships/ndsgc-american-indian-scholarship"
  },
  {
    "scholarship_title": "Microsoft Imagine Cup",
    "amount": "$100,000",
    "deadline": "January 05, 2026",
    "description": "The Imagine Cup is more than just a competition—it's a transformative experience designed to help student founders turn their innovative ideas into reality. Participants receive access to cutting-edge technology, expert mentorship, and the opportunity for global recognition and prizes that can accelerate the growth of their startup or project.",
    "details": "Opportunity to receive technical and entrepreneurial mentorship; Global recognition and valuable prizes for winning teams; Participants must create a fully functional software project with supporting documentation; Teams can have up to four eligible students; Mentors (such as faculty members) and other associates can support the project (business planning, marketing, design, etc.)",
    "eligibility": "Open to students aged 18 and older; Must be actively enrolled in a high school or college; Open to students worldwide, except for residents of Cuba, Iran, North Korea, Sudan, and Syria; Open to students majoring in or interested in:\n\nComputer Science\nDesign\nElectronics\nComputer Engineering\nGraphic Design\nFilm, Television & Interactive Media; Computer Science; Design; Electronics; Computer Engineering; Graphic Design; Film, Television & Interactive Media",
    "url": "https://www.scholarships.com/scholarships/microsoft-imagine-cup"
  },
  {
    "scholarship_title": "Amazon Future Engineer Scholarship",
    "amount": "$40,000",
    "deadline": "January 09, 2026",
    "description": "Amazon Future Engineer students can boost their future for themselves and their community with the support of college funding, paid internships, and industry mentors. Last year, 400 students selected from nearly 40 states, Washington, D.C. and Puerto Rico were awarded this $40,000 scholarship, along with a paid internship at Amazon.",
    "details": "Up to $40,000 in college funding ($10,000 per year for up to 4 years); Paid summer internship at Amazon following the freshman year of college; Access to industry mentors and professional development; Awarded to 400 students annually",
    "eligibility": "Must be a high school senior currently attending school in the U.S. and can demonstrate financial need; Must have completed or be currently enrolled in a computer science or engineering course (including college dual enrollment); Must be planning to pursue a bachelor’s degree in a computer science-related field from a 4-year college or transfer from a 2-year college; Must have a minimum 2.3 GPA on a 4.0 scale",
    "url": "https://www.scholarships.com/scholarships/amazon-future-engineer-scholarship"
  },
  {
    "scholarship_title": "Joyce Brocaglia- Executive Women's Forum INI Fellowship",
    "amount": "Full-Tuition",
    "deadline": "January 15, 2026",
    "description": "INI fellowships are merit-based and will be awarded during the admissions application review process. While students may indicate that they are interested in receiving a fellowship, there is no application process for this type of opportunity. Established in honor of the CEO of Alta Associates and founder of the Executive Women's Forum (EWF), the Joyce Brocaglia-EWF Endowed Fellowship in the Information Networking Institute (INI) seeks to provide support to INI graduate students who qualify for financial aid.",
    "details": "Not specified",
    "eligibility": "Not specified",
    "url": "https://www.scholarships.com/scholarships/joyce-brocagliaexecutive-womens-forum-ini-fellowship"
  },
  {
    "scholarship_title": "HBCU Week x FOSSI STEM Scholarship",
    "amount": "$40,000",
    "deadline": "January 15, 2026",
    "description": "We're looking for students interested in making an impact and innovation through science, engineering, and math. Check the list of preferred STEM majors below. If you're pursuing one of them, apply for FOSSI. Preferred STEM majors are identified on a yearly basis by FOSSI administrators based on relevance to the chemical industry and supporting sponsor preferences.",
    "details": "Total Scholarship Amount: $40,000; Supports students pursuing STEM-related degrees at HBCUs; Includes internship opportunities, leadership training, and mentoring",
    "eligibility": "Must be a U.S. citizen or legal permanent resident; High school seniors with a minimum GPA of 3.0 (unweighted); Planning to enroll in an HBCU as a freshman; Pursuing a STEM major related to the chemical and engineering industry (see preferred majors below); Must demonstrate financial need",
    "url": "https://www.scholarships.com/scholarships/hbcu-week-x-fossi-stem-scholarship"
  },
  {
    "scholarship_title": "Center for Women In Technology (CWIT) Scholars Program at UMBC",
    "amount": "$88,000",
    "deadline": "January 15, 2026",
    "description": "The Center for Women in Technology (CWIT, pronounced “see-wit”) is dedicated to increasing the representation of women in creating technology and in engineering and information technology fields. A successful program for female-friendly engineering and information technology education at UMBC will help make UMBC a destination for women (and their allies) interested in technical careers and serve as a national model for other universities.",
    "details": "Not specified",
    "eligibility": "Not specified",
    "url": "https://www.scholarships.com/scholarships/center-for-women-in-technology-cwit-scholars-program-at-umbc"
  },
  {
    "scholarship_title": "DOE Computational Science Graduate Fellowship",
    "amount": "Full-Tuition",
    "deadline": "January 16, 2026",
    "description": "The DOE CSGF is open to U.S. citizens or lawful permanent residents who plan full-time, uninterrupted study toward a Ph.D. at an accredited U.S. university.",
    "details": "Provides four years of financial support; Available for students pursuing a Ph.D. in DOE-related fields; Requires full-time enrollment at an accredited U.S. university",
    "eligibility": "Must be a U.S. citizen or lawful permanent resident; Must plan full-time, uninterrupted study toward a Ph.D. at an accredited U.S. university; Must enroll at a different institution for Ph.D. studies if currently in a master’s program; Must be an undergraduate senior, a first-year graduate student (must not have completed more than one year of coursework), a current master's degree student (must enroll at a different institution for Ph.D.), or an employed individual or other applicant matriculating into graduate school",
    "url": "https://www.scholarships.com/scholarships/doe-computational-science-graduate-fellowship"
  },
  {
    "scholarship_title": "AMS Graduate Fellowships",
    "amount": "$26,000",
    "deadline": "January 17, 2026",
    "description": "The AMS Fellowship Program is a source of unique opportunities for outstanding students looking to pursue graduate education in the fields of atmospheric sciences, chemistry, computer sciences, engineering, environmental sciences, hydrology, mathematics, oceanography, and physics. To be eligible, applicants must be entering their first year of graduate school in the fall of the year the scholarship is offered and pursuing a degree in the atmospheric or related sciences at a US accredited institution.",
    "details": "Not specified",
    "eligibility": "Not specified",
    "url": "https://www.scholarships.com/scholarships/ams-graduate-fellowships"
  },
  {
    "scholarship_title": "Quad City Engineering and Science Council Scholarship (QCESC)",
    "amount": "$2,500",
    "deadline": "January 28, 2026",
    "description": "Since 1994, the Quad City Engineering and Science Council, in collaboration with its member societies, local businesses, and regional universities, has been annually providing one-time scholarships to high school seniors pursuing STEM (Science, Technology, Engineering, or Mathematics) studies. Most recently, 17 scholarships totaling $31,500 were awarded at the Annual National Engineers Week STEM Celebration on February 22nd.",
    "details": "Multiple one-time grants/scholarships; Awards range from $1,000 to $2,500; Selection based on academics, civic/community service, extracurricular involvement, career goals, and an essay; Funds must be applied to tuition or fees related to STEM degree pursuit",
    "eligibility": "High school senior and resident of one of the following counties:\nMercer\nRock Island\nHenry\nWhiteside\nCarroll\nKnox\nLee\nClinton\nScott\nMuscatine\nLouisa County; Mercer; Rock Island; Henry; Whiteside; Carroll; Knox; Lee; Clinton; Scott; Muscatine; Louisa County; Plan to study STEM-related degree at an accredited four-year college or university, pursue an associate degree at a community or junior college, or obtain a skilled trades certification",
    "url": "https://www.scholarships.com/scholarships/quad-city-engineering-and-science-council-scholarship-qcesc"
  },
  {
    "scholarship_title": "Ernest F. Hollings Undergraduate Scholarship",
    "amount": "$40,000",
    "deadline": "January 31, 2026",
    "description": "The Ernest F. Hollings Undergraduate Scholarship is a prestigious scholarship that provides up to $40,000 and a paid internship at National Oceanic and Atmospheric Administration (NOAA). The award includes an academic award of $9,500 per year for two years of full-time study for students majoring in fields that support NOAA’s mission, including STEM and social science.",
    "details": "Up to $9,500 per year for two years of full-time study.; 10-week paid summer internship at a NOAA facility, with a stipend of $700 per week.; Includes travel funds to attend the NOAA Scholarship Program orientation and Science & Education Symposium.; Housing subsidy provided for scholars who do not reside at home during the internship.",
    "eligibility": "Undergraduate students studying in fields related to oceanic and atmospheric science, research, technology, or education.; Must demonstrate an interest in NOAA’s mission and a commitment to environmental stewardship and literacy.",
    "url": "https://www.scholarships.com/scholarships/ernest-f-hollings-undergraduate-scholarship"
  },
  {
    "scholarship_title": "LPGA Chevron Changing the Face of Golf Scholarship",
    "amount": "$10,000",
    "deadline": "January 31, 2026",
    "description": "The LPGA Foundation and Chevron are offering an excellent opportunity to help five young women pay for college. Each winner will be awarded $2,500 in the spring. The scholarship renewable for four years of studies, totaling $10,000 per recipient.",
    "details": "Five scholarships of $2,500 each; Renewable for four years; Supports female high school seniors from minority backgrounds; Focuses on students pursuing STEM-related undergraduate degrees",
    "eligibility": "High school senior; Identify as Asian, Black or African-American, Hispanic/Latin-American, American Indian or Alaskan Native, Native Hawaiian, or other Pacific Islander; Minimum GPA of 3.0 on a 4.0 scale; Plan to pursue a STEM-focused educational path; Demonstrate involvement in community service",
    "url": "https://www.scholarships.com/scholarships/lpga-chevron-changing-the-face-of-golf-scholarship"
  },
  {
    "scholarship_title": "Lisa Kaminski Memorial Scholarship",
    "amount": "$3,000",
    "deadline": "January 31, 2026",
    "description": "Pay It Forward Cincinnati awards the $3,000 Lisa Kaminski Scholarship to a deserving high school senior in the greater Cincinnati area each year.",
    "details": "Merit-based; Northern Kentucky students may apply; If a tiebreaker is needed, woman applicants will be given preference; Applications close January 31st; Winner is announced by April 15th",
    "eligibility": "High school senior in the Greater Cincinnati area; Planning to study STEM, especially technology; Commitment to community service",
    "url": "https://www.scholarships.com/scholarships/lisa-kaminski-memorial-scholarship"
  },
  {
    "scholarship_title": "EPP/MSI Undergraduate Scholarship Program",
    "amount": "$45,000",
    "deadline": "January 31, 2026",
    "description": "The EPP/MSI Undergraduate Scholarship provides funds for two years of undergraduate study to rising junior undergraduate students majoring in Science, Technology, Engineering and Mathematics (STEM) fields that directly support NOAA's mission.",
    "details": "Provides two years of undergraduate support for junior students in STEM fields.; Includes two paid summer internships at NOAA facilities.; Total award value of up to $45,000, covering travel and conference participation.; Orientation at NOAA and presentation of research results at an Education and Science Symposium.",
    "eligibility": "Open to U.S. citizens or U.S. nationals.; Applicants must be full-time 2nd-year students in a four-year program, transferring from a two-year to a four-year institution, or 3rd-year students in a five-year program.; Enrolled in a discipline related to NOAA's programs and mission at an accredited Minority Serving Institution in the U.S. or U.S. territories.; Maintain a minimum GPA of 3.2 on a 4.0 scale.",
    "url": "https://www.scholarships.com/scholarships/epp-msi-undergraduate-scholarship-program"
  },
  {
    "scholarship_title": "Choose Ohio First STEMM Scholarship",
    "amount": "$20,000",
    "deadline": "January 31, 2026",
    "description": "Our university was built on a hilltop in Akron — a word meaning “the highest point.” For over 150 years, that’s where we’ve set our sights, rising from one peak to another in engineering, business, technology, health care, and the arts and sciences. Bound and determined to meet every challenge, we continue to climb, to forge new paths and reach new heights — and we want you to join us. Throughout their generosity, the University of Akron offers many different types of scholarships for students.",
    "details": "Not specified",
    "eligibility": "Not specified",
    "url": "https://www.scholarships.com/scholarships/choose-ohio-first-stemm-scholarship"
  },
  {
    "scholarship_title": "National Videogame Museum Scholarships",
    "amount": "$5,000",
    "deadline": "June 01, 2026",
    "description": "The National Videogame Museum offers five distinct scholarships aimed at supporting students pursuing careers in gaming and technology. While three scholarships are exclusive to Texas residents, two are open to women across the United States. Each scholarship has specific eligibility criteria and award amounts, reflecting the museum's commitment to nurturing future innovators in the gaming industry.",
    "details": "Five scholarships available for students pursuing careers in gaming or technology-based fields; Three scholarships exclusive to Texas residents; two open to women nationwide; Scholarship amounts range from $2,000 to $5,000; Application deadline: June 1st; Scholarships are non-renewing and awarded for a single term",
    "eligibility": "High school seniors graduating in Spring or current undergraduate students; Minimum GPA of 3.0 on a 4.0 scale; U.S. citizenship (natural-born or naturalized); Specific scholarships require Texas residency or graduation from a Texas Title 1 school; Amie Dansby Women in Technology Awards require applicants to be female U.S. residents",
    "url": "https://www.scholarships.com/scholarships/national-videogame-museum-scholarships"
  },
  {
    "scholarship_title": "Joanne Pransky Celebration of Women in Robotics",
    "amount": "$3,000",
    "deadline": "February 28, 2026",
    "description": "The Joanne Pransky Memorial Scholarship honors the legacy of Joanne Pransky, \"The World’s First Robot Psychiatrist,\" who inspired young women to explore the social side of robotics. Joanne’s work helped break down barriers for women in STEM, particularly in the field of robotics. This scholarship aims to continue her legacy by supporting female-identifying students pursuing careers in robotics.",
    "details": "Open to female-identifying high school, two-year, four-year undergraduate, and graduate students; Must have an interest in working in the field of robotics; Award amount and number of awards may vary; Recognizes creativity and forward-thinking in the field of robotics",
    "eligibility": "Must identify as female; Must be a high school student, undergraduate student, or graduate student; Must demonstrate an interest in working in robotics; Open to students in any accredited high school, college, or university",
    "url": "https://www.scholarships.com/scholarships/joanne-pransky-celebration-of-women-in-robotics"
  },
  {
    "scholarship_title": "SMA Native American STEM Scholarship",
    "amount": "$20,000",
    "deadline": "June 13, 2026",
    "description": "Souder Miller & Associates (SMA) offers a $5,000 per academic year scholarship opportunity to Native American students pursuing a four-year degree in a STEM field.",
    "details": "$5,000 per academic year for up to four years; Supports tuition, fees, books, and on-campus housing/meals; Open to Native American students pursuing four-year STEM degrees; Renewal is automatic but subject to Scholarship Committee discretion; Must be Native American with a Certificate of Indian Blood (CIB); Accepted to or enrolled in a four-year undergraduate institution; Major in a STEM field (Science, Technology, Engineering, or Mathematics); Minimum cumulative GPA of 3.0 (unofficial transcripts accepted); Commitment to completing 6 hours of community service per academic year; Complete and sign the application form and applicant agreement; Submit a copy of your Certificate of Indian Blood (CIB); Provide unofficial transcripts showing a cumulative GPA of 3.0 or higher; Submit a letter of admission to a four-year undergraduate institution; Include a clear photo (no hats or sunglasses); Provide two letters of reference (one from an instructor/advisor, one from a non-family source); Write a one-page essay describing your background, future goals, and how a STEM education benefits you and your community; Optionally, submit a second essay about extracurricular or community service activities, especially those related to STEM; Submit your complete application by June 13, 5:00 PM MST",
    "eligibility": "Must be Native American with a Certificate of Indian Blood (CIB); Accepted to or enrolled in a four-year undergraduate institution; Major in a STEM field (Science, Technology, Engineering, or Mathematics); Minimum cumulative GPA of 3.0 (unofficial transcripts accepted); Commitment to completing 6 hours of community service per academic year",
    "url": "https://www.scholarships.com/scholarships/sma-native-american-stem-scholarship"
  },
  {
    "scholarship_title": "The Dawna J Colbert & John Fitzpatrick Scholarship",
    "amount": "$10,000",
    "deadline": "March 07, 2026",
    "description": "The TCGi Foundation's mission is to address the diversity gap in tech by breaking down barriers for young Black women studying and entering the field. We want to shift the mindset of what is possible.",
    "details": "The Dawna J. Colbert Scholarship is for graduating high school seniors entering college; The John Fitzpatrick Scholarship is for current college or graduate students; Both scholarships support studies in Computer Science, Information Technology, or Engineering; Open to students attending two- or four-year educational institutions; Each scholarship honors the spirit and dedication of its namesake",
    "eligibility": "Applicants for the Dawna J. Colbert Scholarship must be graduating high school seniors; Applicants for the John Fitzpatrick Scholarship must be enrolled in a college or graduate program; Must be pursuing a degree in Computer Science, Information Technology, or Engineering; Must attend or plan to attend an accredited two- or four-year college or university",
    "url": "https://www.scholarships.com/scholarships/the-dawna-j-colbert-and-john-fitzpatrick-scholarship"
  },
  {
    "scholarship_title": "I/ITSEC Postgraduate Scholarship",
    "amount": "$10,000",
    "deadline": "June 21, 2026",
    "description": "The Interservice/Industry Training, Simulation and Education Conference (I/ITSEC) offers $5,000 scholarships to master students and $10,000 scholarships to doctoral students. Awards are presented annually to students seeking advanced degrees to develop their technical talents in the defense industry.",
    "details": "Awarded to masters and doctoral students with interest in the Modeling & Simulation, Training, and/or Education Industry; $5,000 and $10,000 awards; Scholarships may be used for tuition, books, fees, or room and board; Funds will be disbursed by the awardee's school",
    "eligibility": "Enrolled or accepted in a full-time masters or doctoral program at a U.S. Institution; Studying engineering, operations research/systems analysis/mathematics, distance learning methodologies, psychology, instructional design and training methodology, or computer/information science; Not fully-funded by other scholarships or grants; Must commit to; Attend the I/ITSE; Prepare a paper to be presented at the I/ITSEC 1 year after degree completion or within 3 years after scholarship is awarded",
    "url": "https://www.scholarships.com/scholarships/i-itsec-postgraduate-scholarship"
  },
  {
    "scholarship_title": "National Space Club and Foundation Keynote Scholars Program",
    "amount": "$20,000",
    "deadline": "November 17, 2025",
    "description": "Since 2013, the National Space Club and Foundation Keynote Scholarship has offered a unique opportunity for a student to deliver the keynote address at the prestigious Goddard Memorial Dinner—an event attended by top space industry leaders. In addition to speaking at this high-profile event, the selected student receives a $20,000 scholarship to support their STEM academic journey. This award recognizes excellence in academics, public speaking, and passion for a career in science, technology, engineering, or mathematics.",
    "details": "$20,000 scholarship awarded for tuition for the upcoming academic year; Opportunity to deliver the keynote speech at the Goddard Memorial Dinner; Travel and lodging for the recipient and one guest are covered; Recognition at one of the most prestigious gatherings in the space industry; Scholarship check paid directly to the recipient’s college or university",
    "eligibility": "Must be a U.S. citizen; Open to high school seniors through graduate students; Must be pursuing a career in a STEM field; Must plan to attend an accredited U.S. college or university; Applicants must not have previously spoken at the Goddard Memorial Dinner",
    "url": "https://www.scholarships.com/scholarships/national-space-club-and-foundation-keynote-scholars-program"
  },
  {
    "scholarship_title": "USRA Distinguished Undergraduate Awards",
    "amount": "$5,000",
    "deadline": "August 07, 2026",
    "description": "The USRA Distinguished Undergraduate Awards provide college scholarship awards to students who have shown a career interest in science or engineering with an emphasis on space research or space science education, and aeronautics-related sciences.",
    "details": "Up to five one-time $5,000 awards are presented each fall; Scholarships honor influential figures in space science and education; Funded entirely through private donations",
    "eligibility": "Full-time undergraduate student at a four-year accredited college or university; Enrolled in a degree program in science or engineering; Within two years of earning a B.S. or B.A. degree at the time the award is received; Field of study must relate to science, engineering, life sciences, or science education",
    "url": "https://www.scholarships.com/scholarships/usra-distinguished-undergraduate-awards"
  },
  {
    "scholarship_title": "Microsoft Imagine Cup",
    "amount": "$100,000",
    "deadline": "January 05, 2026",
    "description": "The Imagine Cup is more than just a competition—it's a transformative experience designed to help student founders turn their innovative ideas into reality. Participants receive access to cutting-edge technology, expert mentorship, and the opportunity for global recognition and prizes that can accelerate the growth of their startup or project.",
    "details": "Opportunity to receive technical and entrepreneurial mentorship; Global recognition and valuable prizes for winning teams; Participants must create a fully functional software project with supporting documentation; Teams can have up to four eligible students; Mentors (such as faculty members) and other associates can support the project (business planning, marketing, design, etc.)",
    "eligibility": "Open to students aged 18 and older; Must be actively enrolled in a high school or college; Open to students worldwide, except for residents of Cuba, Iran, North Korea, Sudan, and Syria; Open to students majoring in or interested in:\n\nComputer Science\nDesign\nElectronics\nComputer Engineering\nGraphic Design\nFilm, Television & Interactive Media; Computer Science; Design; Electronics; Computer Engineering; Graphic Design; Film, Television & Interactive Media",
    "url": "https://www.scholarships.com/scholarships/microsoft-imagine-cup"
  }
]